{
  "sub_stage": "2.5",
  "unknowns_requests": [
    {
      "information_needed": "Complete hyperscaler partner agreements and economic terms: (1) Full AWS partner agreement (reseller terms, consulting partner terms, APN tier and benefits), (2) Full Microsoft Azure CSP 2-Tier Distributor agreement, (3) Full Google Cloud partner agreement, (4) All amendments, side letters, and supplemental agreements, (5) Economic terms: Exact partner credit/rebate rates by tier and volume thresholds, (6) Termination provisions: Notice periods, termination-for-cause requirements, wind-down obligations, (7) Volume commitments: Minimum spend or growth requirements to maintain partner status and credit rates, (8) Change of control provisions: What M&A events trigger review or modification of partnership terms, (9) Exclusivity or competitive restrictions, (10) Most recent renewal documentation showing current term and expiration dates",
      "why_needed": "EXISTENTIAL BUSINESS VIABILITY ASSESSMENT: Public Cloud represents $1,683M revenue (61% of total) and is ABSOLUTELY DEPENDENT on hyperscaler partnerships. Without seeing actual agreements, cannot assess: (1) TERMINATION RISK - Can hyperscalers terminate with 30 days notice? 90 days? Require cause? If immediate termination possible, business has zero contractual protection. (2) ECONOMIC STABILITY - Are partner credit rates guaranteed for contract term or can be modified at will? If modifiable, 10.4% margin could disappear overnight. (3) VOLUME COMMITMENT BREACH - If Rackspace has minimum spend commitments and customer churn is causing volume shortfall, may already be in breach triggering credit reductions or termination. (4) M&A CONSTRAINTS - Do agreements require hyperscaler consent for change of control? Could acquirer trigger partnership termination? (5) COMPETITIVE RESTRICTIONS - Do agreements limit Rackspace's ability to support multiple hyperscalers or build alternative platforms? Cannot value Public Cloud segment or assess acquisition risk without complete understanding of contractual foundation. Any serious acquirer will demand full agreements in exclusivity phase - refusal to provide would be deal-killer indicating hidden problems.",
      "request_to": "Management / General Counsel AND Chief Revenue Officer",
      "format": "Legal agreements: Provide complete executed copies of all hyperscaler partner agreements with all amendments and side letters. Mark confidential/sensitive terms for NDA protection but provide complete documents. Economic summary: Excel file showing: (1) Partner credit/rebate rates by hyperscaler and tier (current rates and any historical changes), (2) Volume thresholds for credit tiers (what revenue/consumption volume required for each tier), (3) Rackspace's current performance vs volume commitments (are we meeting, exceeding, or failing commitments?), (4) Termination provisions summary (notice periods, cause requirements, wind-down terms), (5) Change of control language (exact contractual text on M&A impact). Legal analysis: Have outside counsel provide memo analyzing: (1) Termination risk (how easy can hyperscalers exit? what protection does Rackspace have?), (2) Change of control impact (what M&A events trigger issues? can partnerships be assigned to acquirer?), (3) Economic vulnerability (how much unilateral control do hyperscalers have over Rackspace's economics?)."
    },
    {
      "information_needed": "VMware (Broadcom) licensing cost impact and strategic options: (1) VMware licensing spend by year: 2022, 2023, 2024, 2025 YTD (quarterly granularity showing when Broadcom price increases took effect), (2) VMware contract terms: Current agreement expiration dates, termination provisions, flexibility to reduce licenses as Private Cloud revenue declines, (3) Broadcom price increase specifics: What exact % increase did Rackspace experience? When effective? Which products affected (vSphere, vSAN, NSX, support)?, (4) Rackspace response: Has Rackspace negotiated with Broadcom for relief? What was outcome? Any concessions received?, (5) Customer price pass-through: Has Rackspace increased Private Cloud pricing to offset VMware costs? What % passed through vs absorbed? What customer reaction/churn impact?, (6) Alternative platform migration analysis: Has Rackspace developed plan to migrate customers from VMware to alternatives (OpenStack, Hyper-V)? What timeline, cost, risk assessment, expected customer loss?, (7) Private Cloud margin impact: What is actual gross margin impact from VMware price increase? Has 38.6% compressed to what level?",
      "why_needed": "PRIVATE CLOUD SEGMENT VIABILITY DETERMINATION: Private Cloud represents $1,055M revenue (39% of total) declining 13% YoY. VMware price shock of 200-300% creates EXISTENTIAL MARGIN THREAT. Without knowing actual cost impact, cannot determine: (1) CURRENT PROFITABILITY - Has 38.6% gross margin compressed to 30%? 25%? 20%? At what margin level does segment become uneconomical after allocated overhead? (2) CUSTOMER PRICING DECISIONS - If Rackspace passing through VMware costs, what % price increase are customers seeing? Is this accelerating -13% YoY decline to -20% or -30%? (3) STRATEGIC OPTIONS - Can Rackspace realistically migrate off VMware, or is customer base permanently locked in? If locked in, must accept ongoing Broadcom pricing power with no escape. (4) SEGMENT VALUATION - Acquirer must understand true Private Cloud economics post-VMware-shock. If margins compressed 50% (from 38.6% to 19%), segment value declines proportionally. (5) PROFIT CONCENTRATION IMPACT - Stage 2.4 showed Private Cloud contributes 40-50% of total operating income - if margins compressed significantly, impacts entire business viability. Cannot accurately model Private Cloud future without actual VMware cost data.",
      "request_to": "Management / CFO AND VP Private Cloud Operations",
      "format": "Financial analysis: Excel file showing: (1) Annual VMware licensing spend 2022-2025 with quarterly breakout showing price increase timing, (2) VMware spend as % of Private Cloud revenue (COGS %) trending over time, (3) Private Cloud gross margin pre- and post-Broadcom price increase showing compression magnitude, (4) Customer price pass-through analysis: How much VMware cost increase has been passed to customers? Revenue impact? Churn impact?, (5) Projected Private Cloud gross margin 2025-2027 under scenarios: (A) Absorb all VMware increases, (B) Pass through 50%, (C) Pass through 100%, (D) Migrate to alternative platforms. Contracts: Provide current VMware agreement(s) showing: Licensing terms, expiration dates, flexibility to reduce licenses, termination provisions. Strategic analysis: Provide any internal memos, board presentations, or strategy documents assessing: (1) VMware migration feasibility and risks, (2) Alternative platform evaluation (OpenStack, Hyper-V), (3) Recommendations on absorb vs pass-through vs migrate decisions. Competitor intelligence: What are other VMware MSPs doing? (industry data on how competitors responding to Broadcom pricing)."
    },
    {
      "information_needed": "Partner revenue concentration and dependency analysis: (1) Public Cloud revenue by hyperscaler: % and $ for AWS, Azure, Google, other (quarterly trend 2022-2025 showing any concentration shifts), (2) Private Cloud technology platform distribution: % and $ for VMware, OpenStack, Microsoft Hyper-V, other (quarterly trend showing VMware concentration), (3) Partner contribution ranking: Rank all major partners by % of total Rackspace revenue they enable (AWS X%, VMware Y%, Azure Z%, etc.), (4) Customer multi-cloud adoption: What % of Public Cloud customers use single hyperscaler vs multiple? If multiple, what typical combinations (AWS+Azure, Azure+Google, all three)? (5) Geographic/segment concentration: Does partner concentration vary by segment? (e.g., is Government primarily AWS or mixed?, is UK primarily Azure or mixed?)",
      "why_needed": "PARTNER CONCENTRATION RISK QUANTIFICATION: If Public Cloud is 70% AWS, 20% Azure, 10% Google, then AWS partnership is DISPROPORTIONATELY CRITICAL - AWS termination would eliminate 43% of total Rackspace revenue (70% of 61%), creating single-point-of-failure dependency. This would justify 15-20% valuation discount for concentration risk and would require AWS partnership assignment guarantee as M&A closing condition. If Public Cloud is more balanced (40% AWS, 35% Azure, 25% Google), concentration risk is distributed - no single partner can eliminate majority of segment. If Private Cloud is 90% VMware (only 10% OpenStack/Hyper-V), VMware dependency is even more severe than hypothesized - essentially impossible to migrate off VMware without destroying segment. Partner concentration determines: (1) VALUATION DISCOUNTS (high concentration = 10-20% haircut), (2) KEY PERSON/PARTNER RISK (which relationships are most critical to protect in M&A), (3) STRATEGIC REPOSITIONING PRIORITIES (reduce concentration by building out underweight partners or migrating customers across platforms), (4) NEGOTIATING LEVERAGE (high concentration gives dominant partner maximum leverage, Rackspace has zero leverage). Without concentration data, cannot accurately assess partner dependency severity or structure appropriate risk mitigation.",
      "request_to": "Management / Chief Revenue Officer AND CFO",
      "format": "Revenue analysis: Excel file with multiple tabs: (1) Public Cloud revenue by hyperscaler: Quarterly data 2022-2025 showing $ and % for AWS, Azure, Google, other, (2) Private Cloud revenue by platform: Quarterly data showing $ and % for VMware, OpenStack, Hyper-V, other, (3) Partner contribution to total revenue: Table ranking all major technology partners by % of total Rackspace revenue (includes hyperscalers, VMware, other infrastructure/software vendors), (4) Customer multi-cloud analysis: % of customers using 1 hyperscaler only, 2 hyperscalers, 3 hyperscalers; most common multi-cloud combinations, (5) Concentration metrics: Herfindahl-Hirschman Index (HHI) for partner concentration; top partner %, top 3 partners %, top 5 partners %. Trend analysis: Show how concentration has changed over time - is Rackspace becoming MORE concentrated (risky) or MORE diversified (less risky) in specific partners? Scenario modeling: If top partner relationship terminated, what immediate revenue loss? What % of customers could migrate to alternative platforms vs total loss?"
    },
    {
      "information_needed": "FedRAMP authorization stability, change of control provisions, and M&A impact: (1) Current FedRAMP authorization status: JAB or Agency-sponsored? Expiration date? Security authorization boundary description, (2) Recent compliance assessments: Latest 3PAO assessment date and results, any findings or deficiencies requiring remediation, open POA&Ms (Plan of Action & Milestones) and closure deadlines, risk of authorization suspension or revocation, (3) Change of control documentation: Exact FedRAMP policy language on what constitutes change of control, who is acceptable acquirer (domestic only? foreign excluded?), what review process is triggered, (4) Re-authorization requirements: If M&A triggers review, what is re-authorization timeline and process? Can customers continue service during re-authorization or is there service interruption? What % customer loss risk during re-authorization?, (5) Historical precedent: Examples of other FedRAMP providers successfully (or unsuccessfully) transferring authorization through M&A, (6) Customer contract provisions: Do Government customer contracts allow termination if FedRAMP authorization lost or M&A occurs? What notice periods?, (7) Alternative structures: Could proxy board or operating agreement structure preserve authorization with foreign acquirer? What limitations would that impose?",
      "why_needed": "M&A FEASIBILITY AND GOVERNMENT SEGMENT VALUE DETERMINATION: FedRAMP authorization dependency is likely BIGGEST M&A CONSTRAINT. Government segment represents estimated $270-410M revenue (10-15% of total) and $70-145M operating profit (15-25% of total operating income). If foreign acquirer automatically INVALIDATES FedRAMP with no feasible workaround, eliminates 60-70% of potential acquirer pool - all European, Asian, Middle Eastern buyers excluded. Government segment would have ZERO VALUE to these buyers and must be carved out or sold separately to US buyer. If domestic acquirer triggers 12-18 month re-authorization process with HIGH CUSTOMER LOSS RISK (agencies won't wait 12-18 months for re-auth, will migrate to alternative FedRAMP providers), Government segment value must be heavily discounted (haircut by expected 30-50% customer loss + re-authorization costs $5-10M + business disruption). If authorization is currently UNSTABLE (pending findings at risk of causing suspension), Government segment may have NEGATIVE VALUE (compliance liability exceeds revenue potential). M&A structure and valuation cannot be determined without complete understanding of: (1) Who can buy (foreign excluded? domestic only? must already have FedRAMP?), (2) What process required (immediate transfer? 12-18 month re-auth? continuous service or interruption?), (3) What customer loss risk (0-10% best case? 30-50% likely? 70%+ worst case?). This is CRITICAL PATH ITEM for any M&A transaction.",
      "request_to": "Management / General Counsel AND VP Government Solutions AND FedRAMP Compliance Officer",
      "format": "Compliance documentation: Provide: (1) Current FedRAMP authorization letter showing JAB/Agency status and expiration, (2) Latest 3PAO assessment report (can redact specific vulnerabilities but need overall risk rating and open findings count), (3) POA&M status report showing open remediation items and criticality, (4) FedRAMP PMO correspondence on any compliance issues or concerns. Change of control analysis: (1) FedRAMP policy documentation on change of control requirements (cite specific policy sections), (2) Legal memo from FedRAMP compliance counsel analyzing: Foreign vs domestic acquirer feasibility, Re-authorization timeline and process, Customer continuity during transition, Structural alternatives (proxy board, operating agreement), (3) Internal change of control playbook if one exists. Market research: (1) Case studies of other FedRAMP providers' M&A transactions: Who acquired whom? Was authorization maintained/transferred/re-obtained? What timeline? What customer impact?, (2) List of potential Government-focused acquirers who already have FedRAMP authorization and could potentially integrate without triggering review (other FedRAMP MSPs, defense contractors with cloud authorizations). Customer analysis: (1) Government customer contract terms showing termination provisions related to authorization loss or change of control, (2) Customer concentration in Government segment (top 10 agencies by revenue) to assess key relationship risk during M&A transition."
    },
    {
      "information_needed": "UK Sovereign segment performance, investment, and viability assessment: (1) Monthly revenue and customer metrics since launch (March 2024 - present): Revenue, customer count, average contract value, new customers acquired, churn, (2) Financial performance: Gross margin, operating expenses by category (personnel, infrastructure, sales/marketing), EBITDA/operating income (likely negative), (3) Cumulative investment: Total capital invested to date in UK Sovereign infrastructure, personnel hiring, go-to-market, total sunk cost, (4) Profitability projection: Detailed model showing: At what revenue level does segment break even (cover fixed costs)?, What timeline to reach breakeven under base/bull/bear scenarios?, Projected revenue ramp: 2025, 2026, 2027 forecasts, (5) Customer pipeline: Current sales pipeline size and stage (prospects, qualified leads, proposals), conversion rates, average sales cycle length, (6) Win/loss analysis: What % of deals is Rackspace winning vs losing? Who are primary competitors (AWS UK Sovereign, others)? Why are we losing deals?, (7) Market size: What is TAM (Total Addressable Market) for UK sovereign cloud? How much has Rackspace penetrated?, (8) BT partnership: What does BT provide (connectivity, infrastructure, co-marketing)? What economic terms (revenue share, service fees)? Is BT material to segment economics?, (9) Board commitment: What are management/board expectations for segment? What are success metrics and timeline milestones? What are exit triggers (if X not achieved by Y date, segment will be shut down or sold)?",
      "why_needed": "UK SOVEREIGN INVESTMENT DECISION: UK Sovereign is Rackspace's ONLY GROWTH INITIATIVE in otherwise declining portfolio. Segment was launched March 2024 (<1 year old) so performance trajectory determines whether this is: (1) STRATEGIC SUCCESS - Ramping revenue successfully toward $200-300M with path to 30-40% margins, providing growth narrative and demonstrating Rackspace can build new compliance-moat businesses. Should continue investing. (2) STRATEGIC FAILURE - Stalling at $10-20M revenue, losing deals to AWS UK Sovereign, taking 3-5 years to breakeven while Rackspace faces nearer-term financial pressures. Should cut losses, shut down or sell to UK-focused buyer. (3) TOO EARLY TO TELL - Insufficient data to determine success/failure, but must establish clear metrics and decision timeline. Cannot invest indefinitely without clear path to viability. Segment has STRATEGIC IMPORTANCE beyond financials: (1) UK Sovereign success demonstrates management can execute on new market entry and build compliance moats (restores confidence in strategy), (2) Failure damages management credibility and eliminates growth story (confirms terminal decline narrative), (3) Segment can be sold separately to UK buyer for potential premium if successful, or has zero value if failing. Need complete financial and operational data to assess: (1) Is segment on track or off track vs internal plan? (2) What additional investment required to reach viability? (3) What is board commitment level - will they continue funding or demand exit if performance poor? (4) What is realistic exit value if sold separately to UK buyer? Without this data, cannot evaluate whether UK Sovereign is strategic asset or strategic liability.",
      "request_to": "Management / CFO AND VP UK Sovereign Services AND Chief Revenue Officer",
      "format": "Monthly operating reports: Excel file with tabs: (1) Revenue and customer metrics by month (March 2024 - present): Monthly revenue, customer count, new customers, churned customers, average contract value, net revenue retention, (2) Financial P&L by month: Revenue, cost of revenue (by category: infrastructure, personnel, other), gross profit and %, operating expenses (by category: sales/marketing, R&D, G&A), EBITDA/operating income, (3) Cumulative cash investment: Running total of capital invested (CapEx for infrastructure + OpEx losses), (4) Sales pipeline: Current pipeline by stage (prospects, qualified, proposals, negotiation), expected close dates, deal sizes. Strategic plan: Provide board-approved UK Sovereign business plan showing: (1) Revenue forecast 2025-2027 (base/bull/bear cases), (2) Breakeven analysis showing fixed cost level and required revenue to cover, timeline to breakeven, (3) Success metrics and milestones (what KPIs must be achieved by when?), (4) Total investment required (how much more capital needed beyond sunk costs?), (5) Exit triggers (what conditions would cause board to approve shutdown/sale?). Competitive analysis: (1) UK sovereign cloud market size estimate (TAM), (2) Competitive landscape: AWS UK Sovereign status and timeline, other UK providers, (3) Win/loss analysis: Deals won vs lost, primary competitors, reasons for losses. BT partnership: (1) Partnership agreement summary (what BT provides, what Rackspace pays/shares), (2) Is BT material to economics? (does BT take significant revenue share or just provide services at market rates?)"
    }
  ]
}
