{
  "sub_stage": "2.5",
  "disconfirming_evidence_not_found": [
    "Evidence of BALANCED value split where Rackspace captures 40-60% of customer spend commensurate with contributions (SOUGHT but NOT FOUND): Analysis shows hyperscalers capture 89.6%, VMware captures significant licensing fees, Rackspace captures thin residual margins.",
    "Evidence of LONG-TERM CONTRACTS with platform partners guaranteeing pricing, credits, or program terms (multi-year agreements protecting Rackspace economics) (SOUGHT but NOT FOUND): Stage 2.2 notes partner terms are 'non-disclosed' with no guarantees identified.",
    "Evidence of Rackspace PRICING POWER enabling margin expansion despite partner cost increases (SOUGHT but NOT FOUND): Email 706% price increase triggered immediate churn, VMware price shock forcing margin compression or customer loss, no pricing power demonstrated.",
    "Evidence of PROPRIETARY DIFFERENTIATION creating customer lock-in independent of partner platforms (Rackspace-owned technology that customers can't replicate elsewhere) (SOUGHT but NOT FOUND): Stage 2.4 shows Public Cloud has LOW lock-in (hyperscaler portability), Private Cloud lock-in is VMware-based not Rackspace-based.",
    "Evidence of STRATEGIC PARTNERSHIPS where partners depend on Rackspace creating mutual dependency (SOUGHT but NOT FOUND): Partners are <0.5% dependent on Rackspace revenue, Rackspace 61-100% dependent on partners.",
    "Evidence of PARTNER VOLUME COMMITMENTS where partners guarantee Rackspace specific deal flow, referrals, or revenue levels (SOUGHT but NOT FOUND): No evidence of partners committing to drive business to Rackspace.",
    "Evidence of Rackspace SUCCESSFULLY PASSING THROUGH partner cost increases to customers without churn or margin compression (SOUGHT but NOT FOUND): Email price increase caused churn, VMware cost shock forcing margin absorption or customer loss.",
    "Evidence of MARGIN EXPANSION in partner-dependent segments despite cost pressures (SOUGHT but NOT FOUND): Public Cloud 10.4% (thin), Private Cloud 38.6% under compression, Email likely loss-making.",
    "Evidence of Rackspace RENEGOTIATING favorable terms with partners after adverse changes (securing concessions, discounts, or protections) (SOUGHT but NOT FOUND): No evidence Broadcom offered VMware relief, no evidence hyperscalers protected Rackspace from program changes.",
    "Evidence of CUSTOMER WILLINGNESS to accept price increases independent of partner costs (pricing power from Rackspace differentiation) (SOUGHT but NOT FOUND): Email churn on price increase proves customers price-sensitive and have alternatives.",
    "Evidence of Rackspace ABILITY TO SWITCH platform partners if terms become unfavorable (alternative platforms ready, migration capability in place) (SOUGHT but NOT FOUND): Stage 2.2 shows cannot migrate off VMware (20-30% failure rate), cannot exit hyperscalers (Public Cloud business disappears).",
    "Evidence of CONTRACTUAL PROTECTIONS preventing partner termination or adverse changes (termination-for-cause-only, cure periods, compensation for program changes) (SOUGHT but NOT FOUND): No evidence of contractual protections in partner agreements.",
    "Evidence of MUTUAL DEPENDENCY where partners need Rackspace's customer base, distribution, or capabilities (SOUGHT but NOT FOUND): Hyperscalers have thousands of partners, VMware has tens of thousands of customers - losing Rackspace is immaterial to partners.",
    "Evidence of Rackspace generating MAJORITY OF REVENUE from partner-independent segments creating strategic flexibility (SOUGHT but NOT FOUND): Only Government/UK Sovereign potentially independent, represent <20% of revenue currently.",
    "Evidence of PUBLIC CLOUD achieving margins comparable to compliance segments (25-35%) without regulatory moat (SOUGHT but NOT FOUND): Public Cloud 10.4% margin demonstrates commoditization, compliance segments 2-3X higher margins.",
    "Evidence of LOW BARRIERS in compliance markets enabling easy competitive entry (SOUGHT but NOT FOUND): FedRAMP requires $10-20M+ and 12-18 months, limits competition to ~100 providers vs thousands in commodity cloud.",
    "Evidence of LARGE NUMBERS of compliance segment competitors (>1000 FedRAMP providers) indicating low barriers (SOUGHT but NOT FOUND): ~100 FedRAMP providers creates oligopoly not perfect competition.",
    "Evidence of M&A FLEXIBILITY in compliance segments (easy authorization transfer, no foreign buyer restrictions, rapid integration) (SOUGHT but NOT FOUND): Foreign acquirer invalidates FedRAMP, domestic acquirer faces 12-18 month re-authorization, UK Sovereign permanently separated.",
    "Evidence of DECLINING MARGINS in compliance segments indicating commoditization pressures (SOUGHT but NOT FOUND): Government/Private Cloud compliance have HIGHEST margins, suggesting compliance premium sustainable.",
    "Evidence of PARTNER INCENTIVES to support Rackspace success (revenue share agreements, joint success metrics, co-investment) (SOUGHT but NOT FOUND): Partners extract value from Rackspace (licensing fees, infrastructure costs) with no reciprocal investment in Rackspace success.",
    "Evidence of RACKSPACE CONTROLLING any aspect of partner relationship (pricing influence, product roadmap input, exclusive territories or customers) (SOUGHT but NOT FOUND): Partners have unilateral control over pricing, programs, terms.",
    "Evidence of ALTERNATIVES TO MAJOR PARTNERS that could replace them if relationships deteriorate (alternative hyperscalers, VMware substitutes ready to deploy) (SOUGHT but NOT FOUND): Cannot switch hyperscalers (customers bought specific AWS/Azure/Google), cannot switch off VMware without multi-year high-risk migration.",
    "Evidence of RACKSPACE OWNING critical infrastructure, IP, or capabilities that partners need (creating reverse dependency) (SOUGHT but NOT FOUND): Rackspace resells partner infrastructure (Public Cloud) or runs partner software on commodity hardware (Private Cloud VMware) - owns no critical assets partners need.",
    "Evidence of PARTNER PROGRAMS becoming MORE FAVORABLE to Rackspace over time (credit increases, new benefits, expanded support) (SOUGHT but NOT FOUND): Opposite - VMware raised prices 200-300%, no evidence of hyperscaler credit increases.",
    "Evidence of CUSTOMER PREFERENCE for Rackspace over hyperscaler-direct beyond inertia or switching costs (customers actively choosing Rackspace value proposition) (SOUGHT but NOT FOUND): Stage 2.4 shows retention is 'structural not earned' - customers stay due to switching costs not service quality preference.",
    "Evidence of RACKSPACE BRAND commanding premium pricing independent of partner platforms (customers willing to pay more for Rackspace-managed AWS vs AWS-direct beyond support services) (SOUGHT but NOT FOUND): 10.4% Public Cloud margin suggests minimal brand premium, primarily partner credit and small management fee.",
    "Evidence of PARTNER WILLINGNESS to modify terms to retain Rackspace (partners offering concessions if Rackspace threatens to reduce volumes or switch) (SOUGHT but NOT FOUND): Broadcom raised VMware 200-300% with no negotiation, hyperscalers offer take-it-or-leave-it partner programs.",
    "Evidence of RACKSPACE SUCCESSFULLY RENEGOTIATING unfavorable partner terms through leverage or threats (SOUGHT but NOT FOUND): No evidence of successful renegotiations in any partner relationship.",
    "Evidence of CONTRACTUAL REVENUE SHARES where Rackspace receives % of partner revenue creating aligned incentives (SOUGHT but NOT FOUND): Rackspace pays partners (licensing, infrastructure) and receives fixed credits/rebates, no revenue share arrangements identified.",
    "Evidence of EXCLUSIVE PARTNER ARRANGEMENTS where Rackspace is preferred/sole partner in specific markets or segments (SOUGHT but NOT FOUND): Rackspace is one of thousands of hyperscaler partners, one of many VMware MSP customers - no exclusivity.",
    "Evidence of PARTNER INVESTMENTS in Rackspace capabilities (partners funding Rackspace technology development, sales support, customer success) (SOUGHT but NOT FOUND): Partners extract fees from Rackspace with no reciprocal investment.",
    "Evidence of JOINT PLANNING or COLLABORATION where Rackspace influences partner strategy (SOUGHT but NOT FOUND): Partners make unilateral decisions (VMware Broadcom pricing, hyperscaler managed services competition) without Rackspace input.",
    "Evidence of PARTNER COMMITMENTS to not compete with Rackspace (agreements preventing hyperscalers from offering direct managed services in Rackspace's segments) (SOUGHT but NOT FOUND): Hyperscalers actively compete with AWS Managed Services, Azure Managed Services.",
    "Evidence of EMAIL CHANNEL PARTNERS supporting price increase and maintaining customer relationships (SOUGHT but NOT FOUND): Partners revolted, describing increase as 'devastating', customers churning immediately."
  ]
}
