{
  "sub_stage": "7.1",
  "document_metadata": {
    "title": "Contested Data Domains - Rackspace Technology, Inc.",
    "analysis_date": "2026-02-15"
  },
  "contested_domains": [
    {
      "data_domain": "Deal profitability by customer—whether booked revenue profitable when delivered",
      "nature_of_contestation": "Sales claims deals profitable at booking (based on pricing, revenue projections). Delivery discovers actual delivery cost exceeds pricing post-signature. Finance reports margin erosion quarterly but cannot prevent unprofitable bookings proactively. CEO forced to arbitrate via walk away policy Q4 2024—rejects deals/renewals retroactively. Contestation: Sales optimistic profitability assumptions vs delivery actual cost reality vs finance conservative margin reporting. No systematic profitability validation pre-signature reconciles views—conflict emerges only after margin deterioration severe (Private Cloud -13%, Public Cloud -3%).",
      "why_it_persists": "Authority-accountability mismatch (Stage 4.1): Sales has booking authority without profitability accountability, delivery has margin accountability without deal veto authority, finance reports historically without prospective control. No deal review board to force reconciliation pre-signature. Sales refresh Q3 2024 changed personnel not data reconciliation process—suggests organizational avoidance of systematic profitability truth. Walk away policy Q4 2024 CEO intervention reactive—addresses symptoms (reject bad deals individually) not cause (no proactive profitability validation system). Contestation persists because resolving requires authority reallocation: Sales loses autonomy if profitability veto created, delivery gains authority over revenue if veto granted. Political cost of resolution higher than operational cost of persistent contestation.",
      "decision_risk": "Revenue forecasting unreliable—if profitability unknowable pre-signature, revenue quality uncertain. Margin guidance at risk—unpredictable margin erosion from unvalidated deals. Walk away policy application inconsistent—depends on CEO bandwidth and judgment (Stage 4.2: CEO bottleneck) not systematic criteria. Investor confidence at risk if profitability contestation revealed—demonstrates execution control absence. M&A valuation risk—if acquirer demands profitability data by customer/deal and reconciliation infeasible, due diligence failure or valuation discount.",
      "evidence_sources": ["Q4 2024 walk away policy", "Q3 2024 sales refresh", "Margins: -13%/-3%", "Stage 4.1 authority gaps", "Stage 4.4 accountability voids"]
    },
    {
      "data_domain": "Customer satisfaction vs support performance—whether 'Fanatical Support' brand promise real",
      "nature_of_contestation": "Support claims SLA compliance proves performance (15min/1hr/4hr response times met). Customers claim satisfaction declining (Trustpilot 'consistently worse' 2024, BBB unresolved complaints). Finance/marketing claims 'Fanatical Support' competitive differentiation. Contestation: Internal activity truth (SLA met) vs external outcome truth (satisfaction down). Support argues metric compliance demonstrates capability. Customers experience unresolved issues despite SLA compliance. Brand promise vs operational reality diverging.",
      "why_it_persists": "Measurement misalignment (Stage 4.4): Support incentivized on SLA response not resolution quality, rational to optimize measurable (activity) over unmeasurable (satisfaction). Customer satisfaction measurement absent or suppressed internally—external complaint platforms (BBB, Trustpilot) surface truth support metrics don't capture. Support lacks authority to change measurement (no VP Support Stage 4.1). Finance/marketing invested in 'Fanatical Support' brand narrative—acknowledging satisfaction decline contradicts investor/competitive positioning. Contestation persists because internal measurement optimized for controllability (SLA objective, measurable) not validity (satisfaction subjective, lagging). Admitting contestation requires brand promise revision or support measurement overhaul—both costly.",
      "decision_risk": "Brand erosion from satisfaction-promise gap—'Fanatical Support' becomes liability if gap widens or surfaces publicly. Customer retention at risk—declining satisfaction predicts churn. Support capacity planning misguided—if optimizing SLA not satisfaction, resource allocation misaligned with customer needs. Competitive differentiation lost—'Fanatical Support' claim unsustainable if satisfaction data contradicts. Investor communications risk—if satisfaction data demanded and reveals brand-reality gap, credibility damaged.",
      "evidence_sources": ["Stage 4.2 SLA met", "Trustpilot 'consistently worse' 2024", "BBB complaints unresolved", "Stage 4.4 support incentives", "'Fanatical Support' brand claims"]
    },
    {
      "data_domain": "Incident frequency and security posture—whether operational stability improving or recurring failures masked",
      "nature_of_contestation": "Operations claims incident response capability (MTTD/MTTR metrics, crisis management demonstrations). Incident recurrence indicates prevention gaps (ransomware multi-month, zero-day Sept 2024). Customers/regulators experience impact frequency, judge stability independently. Contestation: Response capability truth (operations) vs prevention effectiveness truth (external). Operations argues 'we responded' proves competence. Customers/regulators observe 'incidents recurring' indicates inadequacy. Monitoring degradation (Sept 2024 dashboards offline) undermines operations truth claims during crisis.",
      "why_it_persists": "Incentive misalignment (Stage 4.4): Operations rewarded on response speed not incident frequency reduction, rational to optimize reactive not proactive. No CRO to own prevention truth (Stage 4.1)—operations accountable for response, no one accountable for prevention. Proactive prevention investment perpetually deferred (capital constrained $1.3B debt, incidents consume budget reactively). Incident frequency truth measurement absent—no systematic tracking of recurrence patterns, root cause analysis, prevention effectiveness. Contestation persists because operations controls internal truth (response metrics), external parties control impact truth (incident experience), no reconciliation mechanism. Acknowledging frequency truth requires admitting prevention failure and funding prevention (capital unavailable or allocated elsewhere).",
      "decision_risk": "Regulatory authorization at risk—FedRAMP, HIPAA require proactive controls, reactive-only posture creates jeopardy. Customer trust erosion from recurring incidents—stability perception declining. Operational cost inefficiency—reactive spending exceeds prevention cost (Stage 4.2) but prevention investment unavailable. Insurance implications—incident frequency may affect cyber insurance premiums, coverage. M&A risk—acquirer due diligence on incident history may reveal frequency pattern operations metrics don't disclose, valuation impact or deal failure.",
      "evidence_sources": ["Ransomware multi-month", "Zero-day Sept 2024", "Monitoring offline Sept 2024", "Stage 4.4 ops incentives", "Stage 4.1 no CRO"]
    },
    {
      "data_domain": "Sales pipeline quality—whether CRM opportunities actually closeable and profitable",
      "nature_of_contestation": "Sales claims CRM pipeline 'qualified' and forecast-able based on stage progression, close probability. Delivery discovers post-signature many deals unbuildable or unprofitable. Finance applies conservative discount to CRM forecast for investor guidance. CEO walk away policy Q4 2024 overrides CRM opportunity values with profitability filter. Contestation: Sales optimistic CRM truth vs delivery post-signature quality reality vs finance conservative external forecast vs CEO profitability discipline. Pipeline enters CRM optimistically, quality discovered reactively downstream.",
      "why_it_persists": "Incentive to inflate pipeline (Stage 4.4): Sales compensated on bookings encourages optimistic opportunity entry and qualification. No proactive quality validation—deal review board absent (Stage 4.1), delivery lacks veto over CRM opportunities, profitability assessment post-signature only. Sales refresh Q3 2024 suggests pipeline quality disputed but process unchanged—personnel change treats symptom not cause. Finance learns to discount CRM data for external commitments but doesn't force upstream quality improvement. Contestation persists because sales controls CRM entry truth, downstream functions lack authority to challenge proactively, quality discovered reactively creates margin erosion but sales incentive unchanged.",
      "decision_risk": "Forecast accuracy unreliable—if pipeline quality contested, revenue projections uncertain. Resource allocation misguided—if optimistic pipeline drives hiring/capacity planning, over-investment in unwinnable opportunities. Sales performance management distorted—if CRM metrics (pipeline value, stage progression) don't predict actual bookings quality, quotas and compensation misaligned. CEO walk away policy bandwidth insufficient (Stage 4.2)—cannot review all opportunities personally, sampling creates inconsistency. M&A due diligence risk—if acquirer audits CRM pipeline quality and discovers inflation, revenue projections challenged, valuation impacted.",
      "evidence_sources": ["Q4 2024 walk away policy", "Q3 2024 sales refresh", "Stage 4.1 no deal review board", "Stage 4.4 sales incentives", "Margins: -13%/-3% suggest quality issues"]
    }
  ],
  "synthesis_notes": "Contestation pattern: Internal operational metrics optimistic (sales CRM pipeline, support SLA compliance, operations incident response), external reality pessimistic (delivery profitability, customer satisfaction, incident recurrence). Contestation emerges when internal activity truth contradicts external outcome truth. Persistence mechanism: Authority-accountability misalignment prevents reconciliation (Stage 4.1 coordination gaps), incentive optimization favors internal measurable over external outcome (Stage 4.4 activity-outcome divergence), capital constraints limit systematic resolution (Stage 5 liquidity), political cost of truth reconciliation exceeds operational cost of continued contestation. Decision risk concentration: Contested domains are material—deal profitability affects revenue quality, satisfaction affects retention, incidents affect regulatory authorization, pipeline quality affects forecast reliability. Acquirer diligence likely to surface contestations—valuation risk if reconciliation forced or infeasible."
}
