{
  "unknowns_requests": [
    {
      "unknown": "Customer contract change-of-control provisions - ACTUAL CONTRACT TEXT",
      "materiality": "CRITICAL",
      "why_it_matters": "Determines whether change-of-control triggers customer termination rights, consent requirements, or renegotiation rights. Current analysis relies on industry-standard MSP contract assumptions. Actual Rackspace contracts may be more (or less) restrictive. If contracts do NOT contain change-of-control provisions, customer churn risk is lower than estimated. If contracts contain IMMEDIATE termination rights (vs notice period), churn risk is higher.",
      "data_room_request": "Complete customer contract templates and top 20 customer agreements by revenue. Specifically request: (1) Change-of-control definitions and trigger events, (2) Termination rights upon change of control, (3) Assignment and consent provisions, (4) Notice periods required, (5) Renegotiation or pricing adjustment rights, (6) Data ownership and portability provisions upon termination.",
      "management_interview_question": "What percentage of customer contracts contain change-of-control provisions? What are the most restrictive provisions you've encountered? Have you ever lost customers due to ownership change announcements or negotiations?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If all customer contracts contain immediate termination rights with no notice period, and customers exercise broadly upon acquisition announcement, could lose 30-50% of customer base within 60 days of deal announcement. Revenue loss of $450-750M would destroy deal economics and potentially trigger debt covenant breach.",
      "upside_if_favorable": "If customer contracts do NOT contain change-of-control provisions or only require notice without termination rights, customer churn risk drops from 10-30% to 5-10%. Significantly improves deal economics and reduces transaction risk."
    },
    {
      "unknown": "Customer revenue concentration by cloud provider (AWS vs Microsoft vs Google)",
      "materiality": "CRITICAL",
      "why_it_matters": "Determines materiality of AWS/Microsoft/Google partnership termination risk. Current analysis INFERS 30-40% AWS concentration from 2,000 customers and 1,000 staff, but actual figure could be higher or lower. If AWS is 50%+ of revenue, partnership termination is EXISTENTIAL RISK destroying majority of business. If AWS is <20% of revenue, partnership termination is MANAGEABLE RISK with containable impact.",
      "data_room_request": "Revenue breakdown by cloud provider partnership for last 12 months and last 3 years trending. Request: (1) AWS revenue and customer count, (2) Microsoft Azure revenue and customer count, (3) Google Cloud revenue and customer count, (4) Other/multi-cloud revenue, (5) Trend analysis showing concentration increasing or diversifying.",
      "management_interview_question": "What percentage of revenue comes from AWS customers vs Microsoft vs Google? Is concentration increasing or diversifying? If you lost AWS partnership tomorrow, what would happen to the business?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If AWS represents 50%+ of revenue ($750M+), termination upon competitive acquisition eliminates majority of business. Remaining operations may be sub-scale and unviable. Transaction becomes nearly impossible except for non-cloud financial sponsors.",
      "upside_if_favorable": "If revenue is well-diversified (AWS 25%, Microsoft 25%, Google 20%, other 30%), partnership termination risk is more manageable. Acquirer could potentially accept one partnership termination while preserving others. Expands buyer universe."
    },
    {
      "unknown": "AWS Strategic Collaboration Agreement - FULL CONTRACT TEXT",
      "materiality": "CRITICAL",
      "why_it_matters": "October 2024 SCA designated AWS as 'preferred cloud provider' but full terms are unknown. Contract may contain: (1) Explicit change-of-control provisions giving AWS termination rights, (2) Exclusivity or preferred partner commitments limiting other partnerships, (3) Minimum purchase or consumption commitments creating financial obligations, (4) Co-investment requirements, (5) Non-compete provisions, (6) Term and termination provisions. These terms determine whether AWS has veto power over Rackspace transactions and what buyer profiles are acceptable to AWS.",
      "data_room_request": "AWS Strategic Collaboration Agreement dated October 2024 in its entirety. Specifically review: (1) Change-of-control and assignment provisions, (2) Exclusivity and competitive restrictions, (3) Minimum commitments and performance requirements, (4) Termination rights and cure periods, (5) Acquirer approval or notification requirements, (6) Pricing and rebate structures tied to partnership status.",
      "management_interview_question": "What happens to AWS partnership if Rackspace is acquired? Does AWS have approval rights over acquirers? What are the minimum commitments in the SCA and what happens if you breach? Has AWS indicated which types of acquirers (strategics, financial sponsors, competitors) would be acceptable?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If SCA contains absolute change-of-control termination right with no cure period, and explicitly prohibits acquisition by Microsoft/Google/Oracle, AWS has ABSOLUTE VETO over most strategic transactions. Financial sponsors become only viable buyers, but must maintain AWS partnership which may require guaranteed minimum commitments.",
      "upside_if_favorable": "If SCA permits change of control with notice (but not consent), and does not restrict acquirer types, AWS partnership survives most transactions. Veto power is reduced from absolute to negotiable. Expands buyer universe to include strategics."
    },
    {
      "unknown": "Microsoft Azure and Google Cloud Platform partnership agreements - FULL CONTRACT TEXT",
      "materiality": "HIGH",
      "why_it_matters": "Similar to AWS analysis - need to understand change-of-control provisions, exclusivity, minimum commitments, and termination rights. If Microsoft/Google agreements contain different (more or less restrictive) provisions than AWS, affects transaction structuring. Multicloud positioning requires maintaining all three partnerships - need to understand if all three can survive acquisition or if acquirer must be acceptable to all three simultaneously.",
      "data_room_request": "Microsoft Azure partnership agreement and Google Cloud Platform partnership agreement in their entirety. Same review focus as AWS SCA request above.",
      "management_interview_question": "Do Microsoft and Google partnerships contain similar change-of-control provisions as AWS? Can you maintain multicloud positioning if one partnership terminates? What is minimum viable partnership configuration to serve customer base?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If all three cloud providers have absolute veto rights, acquirer must be acceptable to AWS AND Microsoft AND Google simultaneously. This may be impossible - cloud providers have conflicting interests and may block transactions that benefit competitors. Limits buyers to financial sponsors only.",
      "upside_if_favorable": "If Microsoft/Google partnerships are more flexible than AWS (e.g., terminable with notice but not requiring consent), Rackspace could potentially survive with AWS + one other partnership if third terminates. Provides fallback options and reduces compounding veto risk."
    },
    {
      "unknown": "Government customer revenue breakdown and FedRAMP scope",
      "materiality": "HIGH",
      "why_it_matters": "Government customers have termination for convenience rights under FAR provisions and FedRAMP authorization is entity-specific requiring re-authorization upon entity change. Need to quantify government revenue at risk. If government is 5% of revenue ($75M), re-authorization friction is manageable. If government is 25% of revenue ($375M), re-authorization becomes CRITICAL PATH requiring 12-18 months and creating massive churn risk during gap.",
      "data_room_request": "Government customer list with revenue by customer for last 12 months. FedRAMP authorization scope including: (1) Which legal entities hold FedRAMP authorization, (2) Which services are covered, (3) Re-authorization requirements if entity changes, (4) Historical re-authorization timelines, (5) Customer contracts specifically requiring FedRAMP (vs customers who happen to be government but don't require FedRAMP).",
      "management_interview_question": "What percentage of revenue comes from customers requiring FedRAMP? If acquisition requires re-authorization, how long would it take and could you retain customers during the gap? Have you ever done FedRAMP re-authorization and what was the timeline?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If government customers are 20-30% of revenue ($300-450M) and ALL require FedRAMP, re-authorization creates 12-18 month service delivery gap forcing 100% government customer churn. This is permanent revenue loss that destroys deal economics. Transaction may be infeasible unless structured to preserve FedRAMP entity unchanged.",
      "upside_if_favorable": "If government customers are <10% of revenue ($150M) and only subset require FedRAMP, churn risk is containable. Acquirer can accept government customer loss or maintain separate entity to preserve FedRAMP while integrating rest of business."
    },
    {
      "unknown": "Data center real estate lease terms - FULL LEASE AGREEMENTS",
      "materiality": "MEDIUM-HIGH",
      "why_it_matters": "40 data centers globally with leases likely containing assignment restrictions and financial covenants. Need to understand: (1) Which entity is lessee on each lease, (2) Assignment and change-of-control provisions, (3) Landlord consent requirements and timelines, (4) Financial covenants that could be triggered by acquisition, (5) Remaining lease terms and renewal options, (6) Exit costs if leases must be terminated. Data center infrastructure is FIXED and location-specific - cannot move servers without massive customer disruption.",
      "data_room_request": "All data center lease agreements for 40 facilities. Specifically review: (1) Lessee entity name, (2) Assignment and subletting provisions, (3) Change-of-control provisions, (4) Landlord consent requirements, (5) Financial covenants (net worth, liquidity requirements), (6) Remaining term and renewal options, (7) Termination rights and costs, (8) Use restrictions.",
      "management_interview_question": "How many data center leases contain assignment restrictions or change-of-control provisions? What is process and timeline for obtaining landlord consents? Have you ever had landlord refuse consent or demand concessions? Can you relocate data center infrastructure if leases cannot be assigned?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If all 40 leases require landlord consent and multiple landlords refuse or delay, acquirer cannot consolidate real estate or integrate entities. Must operate 40+ separate entities as lessees indefinitely. If leases contain financial covenants requiring investment-grade credit and acquisition impairs credit, landlords could terminate leases forcing relocation of infrastructure (12+ month process, $X million cost, customer disruption causing churn).",
      "upside_if_favorable": "If leases permit assignment with notice (but not consent) or explicitly permit affiliate transfers, lease friction is minimal. Acquirer can consolidate entities and integrate operations. If leases have long remaining terms (5+ years) with renewals, provides stable operating platform post-acquisition."
    },
    {
      "unknown": "Software vendor licensing agreements - COMPLETE LICENSE INVENTORY",
      "materiality": "MEDIUM",
      "why_it_matters": "Enterprise software licenses (VMware, Red Hat, monitoring tools, security tools) enable service delivery. Need to understand: (1) Which software is critical to operations, (2) License terms including entity restrictions and change-of-control provisions, (3) Pricing tied to volume or partnership status, (4) Termination rights upon control change, (5) Audit rights, (6) OEM or resale rights. If vendors terminate licenses upon acquisition, service delivery is interrupted. If vendors demand price increases, cost structure deteriorates.",
      "data_room_request": "Complete software license inventory for all enterprise licenses including: (1) Vendor name and product, (2) Licensed entity, (3) License type (perpetual, subscription, OEM, resale), (4) Pricing and payment terms, (5) Change-of-control and assignment provisions, (6) Volume discounts or partnership pricing, (7) Termination rights, (8) Remaining term and renewal, (9) Critical to operations assessment.",
      "management_interview_question": "What software licenses are critical to service delivery? Which licenses contain change-of-control provisions? Have you ever lost licenses due to vendor termination or M&A? What would happen if VMware or other critical vendor terminated license tomorrow?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If critical software vendors (VMware, monitoring platforms, security tools) have change-of-control termination rights and exercise upon acquisition, service delivery halts until replacement licenses obtained. Could take 30-90 days creating SLA breaches and customer churn. If vendors demand pricing increases (loss of volume discounts), cost structure deteriorates by 10-30% for software spend ($X million annually).",
      "upside_if_favorable": "If software licenses are freely transferable or vendors routinely consent to assignments, licensing friction is minimal. If acquirer already has compatible licenses, can potentially consolidate and reduce costs. Could create synergy opportunity rather than risk."
    },
    {
      "unknown": "Compliance certification transfer and re-authorization timelines - DETAILED PROCESS DOCUMENTATION",
      "materiality": "HIGH",
      "why_it_matters": "SOC 2, HIPAA/HITRUST, ISO 27001, PCI DSS, and FedRAMP certifications are entity-specific. Need to understand: (1) Re-authorization process if entity changes, (2) Actual timelines based on company experience, (3) Whether acquirer's existing certifications can 'cover' Rackspace operations or if Rackspace must maintain separate certifications, (4) Cost of re-certification, (5) Whether customers can remain on platform during re-certification or must migrate. If re-certification takes 12-18 months and customers cannot wait, causes immediate churn.",
      "data_room_request": "Compliance certification documentation including: (1) Complete certification inventory (SOC 2, HIPAA/HITRUST, ISO, PCI, FedRAMP, etc.), (2) Entity holding each certification, (3) Scope of certification (which services, data centers, processes covered), (4) Re-authorization requirements if entity changes, (5) Historical re-certification timelines and costs, (6) Auditor relationships and process, (7) Customer contracts requiring specific certifications, (8) Revenue tied to each certification.",
      "management_interview_question": "What happens to compliance certifications if acquisition changes entity structure? How long does re-certification take and can customers stay on platform during the process? What percentage of customers require each certification?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If re-certification for SOC 2, HIPAA/HITRUST, and FedRAMP takes 12-18 months and customers cannot remain on platform during gap, creates immediate forced churn of all regulated customers (healthcare, financial services, government) representing potentially 40-60% of revenue base ($600-900M). This is existential risk that may make transaction infeasible unless entity structure preserved.",
      "upside_if_favorable": "If acquirer already has compatible certifications that can extend to Rackspace operations, or if re-certification can be completed in 3-6 months while maintaining customer service, certification friction is manageable. May only affect small subset of customers in highest-security segments."
    },
    {
      "unknown": "Historical customer churn upon ownership change - RACKSPACE AND PEER MSP DATA",
      "materiality": "HIGH",
      "why_it_matters": "Current analysis ESTIMATES 10-30% customer churn upon acquisition based on industry assumptions and change-of-control provisions. Need actual data: (1) When Apollo acquired Rackspace in 2016, what was customer churn in following 12 months? (2) When competitors (Accenture, IBM, Cognizant) acquired MSPs, what was observed churn? (3) What drives churn - price increases, service quality concerns, competitive conflicts, or reflexive 'we don't like change' responses? Understanding actual churn rates validates or refutes 10-30% estimate.",
      "data_room_request": "Customer retention analysis for: (1) 12 months pre/post Apollo LBO in 2016, (2) 12 months pre/post any Rackspace acquisitions of other companies (Datapipe, Onica, TriCore), (3) Cohort analysis showing customer retention by segment, size, industry, (4) Churn reasons (price, service quality, competitive, strategic), (5) Win-back success rates.",
      "management_interview_question": "What was customer churn when Apollo acquired Rackspace in 2016? What churn did you experience when acquiring Datapipe, Onica, TriCore? What percentage of customers who express concerns about ownership change actually terminate? What retention strategies have been successful?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If Apollo 2016 LBO caused 30-40% churn, or if Rackspace's own acquisitions caused 25%+ customer losses, suggests change-of-control churn is HIGHER THAN ESTIMATED. Could be 30-50% rather than 10-30%. At 40-50% churn ($600-750M revenue loss), deal economics collapse and transaction becomes infeasible for most buyers.",
      "upside_if_favorable": "If Apollo 2016 LBO caused only 5-10% churn, suggests enterprise customers are less sensitive to ownership change than feared. May indicate that professional execution and communication can mitigate churn risk. Reduces expected churn to 5-15% ($75-225M revenue loss) which is more manageable."
    },
    {
      "unknown": "Lender consent process and historical precedents - CREDIT AGREEMENT AMENDMENT EXPERIENCE",
      "materiality": "CRITICAL",
      "why_it_matters": "First Lien Lenders have absolute veto over change-of-control via mandatory repurchase provision. Need to understand: (1) Lender consent process - who must approve (administrative agent, majority lenders, all lenders)? (2) Timeline for lender consent (30 days, 60 days, 90+ days)? (3) Cost of consent - do lenders extract fees, pricing adjustments, or other concessions? (4) Historical precedents - has Rackspace ever obtained lender consent for any major transaction and what did it require? (5) Lender composition - are lenders long-term credit funds or distressed debt traders who may have different motivations?",
      "data_room_request": "Credit agreement amendment history since March 2024 refinancing. Request: (1) Any amendments or waivers sought and granted/denied, (2) Consent process and timeline, (3) Fees or concessions required, (4) Lender composition and voting thresholds, (5) Administrative agent contact and relationship. Also request First Lien Credit Agreement in its entirety if not already provided in prior stages.",
      "management_interview_question": "Have you ever sought lender consent for a material transaction? What was the process and timeline? What concessions did lenders require? Who are the major lenders and what are their motivations? Do you have a relationship with lenders that would facilitate consent, or are they passive holders?",
      "uncertainty_classification": "FACT_UNCERTAINTY",
      "downside_if_adverse": "If lender consent requires 100% lender approval (not majority) and any single lender can block, veto power is absolute and potentially impossible to overcome. If lenders historically extract 1-2% fees on transaction value plus pricing adjustments (50-100bps spread increase), consent cost is $20-40M fees plus NPV of higher interest costs. If lenders are distressed debt traders with blocking positions, may refuse consent to force full debt repayment at par (eliminating below-par trading gains for acquirer). Timeline of 90+ days for consent adds deal risk.",
      "upside_if_favorable": "If lender consent requires only majority (not unanimity) and administrative agent facilitates process efficiently, consent is achievable in 30-45 days with reasonable fees (0.25-0.5% or $3-6M). If lenders are long-term credit funds seeking stable borrower, may welcome creditworthy acquirer without excessive concessions. Good lender relationship reduces friction."
    }
  ]
}
