{
  "control_reality": [
    {
      "actor": "Apollo Global Management, Inc.",
      "type": "SHAREHOLDER",
      "formal_rights": "53-57% equity ownership provides: (1) Majority voting control on matters requiring simple majority (director elections, bylaw amendments, certain mergers), (2) Two board seats held by Apollo affiliates (Aaron Sobel - Principal, Apollo; Vikram Mahidhar - Operating Partner, Apollo), (3) Controlled Chairman position until January 2025 (David Sambur, Apollo Partner), (4) Likely registration rights, information rights, and board nomination rights per typical investor rights agreement (not publicly disclosed but standard for PE-backed public companies).",
      "informal_or_effective_control": "Apollo exercises EFFECTIVE CONTROL beyond formal ownership percentage through: (1) Influence over board agenda and strategic direction via affiliated directors, (2) Access to non-public financial and operational information through board participation, (3) Ability to approve or reject CEO and CFO appointments, (4) Influence over executive compensation and incentive structures, (5) Reputation effects - management knows Apollo can remove them via majority vote, creating deference to Apollo preferences. Market cap of ~$120M on 53-57% stake means Apollo's investment is ~$64-68M - modest exposure may create misalignment with total enterprise value preservation.",
      "what_they_can_block": "Apollo can BLOCK via majority vote: (1) Any board election outcome not approved by Apollo, (2) Bylaws amendments, (3) Certain merger, consolidation, or asset sale transactions requiring shareholder approval (typically >50% of assets), (4) Amendments to certificate of incorporation, (5) Dissolution of company. Apollo can FORCE via majority vote: (1) Going-private transaction (subject to fairness opinion and appraisal rights), (2) Sale of company if buyer acceptable to Apollo, (3) Replacement of independent directors not aligned with Apollo strategy. Apollo can INFLUENCE but not unilaterally decide (requires board majority or supermajority): Major acquisitions, debt restructurings, significant capex programs.",
      "claim_type": "FACT",
      "evidence_sources": [
        "Apollo ownership 53-57%: Yahoo Finance (Nov 2024), ainvest.com (Jul 2025), multiple financial news sources",
        "Board composition: Rackspace IR press release January 17, 2025",
        "Apollo board member affiliations: Rackspace IR board member profiles (Aaron Sobel since Nov 2016, Vikram Mahidhar since Jan 2025)",
        "Delaware General Corporation Law (DGCL) majority voting thresholds for shareholder actions"
      ]
    },
    {
      "actor": "First Lien Credit Agreement Lenders (Citibank N.A. as Administrative Agent)",
      "type": "CREDITOR",
      "formal_rights": "$1.3B term loan (maturity May 15, 2028) with: (1) Negative covenants restricting borrower and guarantors from incurring additional debt, paying dividends, selling material assets, creating liens, or merging/consolidating without lender consent, (2) Change-of-control provisions requiring mandatory offer to repurchase debt or lender consent for ownership change, (3) Springing financial covenant (5.0x super-priority net senior secured leverage ratio) triggered if revolving facility utilization exceeds 35% of commitments, (4) Events of default include: payment default, covenant breach, cross-default to other material debt, bankruptcy, change of control without consent, (5) Security interest in substantially all assets of borrower and guarantors, (6) Make-whole premium on prepayments until September 12, 2025.",
      "informal_or_effective_control": "Lenders exercise VETO POWER over corporate actions requiring debt incurrence, asset dispositions, or structural changes. Even if Apollo as majority shareholder approves a transaction, lenders can block via covenant restrictions. Lenders' consent is REQUIRED (not discretionary) for: (1) Any acquisition requiring debt financing beyond permitted baskets, (2) Sale of material subsidiaries or business units (would reduce guarantor base), (3) Dividend payments to parent or shareholders (restricted payment covenant), (4) Incurrence of additional senior or pari passu debt. Lenders have ACCELERATION RIGHTS upon event of default, allowing them to declare entire $1.3B immediately due and exercise remedies against collateral (substantially all assets). This creates CREDITOR CONTROL over going-concern viability.",
      "what_they_can_block": "Lenders can BLOCK: (1) Any change of control at Rackspace Technology, Inc. level (triggers mandatory offer or requires consent), (2) Material asset sales or divestitures that would reduce collateral value, (3) Dividend payments or other restricted payments to shareholders, (4) Incurrence of additional debt beyond permitted baskets, (5) Mergers, consolidations, or corporate restructurings affecting borrower or guarantor entities, (6) Creation of liens on assets (other than permitted liens), (7) Investments or acquisitions requiring new debt. Lenders can FORCE: (1) Full debt repayment upon change of control if mandatory offer not accepted, (2) Acceleration and foreclosure on collateral upon event of default, (3) Replacement of management if default persists (via lender-controlled board post-foreclosure).",
      "claim_type": "FACT",
      "evidence_sources": [
        "First Lien Credit Agreement dated March 12, 2024 (referenced in Form 8-K filed March 7, 2024)",
        "Rackspace IR press release March 12, 2024 describing credit agreement terms",
        "Globenewswire and Yahoo Finance coverage of March 2024 refinancing transaction",
        "Credit agreement terms: interest rate, covenants, maturity disclosed in press materials"
      ]
    },
    {
      "actor": "Public Shareholders (Non-Apollo)",
      "type": "SHAREHOLDER",
      "formal_rights": "43-47% equity ownership provides: (1) Minority voting rights on shareholder matters (insufficient to block simple majority votes), (2) Appraisal rights if company goes private (right to judicial valuation and cash payment for shares), (3) Derivative suit standing to challenge board breaches of fiduciary duty, (4) Class action standing for securities fraud claims, (5) Right to receive equal per-share consideration in merger or tender offer (with limited exceptions), (6) Information rights via SEC public disclosures.",
      "informal_or_effective_control": "Public shareholders have MINIMAL EFFECTIVE CONTROL. Cannot block any action requiring simple majority (Apollo controls). Cannot nominate directors (Apollo controls board elections). Cannot force strategic changes or asset sales. Effective control limited to: (1) Creating litigation risk via derivative or class actions (but subject to business judgment rule and board independence), (2) Generating negative publicity or proxy fight pressure (limited effectiveness given Apollo's majority), (3) Withholding votes on non-binding proposals (say-on-pay, auditor ratification) to signal discontent. Market price of $0.48 (market cap ~$120M) suggests public shareholders are either: (a) pricing in fundamental weakness, or (b) pricing in Apollo extraction/control discount. Public shareholders are ECONOMICALLY EXPOSED (~$52-56M aggregate value at current price) but OPERATIONALLY POWERLESS.",
      "what_they_can_block": "Public shareholders can BLOCK (only if supermajority required): (1) Certain amendments to certificate of incorporation requiring supermajority (typically 66.7% or 80%), (2) Going-private transactions requiring supermajority approval (though Apollo may structure as tender offer to bypass shareholder vote). Public shareholders CANNOT BLOCK: Director elections, simple majority mergers, asset sales not requiring shareholder vote, debt incurrence (creditor decision), operational changes (board/management authority). Public shareholders can FORCE (via litigation): Appraisal proceedings if taken private, derivative claims for breach of fiduciary duty (subject to demand refusal and board independence), class actions for disclosure violations or fraud.",
      "claim_type": "FACT",
      "evidence_sources": [
        "Public ownership calculated as 100% minus Apollo 53-57% = 43-47%",
        "Stock price $0.4757 per Yahoo Finance February 4, 2026",
        "Market cap ~$120M calculated from share price and shares outstanding",
        "Delaware appraisal rights under DGCL Section 262",
        "Shareholder rights under DGCL and federal securities laws (standard legal framework)"
      ]
    },
    {
      "actor": "Senior Management (CEO, CFO, Operating Executives)",
      "type": "SHAREHOLDER",
      "formal_rights": "Operational authority delegated by board to run day-to-day business. Employment agreements (filed with SEC) likely contain: (1) Change-of-control severance provisions (golden parachutes), (2) Equity incentive grants (RSUs, options) aligning economic interest with shareholders, (3) Non-compete, non-solicit, and confidentiality provisions, (4) Termination for cause vs without cause definitions affecting severance. Board retains authority to: hire/fire CEO, approve major transactions, set executive compensation, approve budgets and strategic plans. Management has NO FORMAL GOVERNANCE CONTROL (no board majority, no veto rights) but has INFORMATIONAL ADVANTAGE and OPERATIONAL DISCRETION within board-approved parameters.",
      "informal_or_effective_control": "Management exercises OPERATIONAL CONTROL through: (1) Day-to-day decision-making on customer contracts, pricing, vendor selection, hiring/firing below executive level, (2) Information asymmetry - management controls what information board receives and when, (3) Agenda-setting for board meetings and strategic planning processes, (4) Relationships with customers, employees, and partners that are difficult to replace, (5) Ability to slow-walk or expedite board directives through operational execution. Management can CREATE FRICTION for Apollo or acquirer through: (1) Selective information disclosure, (2) Retention risk (key executives may leave if dissatisfied), (3) Operational disruption during transition, (4) Influence over employee morale and customer relationships. Management's ECONOMIC EXPOSURE via equity grants likely modest relative to Apollo's stake - creates principal-agent misalignment (management prioritizes employment stability and compensation over shareholder value maximization).",
      "what_they_can_block": "Management CANNOT FORMALLY BLOCK: Board decisions, shareholder votes, M&A transactions approved by board/shareholders, financings approved by board, strategic changes directed by board. Management can INFORMALLY OBSTRUCT: (1) Acquisition integration or due diligence by withholding cooperation, (2) Operational changes by slow implementation, (3) Board initiatives by providing pessimistic projections or emphasizing execution risks, (4) Talent retention by signaling instability to key employees. Management can THREATEN TO LEAVE (resignation threat) which creates risk of: Customer disruption, employee departures, operational knowledge loss, covenant violations if business deteriorates post-departure. Management can FORCE (via market leverage): Severance payments if terminated without cause or following change of control (golden parachutes create cost of management replacement).",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Employment agreements for executives (DK Sinha, Mark Marino, Naushaza Molu) listed in Justia contracts database as filed with SEC",
        "Standard CEO/CFO authority under Delaware corporate law and typical board delegation",
        "Change-of-control provisions in executive employment agreements (standard practice, specific terms not publicly detailed)",
        "Board transition announcement January 17, 2025 demonstrating board control over executive oversight"
      ]
    },
    {
      "actor": "NASDAQ Stock Market",
      "type": "REGULATOR",
      "formal_rights": "Listing standards impose requirements on Rackspace Technology, Inc. including: (1) Minimum bid price of $1.00 per share (current price $0.48 is DEFICIENT), (2) Minimum market value of publicly held shares, (3) Audit committee composed of independent directors, (4) Majority independent board (or alternative corporate governance for controlled company), (5) Annual and quarterly financial reporting, (6) Timely disclosure of material events via 8-K, (7) Shareholder meeting requirements. NASDAQ can: (1) Issue deficiency notice if standards not met, (2) Grant compliance period (typically 180 days) to cure, (3) Delist company if non-compliance persists, (4) Halt trading for material news or investigations.",
      "informal_or_effective_control": "NASDAQ exercises INDIRECT CONTROL by making public listing CONDITIONAL on compliance. Delisting creates: (1) Loss of liquidity for public shareholders (OTC trading less liquid), (2) Forced sale by institutional investors with listing requirements, (3) Reputation harm and customer/employee concerns, (4) Potential debt covenant violations if credit agreement contains listing maintenance covenant. To avoid delisting, company may be FORCED to: (1) Execute reverse stock split to boost per-share price above $1.00, (2) Complete going-private transaction to voluntarily delist, (3) Raise capital to increase market cap (but dilutes Apollo and public shareholders). NASDAQ listing is quasi-voluntary (company can delist anytime) but delisting imposes costs, giving NASDAQ effective leverage.",
      "what_they_can_block": "NASDAQ can BLOCK: (1) Continued public trading if listing standards violated and not cured, (2) Trading resumption after halt if material disclosure concerns unresolved. NASDAQ CANNOT BLOCK: M&A transactions, operational changes, financing decisions, board elections (these are company/shareholder decisions). NASDAQ can FORCE: (1) Delisting if non-compliance persists (company can appeal to NASDAQ Hearings Panel), (2) Additional disclosure via comment letters or deficiency notices, (3) Trading halts for material news or regulatory concerns.",
      "claim_type": "FACT",
      "evidence_sources": [
        "NASDAQ listing of RXT ticker (publicly verifiable)",
        "Stock price $0.4757 below $1.00 minimum (Yahoo Finance February 4, 2026)",
        "NASDAQ Listing Rules (publicly available on NASDAQ website)",
        "NASDAQ deficiency notice process standard for all listed companies"
      ]
    }
  ]
}
