{
  "sub_stage": "2.6",
  "unknowns_requests": [
    {
      "information_needed": "Comprehensive Net Revenue Retention (NRR) and Gross Revenue Retention (GRR) analysis by segment with cohort tracking: (1) Annual cohort retention for customers acquired 2020, 2021, 2022, 2023 - show % of original cohort revenue retained in each subsequent year by segment, (2) Expansion revenue (upsells, cross-sells) and contraction revenue (downgrades, partial churn) by cohort and segment, (3) Calculated NRR and GRR by segment by year, (4) Weighted average NRR across entire business, (5) Decomposition of 21% net leakage (14% bookings - 7% revenue decline): How much is gross churn vs contraction vs timing/recognition? Which segments drive majority of leakage?, (6) Customer count by segment trending over time (not just revenue - show if losing customers or losing revenue per customer)",
      "why_needed": "RESOLVES CONTRADICTION SEVERITY AND LOCALIZATION: 21% net leakage proves business model dysfunction, but DISTRIBUTION of leakage determines if resolvable or terminal. If ONE segment (e.g., SMB) has 50-65% NRR while others have 85-95% NRR, then business can be made coherent by EXITING bad segment (localized problem). If ALL segments have 75-85% NRR, then dysfunction is SYSTEMIC and business model fundamentally broken (cannot fix by segment pruning). NRR/GRR directly measures: (1) Are existing customers expanding (NRR >100%) or contracting (NRR <100%)? (2) How fast is customer base eroding (100% - GRR = annual erosion rate)? (3) What is customer lifetime (1/churn rate)? (4) Is LTV > CAC in each segment (if NRR too low, acquisition destroys value)? AFFECTS: (1) Segment exit decision - if one segment has catastrophically low NRR (<65%), immediate exit justified. (2) Resource allocation - stop acquisition spending on segments with LTV < CAC. (3) Contradiction assessment - distributed low NRR proves systemic incoherence vs localized in one segment. (4) Management evaluation - if management doesn't track NRR/GRR, indicates fundamental incompetence (not measuring critical metrics). CRITICAL: This is SINGLE MOST IMPORTANT METRIC to assess business model viability and determine if contradictions are resolvable.",
      "request_to": "Management / CFO AND Chief Revenue Officer",
      "format": "Excel file with multiple tabs: (1) Cohort retention by segment: For each acquisition year cohort (2020-2023) and segment, show revenue in acquisition year (Year 0) and retained revenue in Years 1, 2, 3, 4. Calculate GRR as Year N revenue / Year 0 revenue. (2) Expansion and contraction: For each cohort/segment, show expansion $ (upsells/cross-sells) and contraction $ (downgrades/partial churn) by year. Calculate NRR as (Retained revenue + Expansion - Contraction) / Year 0 revenue. (3) Summary metrics: NRR and GRR by segment by year, weighted average across business, comparison to industry benchmarks (target >100% NRR, >85% GRR). (4) Customer count trending: Show customer count by segment quarterly 2022-2024, calculate customer retention % and new customer adds. (5) Leakage decomposition: Reconcile 14% bookings growth vs 7% revenue decline - allocate 21% net leakage to: gross churn %, contraction %, timing/recognition %, by segment. (6) Management commentary: How does management explain 21% net leakage? What is plan to reduce to sustainable levels?"
    },
    {
      "information_needed": "Management strategic awareness and contradiction resolution plans: (1) Most recent board strategic planning presentations (last 4 quarters) showing: How management assesses business health, segment performance, competitive positioning, strategic priorities, (2) Internal financial models/forecasts showing: Revenue and profit projections by segment for next 3 years, assumptions on churn reduction, margin expansion, how management plans to resolve revenue decline, (3) Documented cost reduction or restructuring plans if any exist: Targets for SG&A reduction, segment exit evaluations, entity consolidation options, (4) Segment profitability analysis: How management calculates segment operating income, which segments are viewed as 'invest/defend' vs 'harvest/exit', (5) Management discussion of identified contradictions: Is 21% net leakage acknowledged? VMware cost shock? Partner dependency? SG&A structural inefficiency? Profit concentration risk? What are proposed solutions?",
      "why_needed": "DETERMINES MANAGEMENT CREDIBILITY AND STRATEGY VIABILITY: If management AWARE of contradictions with DOCUMENTED plans to resolve (segment exits, cost restructuring, M&A strategy), business may be salvageable under new ownership executing different strategy. If management UNAWARE (doesn't acknowledge 21% net leakage, believes growth narrative, no contradictions identified in board materials), indicates fundamental INCOMPETENCE - any stated strategy is worthless, requires full management replacement. If management AWARE but CONCEALING (knows problems but marketing false narrative externally), indicates INTEGRITY issues and potential fraud risk (misleading disclosures to investors/lenders). AFFECTS: (1) Management retention in M&A - cannot retain incompetent or dishonest management, but might retain competent management with realistic plan. (2) Valuation - if no turnaround plan, acquirer must assume full restructuring burden and cost ($100-200M+ estimated for restructuring). (3) Due diligence depth - if concealing, requires forensic accounting to find other hidden problems. (4) Transaction timing - if management has viable plan but needs 12-18 months to execute, affects whether to acquire now vs wait. (5) Board assessment - if board receiving accurate information but failing to act, indicates board dysfunction (governance problem on top of business model problem). CRITICAL: Cannot evaluate ANY management representations without knowing their awareness level and quality of internal analysis.",
      "request_to": "Management / CEO, CFO, AND Board (through counsel access to board materials)",
      "format": "Board materials: Provide complete board decks from last 4 quarterly board meetings showing: Strategic discussions, financial performance reviews, segment deep-dives, risk assessments, management recommendations. Financial models: Provide management's internal 3-year financial projections (revenue, margin, profit by segment), including assumptions document explaining: How churn will be reduced, how margins will be defended against partner pressures, how SG&A will be scaled, how growth will be reignited. Restructuring plans: If any exist, provide documentation of: Cost reduction targets and timeline, segment exit evaluations (which segments considered for exit? financial impact modeling?), entity consolidation analyses (can Government/UK Sovereign be consolidated? what are barriers?). Management interview: Schedule 2-3 hour session with CEO/CFO to discuss: 'Walk us through how you explain 14% bookings growth + 7% revenue decline. What is your detailed plan to eliminate 21% net leakage? Rank segments by strategic priority and explain ranking. How do you plan to respond to VMware cost shock? What is your SG&A reduction target? Which segments are you considering exiting and why?' Record responses to assess awareness and credibility."
    },
    {
      "information_needed": "Debt covenant compliance status and financial distress timeline modeling: (1) Complete debt agreements with covenant schedules (term loan, revolver, any bonds or other facilities), (2) Quarterly covenant compliance certificates (actual vs required) for last 4 quarters showing: Leverage ratio (Total Debt / EBITDA), Interest coverage ratio (EBITDA / Interest Expense), Minimum EBITDA levels, any other financial covenants, (3) Management projections of covenant compliance for next 8 quarters under multiple scenarios: Base case (current trajectory -7% revenue decline), Bear case (revenue decline accelerates to -12-15% from VMware/hyperscaler shocks), Restructuring case (exit SMB, what impact on covenants?), (4) Covenant calculation methodology: Which entities/segments included in EBITDA? Can exclude divested segments? Adjustments allowed (add-backs)?, (5) Lender relationship status: Any covenant waivers requested or granted? Any lender concerns raised? Frequency of lender communication?, (6) What happens at breach: Immediate acceleration? Cure period (30-60-90 days)? Mandatory prepayment? Increased pricing? Lender consent required for strategic actions?",
      "why_needed": "DETERMINES TRANSACTION URGENCY AND AVAILABLE OPTIONS: If covenant headroom <6 months at current trajectory, business in IMMEDIATE FINANCIAL DISTRESS requiring: (1) Emergency sale process (90-120 days to close before breach) at distressed valuation (30-50% discount), (2) Lender consent for any transaction (lenders effectively control process), (3) Potential need for DIP (debtor-in-possession) financing if breach before close. If headroom >18 months, more time for: (1) Strategic process with multiple bidders (6-9 months), (2) Potential turnaround attempts before sale, (3) Segment divestitures to improve covenant position. COVENANT MATH MAY FORCE CONTINUATION OF INCOHERENT MODEL: If exiting unprofitable SMB segment (improving long-term viability) HURTS near-term EBITDA (fixed costs don't reduce immediately), may breach covenants - forces keeping value-destroying segment to maintain debt compliance. Partner cost absorption (VMware 200-300% increase) may be FORCED by lenders to maintain revenue and EBITDA even though it destroys profitability - trapped by debt structure. AFFECTS: (1) Seller leverage - financial distress eliminates negotiating power (must sell), (2) Timeline - covenant breach timeline determines process speed, (3) Restructuring options - covenant constraints may prevent optimal restructuring (can't exit segments, can't cut costs deeply), (4) Buyer universe - some buyers won't touch distressed situations, limits competition. CRITICAL: Debt covenants may be controlling constraint preventing resolution of business model contradictions.",
      "request_to": "Management / CFO AND outside counsel (for covenant interpretation)",
      "format": "Debt documentation: Provide complete executed credit agreements and amendments with covenant schedules clearly marked. Compliance tracking: Excel file showing quarterly covenant calculations for last 8 quarters and projected next 8 quarters: (1) Leverage ratio: Total Debt $X / EBITDA $Y = Z.ZX vs covenant max of A.AX, headroom = A.A - Z.Z turns, (2) Interest coverage: EBITDA $Y / Interest $I = J.JX vs covenant min of K.KX, (3) Minimum EBITDA: Actual $Y vs required $Q. Scenario modeling: Show covenant compliance under: (1) Base case (-7% revenue, flat margin), (2) Bear case (-12% revenue from VMware shock, margin compression to 15%), (3) Restructuring (exit SMB -$200M revenue, +$10M EBITDA from loss elimination), (4) Private Cloud collapse (-30% revenue from VMware exodus, -$100M EBITDA). Identify which scenarios breach which covenants and when. Lender communications: Summary of any lender discussions about covenant concerns, waiver requests, or strategic restrictions. Legal memo: Outside counsel opinion on: (1) Covenant breach consequences and cure rights, (2) Lender consent requirements for M&A or restructuring, (3) Ability to exclude divested segments from covenant calculations."
    },
    {
      "information_needed": "Private Cloud customer-level economics, VMware exposure analysis, and migration feasibility assessment: (1) Private Cloud platform breakdown: % revenue from VMware vs OpenStack vs Hyper-V vs other platforms (quarterly trend 2022-2024), (2) VMware customer analysis: Customer count, average contract value, revenue distribution (top 10, top 50, long tail), customer tenure (vintage analysis), gross margin by platform (VMware vs alternatives), churn rate by platform, (3) VMware licensing cost exposure: Total VMware licensing spend 2022-2024 showing Broadcom price increase impact, VMware costs as % of VMware segment revenue, licensing cost per customer, Broadcom contract terms (can reduce licenses as customers churn? minimum commitments? termination provisions?), (4) VMware-to-alternative migration assessment: Technical feasibility (which customers can migrate OpenStack/Hyper-V? technical barriers?), Customer acceptance (have customers been consulted? willingness to migrate?), Timeline (how long to migrate 10%, 25%, 50% of base?), Expected loss rate (what % of customers would churn rather than migrate?), Cost (migration team costs, dual-platform support costs, customer incentives), (5) VMware pass-through analysis: Has Rackspace increased Private Cloud pricing to offset VMware costs? How much passed through to customers? Customer reaction/churn impact? What % of increase can be passed through before triggering mass exodus?",
      "why_needed": "RESOLVES PRIVATE CLOUD CONTRADICTION VIABILITY: Private Cloud provides 40-50% of operating income but declining 13% YoY while experiencing VMware price shock (200-300% increase). Need to determine if segment has ANY viable resolution path or is terminal. If 90%+ VMware-dependent with largest customers VMware-locked, segment has NO ESCAPE - must absorb costs (margin compression from 38.6% to 25-30%, segment becomes marginally profitable) OR pass through costs (churn acceleration to -20-30% annually, death spiral) OR exit (lose 40-50% of total OI, financial collapse). If 60% VMware with ability to migrate customers to alternatives over 2-3 years with acceptable loss (10-15%), provides strategic option to preserve segment. VMware exposure distribution CRITICAL: If high-value customers are VMware-locked while low-value customers can migrate, worst possible situation (forced to defend low-margin VMware customers while losing better alternatives). If high-value customers are OpenStack/Hyper-V, can accept VMware customer losses (reduce revenue but preserve profit). AFFECTS: (1) Private Cloud defense strategy - if 90% VMware-locked, must develop exit plan. If 60% VMware, can defend non-VMware and accept VMware losses. (2) Segment valuation - heavy VMware exposure requires major valuation discount. (3) M&A positioning - if large customers protected from VMware, can position as 'manageable problem'. If large customers exposed, segment value deeply discounted. CRITICAL: This determines if Private Cloud is saveable or terminal, which determines if overall business is viable (Private Cloud is 40-50% of profit).",
      "request_to": "Management / VP Private Cloud Operations AND CFO",
      "format": "Platform analysis: Excel file showing Private Cloud revenue and customer breakdown by platform quarterly 2022-2024: VMware %, OpenStack %, Hyper-V %, other. Show customer count, average contract value, revenue concentration (top 10, 50, 100 customers) by platform. VMware cost impact: (1) VMware licensing spend 2022-2024 with quarterly detail showing when Broadcom increase took effect, (2) VMware cost as % of VMware segment revenue, (3) Per-customer VMware cost (average), (4) Broadcom contract terms summary. Migration feasibility study: Provide any internal analysis of: (1) Technical migration path from VMware to OpenStack/Hyper-V (document architecture, compatibility, risks), (2) Customer conversations about migration (which customers willing? which resistant? which would churn?), (3) Projected migration timeline and cost (if migrate 25% of base over 18 months, what resources required?), (4) Expected loss rate (benchmark against other MSPs' platform migrations - typical 10-30% loss rate). Cost pass-through analysis: (1) Have Private Cloud prices increased since VMware shock? By how much? (2) Customer churn impact - has churn accelerated in VMware customers? (3) What % price increase do you estimate customers will accept before mass exodus (5%? 10%? 20%)? Model multiple pricing scenarios and churn impact."
    }
  ]
}
