{
  "sub_stage": "2.6",
  "disconfirming_evidence_not_found": [
    "Evidence of RESOLVABLE contradictions where one resolution path succeeds without triggering financial distress or operational collapse (SOUGHT but NOT FOUND): Every touch test shows all resolution options (defend, harvest, exit, invest, cut) lead to distress.",
    "Evidence of LOCALIZED contradictions that don't cascade systemically (SOUGHT but NOT FOUND): 7 of 8 identified contradictions are SYSTEMIC affecting entire business model, not localized to single segment or function.",
    "Evidence of TRADE-OFFS being successfully managed - business optimizing for profit OR growth and succeeding at chosen priority (SOUGHT but NOT FOUND): Both profit AND revenue declining - neither priority being successfully defended.",
    "Evidence of business model ADAPTATION successfully resolving emerging contradictions (SOUGHT but NOT FOUND): Contradictions worsening over time (VMware shock new 2023-2024, email death spiral emerging 2026, Private Cloud decline accelerating).",
    "Evidence that 21% net leakage is TIMING or RECOGNITION issue not structural churn (SOUGHT but NOT FOUND): If bookings don't convert to revenue for 12-18 months due to deployment lag, could explain revenue/bookings gap temporarily - no evidence of this explanation.",
    "Evidence of PROFITABLE customer acquisition where LTV exceeds CAC across all segments (SOUGHT but NOT FOUND): Low-margin segments (Mid-Market 15-25%, SMB 0-10%) combined with high churn (15-40%) likely have LTV < or barely > CAC.",
    "Evidence of SCALE ECONOMIES being achieved or achievable under current structure (SOUGHT but NOT FOUND): SG&A remains 25.9% despite scale ($2.7B revenue), multi-entity fragmentation prevents consolidation.",
    "Evidence of CONTRACTUAL LOCK-IN successfully protecting revenue despite month-to-month billing (SOUGHT but NOT FOUND): Month-to-month universal with zero early termination fees = zero contractual protection.",
    "Evidence of PRICING POWER from differentiation enabling margin expansion or cost pass-through (SOUGHT but NOT FOUND): Email 706% price increase triggered immediate churn proving zero pricing power, Public Cloud 10.4% margin indicates commoditization.",
    "Evidence of PARTNER NEGOTIATING SUCCESS - Rackspace securing concessions, protections, or favorable terms after adverse changes (SOUGHT but NOT FOUND): No evidence Broadcom offered VMware relief, no evidence hyperscalers protected Rackspace from program changes.",
    "Evidence of MANAGEMENT PLAN to resolve identified contradictions (SOUGHT but NOT FOUND): No evidence of documented restructuring plan, segment exit strategy, or contradiction resolution roadmap.",
    "Evidence of SEGMENT EXIT DECISIONS eliminating value-destroying segments (SOUGHT but NOT FOUND): SMB likely loss-making but continues operating (no exit plan identified), no evidence of strategic segment pruning.",
    "Evidence that growth narrative MATCHES operational reality - actual positive unit economics driving sustainable growth (SOUGHT but NOT FOUND): 21% net leakage proves growth narrative false, unit economics likely negative in low-margin segments.",
    "Evidence that multi-cloud value proposition is REAL not marketing - balanced hyperscaler distribution and true platform independence (SOUGHT but NOT FOUND): Hyperscaler concentration unknown but likely 60-70% on primary, contradicting multi-cloud claim.",
    "Evidence of CUSTOMER SATISFACTION supporting Fanatical Support premium positioning (SOUGHT but NOT FOUND): NPS/CSAT unknown, but 15-40% estimated churn suggests customers NOT satisfied despite branding.",
    "Evidence of PRIVATE CLOUD INVESTMENT matching stated dependency (SOUGHT but NOT FOUND): CapEx declining 25% contradicts Private Cloud dependency claim (underinvestment in critical segment).",
    "Evidence of OPERATIONAL EXCELLENCE overcoming structural contradictions (SOUGHT but NOT FOUND): Best-in-class execution cannot overcome 21% net leakage structural problem or partner extraction economics.",
    "Evidence that HISTORICAL COMPLEXITY added value through synergies (SOUGHT but NOT FOUND): $715M goodwill impairment proves acquisitions destroyed value, created complexity without synergies.",
    "Evidence of business model COHERENCE at founding that persists today (SOUGHT but NOT FOUND): Original SMB email hosting was coherent but current complex multi-segment, multi-entity, partner-dependent model is incoherent.",
    "Evidence that fixed costs can be RAPIDLY REDUCED to match revenue volatility (SOUGHT but NOT FOUND): SG&A flat at 25.9% despite 7% revenue decline shows costs are sticky, cannot adjust to revenue changes.",
    "Evidence of PARTNER MUTUAL DEPENDENCY creating balanced relationship (SOUGHT but NOT FOUND): Rackspace <0.5% of partner revenue, partners 100% of Rackspace business = maximum asymmetry.",
    "Evidence that customer churn is VOLUNTARY (customers leaving for better alternatives) vs FORCED (Rackspace pushing out low-value customers) (SOUGHT but NOT FOUND): No evidence of intentional customer culling, churn appears involuntary loss.",
    "Evidence of MARGIN EXPANSION despite partner cost pressures (SOUGHT but NOT FOUND): Public Cloud 10.4% thin, Private Cloud 38.6% under compression from VMware, overall margins declining not expanding.",
    "Evidence that SEGMENT PORTFOLIO is complementary and synergistic (SOUGHT but NOT FOUND): Government/UK Sovereign isolated from commercial, segments require mutually exclusive resource allocation strategies.",
    "Evidence of CUSTOMER CONSOLIDATION reducing concentration risk (SOUGHT but NOT FOUND): No evidence customers are consolidating spending with Rackspace vs fragmenting across multiple providers.",
    "Evidence that BOOKINGS METRIC is reliable predictor of future revenue (SOUGHT but NOT FOUND): 14% bookings growth + 7% revenue decline = 21% net leakage suggests bookings don't convert reliably or churn exceeds new bookings.",
    "Evidence of DEBT COVENANT HEADROOM providing financial flexibility (SOUGHT but NOT FOUND): Covenant status unknown but revenue decline + margin compression likely eroding headroom.",
    "Evidence that contradictions are RECENT and REMEDIABLE (SOUGHT but NOT FOUND): Contradictions appear to be multi-year accumulation through acquisitions and complexity, deeply embedded in structure.",
    "Evidence of BOARD OR MANAGEMENT acknowledgment of business model problems (SOUGHT but NOT FOUND): Public statements focus on growth narrative not structural challenges.",
    "Evidence that REGULATORY CONSTRAINTS preventing resolution are temporary or negotiable (SOUGHT but NOT FOUND): FedRAMP entity isolation, UK Sovereign architectural separation are PERMANENT by design, not temporary.",
    "Evidence that CUSTOMER SEGMENTS have aligned needs enabling shared infrastructure/operations (SOUGHT but NOT FOUND): Government requires isolation, UK Sovereign requires separation, commercial segments have different technical/compliance needs - cannot consolidate.",
    "Evidence of POSITIVE NET CHURN (expansions exceed gross churn) in any segment (SOUGHT but NOT FOUND): Revenue declining 7% YoY proves net churn is positive not negative (contracting not expanding).",
    "Evidence that DECLINING REVENUE is strategic choice (intentional harvest/refocus) not business model failure (SOUGHT but NOT FOUND): Management markets growth narrative contradicting decline reality, suggests decline is unintentional."
  ]
}
