{
  "sub_stage": "2.6",
  "uncertainty_register": [
    {
      "unknown": "ACTUAL NET REVENUE RETENTION (NRR) AND GROSS REVENUE RETENTION (GRR) BY SEGMENT: Calculated net leakage of 21% (14% bookings - 7% revenue decline) indicates high churn, but ACTUAL segment-specific GRR (% of prior year revenue retained from same cohort) and NRR (GRR + upsells - downgrades) are unknown. If Mid-Market GRR is 75-85% (15-25% churn) and NRR is 70-80% (contraction exceeds upsells), versus Private Cloud GRR 90-95% (5-10% churn) and NRR 85-90%, then resource allocation priorities are clear. If SMB GRR is 60-75% (25-40% churn) and NRR is 50-65% (massive contraction), segment is value-destroying and should be exited immediately.",
      "type": "UNKNOWN",
      "decision_impact": "DETERMINES WHETHER CONTRADICTIONS ARE RESOLVABLE: If GRR/NRR data shows one or two segments driving ALL churn (e.g., SMB 60% GRR while others 85-95%), then business model can be made coherent by EXITING bad segments. If churn is DISTRIBUTED across all segments (all segments 75-85% GRR), then contradiction is SYSTEMIC and not resolvable by segment pruning. AFFECTS: (1) Segment exit decision - if SMB has 50-65% NRR, immediate exit justified (value-destroying). If SMB has 80% NRR, exit unjustified (profitable retention). (2) Resource allocation - if one segment has low NRR, stop all acquisition spending on that segment (stop filling leaky bucket). (3) Contradiction severity - distributed low NRR across all segments proves business model fundamentally broken vs localized in one segment. (4) M&A positioning - if one segment dragging down overall NRR, can exclude that segment from transaction to improve metrics. CRITICAL: Without NRR/GRR, cannot distinguish 'growth with high churn' from 'death spiral'. Both show bookings growth + revenue decline, but NRR reveals whether existing customers expanding (growth with churn) or contracting (death spiral).",
      "what_would_reduce_uncertainty": "REQUEST: Annual cohort retention analysis by segment: For customers acquired in 2020, 2021, 2022, 2023, show % of revenue retained in subsequent years plus expansions/contractions. Example: 2020 cohort had $100M revenue in 2020 → $85M in 2021 (85% GRR) → $78M in 2022 (91.8% GRR year-over-year) → $73M in 2023 (93.6% GRR). If upsells added $5M and downgrades subtracted $12M, NRR = 85% + 5% - 12% = 78%. Repeat for each segment. CALCULATE: Weighted average NRR across business. If <90%, business is net contracting (existing customers shrinking faster than new customers growing). If >110%, business has negative net churn (upsells exceed churn). BENCHMARK: SaaS/cloud businesses target >100% NRR (growth from existing base), MSPs typically 85-95% NRR. Rackspace implied ~79% NRR (100% - 21% net leakage) is FAILING."
    },
    {
      "unknown": "MANAGEMENT AWARENESS OF CONTRADICTIONS: Does executive leadership recognize business model contradictions identified in this analysis? Do internal strategy documents acknowledge: (1) 21% net leakage problem, (2) SG&A structural inefficiency (25.9% vs healthy 15-18%), (3) Profit concentration risk (55-75% OI from two declining segments), (4) Partner value extraction trap, (5) Fixed costs + zero lock-in vulnerability? Or does management operate under narrative mismatch (believing growth story, multi-cloud differentiation, premium positioning) despite contradicting evidence?",
      "type": "UNKNOWN",
      "decision_impact": "DETERMINES MANAGEMENT CREDIBILITY AND STRATEGY VIABILITY: If management AWARE of contradictions and has explicit plan to resolve (documented strategy for segment exits, cost restructuring, M&A), then business may be salvageable under new ownership with different strategy. If management UNAWARE (truly believes growth narrative despite 21% net leakage), indicates fundamental incompetence and any stated strategy is worthless - requires full management replacement. If management AWARE but CONCEALING (knows problems but marketing false narrative to investors/customers), indicates integrity issues and potential fraud risk (misleading disclosures). AFFECTS: (1) Acquirer retention of management - if unaware, cannot retain leadership. If aware with plan, may retain. (2) Valuation - if management has no plan, acquirer must assume full turnaround burden and cost. (3) Due diligence depth - if concealing, requires forensic accounting to uncover other hidden problems. (4) Deal structure - if unaware/concealing, requires immediate post-close management change vs transitional support if aware/planning. CRITICAL: Cannot evaluate ANY strategic plan from management without knowing if they understand reality.",
      "what_would_reduce_uncertainty": "REQUEST: (1) Most recent board strategic planning presentations (last 2-3 quarters), (2) Internal financial models/forecasts showing how management projects resolving revenue decline, (3) Cost reduction or restructuring plans if any exist, (4) Segment profitability reviews showing how management evaluates segment performance and exit decisions, (5) Management discussions of 21% net leakage and churn crisis (if documented). INTERVIEW: Ask CEO/CFO directly: 'How do you reconcile 14% bookings growth with 7% revenue decline? What is your plan to eliminate 21% net leakage? Which segments are profitable and which are destroying value? What is your strategy for VMware cost shock and hyperscaler margin compression?' Responses will reveal awareness level immediately - aware management will have specific data-backed answers, unaware management will deflect or provide vague generalities."
    },
    {
      "unknown": "DEBT COVENANT HEADROOM AND FINANCIAL DISTRESS TIMELINE: What are actual debt covenant requirements (leverage ratio, interest coverage, minimum EBITDA) and how much headroom exists? If revenue continues declining 7% annually and operating margin compressed by partner extraction (VMware, hyperscaler credits), how many quarters until covenant breach? Are covenants based on total business EBITDA or can exclude segments (e.g., if exit SMB, does that hurt or help covenants)? What happens at covenant breach - immediate acceleration, cure period, waiver negotiation?",
      "type": "UNKNOWN",
      "decision_impact": "DETERMINES URGENCY AND TRANSACTION TIMELINE: If debt covenants have <6 months headroom at current trajectory, business is in IMMEDIATE FINANCIAL DISTRESS and any M&A must close within 3-4 months (before breach) or become distressed sale (post-breach). If >18 months headroom, more time for strategic process and potential turnaround attempts. AFFECTS: (1) Seller negotiating leverage - financial distress eliminates leverage (must sell vs optional sale), (2) Valuation - distressed sale typically 30-50% discount vs normal process, (3) Deal structure - pre-breach allows orderly transition, post-breach may require DIP financing or creditor consent, (4) Segment decisions - if exiting unprofitable SMB hurts EBITDA absolute $ (even if improves %), may breach covenants forcing keeping value-destroying segment. (5) Partner negotiations - lenders may force Rackspace to accept unfavorable partner terms (absorb VMware costs, accept hyperscaler credit cuts) to maintain revenue and avoid breach. CRITICAL: Covenant math may FORCE business to continue operating incoherent model (can't exit segments, can't cut costs, can't pass through partner costs) even though these actions accelerate long-term decline - trapped by debt structure.",
      "what_would_reduce_uncertainty": "REQUEST: (1) Complete debt agreements (term loan, revolver, bonds if any) with covenant schedules, (2) Quarterly covenant compliance certificates showing actual vs required levels (last 4 quarters), (3) Management projections of covenant compliance for next 8 quarters under base/bear case scenarios, (4) Lender relationship status - any concerns raised? Any modifications requested?, (5) What segments are included in covenant EBITDA calculation (can exclude divested segments?). CALCULATE: At current trajectory (revenue -7% YoY, assume operating margin flat or compressed), when does leverage ratio breach covenant? Model scenarios: (A) Exit SMB (lose $135-275M revenue, gain/lose $X EBITDA), (B) Private Cloud accelerates decline to -20% YoY (VMware cost shock), (C) Hyperscaler credit reduction compresses Public Cloud margin from 10.4% to 5.4%. How do these affect covenant headroom?"
    },
    {
      "unknown": "PRIVATE CLOUD CUSTOMER-LEVEL ECONOMICS AND VMWARE EXPOSURE: Within Private Cloud $1,055M revenue, what % is VMware-based vs OpenStack/Hyper-V alternatives? If 80-90% VMware, entire segment exposed to Broadcom pricing. If 50-60% VMware, can potentially migrate some customers to alternatives. For VMware customers specifically: What is average contract size, customer tenure, churn rate, gross margin? Are largest/most profitable customers VMware-dependent (concentrating risk) or is VMware exposure spread across many small customers (distributed risk)?",
      "type": "UNKNOWN",
      "decision_impact": "DETERMINES PRIVATE CLOUD SEGMENT VIABILITY AND RESOLUTION OPTIONS: If Private Cloud is 90% VMware-dependent with largest customers VMware-locked, segment has NO ESCAPE from Broadcom pricing power - must either absorb costs (margin compression to 25-30%, segment becomes marginally profitable) or pass through costs (customer churn acceleration to -20-30% annually, death spiral). If Private Cloud is 60% VMware with smaller customers VMware-concentrated and large customers OpenStack/Hyper-V, can PROTECT high-value customers while accepting VMware customer losses - reduces segment revenue but preserves profit. AFFECTS: (1) Segment defense strategy - if 90% VMware-locked, must develop exit plan (no viable defense). If 60% VMware, can defend non-VMware portion. (2) M&A positioning - if VMware exposure concentrated in low-value customers, can market segment as 'VMware problem being managed, high-value customers protected'. If exposure in high-value customers, segment valuation deeply discounted. (3) Migration feasibility - if customers can be migrated from VMware to OpenStack/Hyper-V over 2-3 years with acceptable loss rate (10-15%), provides strategic option. If migration infeasible (90%+ VMware-locked), no options. CRITICAL: This determines whether Private Cloud contradiction has ANY resolution path or is terminal.",
      "what_would_reduce_uncertainty": "REQUEST: (1) Private Cloud revenue breakdown: VMware %, OpenStack %, Hyper-V %, other platforms, (2) VMware customer analysis: Count, average contract value, top 10 customers VMware vs alternatives, churn rate VMware vs alternatives, gross margin VMware vs alternatives, (3) VMware licensing costs as % of VMware segment revenue (to quantify Broadcom exposure), (4) Customer migration assessment: Has Rackspace evaluated migrating VMware customers to OpenStack/Hyper-V? Technical feasibility? Customer acceptance? Timeline? Expected loss rate? Cost? (5) VMware contract terms: Can Rackspace reduce VMware footprint as customers churn or locked into minimum commitments? If locked, what penalties for under-consumption? CALCULATE: If forced to absorb 200% VMware price increase on X% of Private Cloud, what segment margin compression? If pass through 20% price increase (partial), what churn acceleration estimate? Model resolution scenarios and financial impacts."
    }
  ]
}
