{
  "sub_stage": "3.1",
  "inevitable_margin_pressures": [
    {
      "source_of_pressure": "Hyperscaler Partner Credit Compression",
      "affected_role_or_segment": "Public Cloud Managed Services ($1,683M, 61% of revenue)",
      "why_pressure_is_structural": "Partner credit compression is STRUCTURAL not cyclical because: (1) HYPERSCALER STRATEGIC INTENT - AWS, Azure, Google strategically prefer direct customer relationships over channel partnerships for: higher margins (eliminate partner credit costs), better customer data (direct telemetry and usage patterns), deeper integration (no intermediary friction), competitive moat (customer lock-in to direct relationship). Partner programs exist for market reach, not strategic preference - hyperscalers tolerate partners to access customers they cannot reach directly but continuously work to disintermediate. (2) PROGRAM CONTROL ASYMMETRY - Hyperscalers can unilaterally reduce partner credits quarterly or annually with zero advance notice per Stage 2.5, no disclosed long-term agreements protecting MSP credit levels, Rackspace has zero negotiating leverage (<0.5% of hyperscaler revenue makes Rackspace expendable). (3) MANAGED SERVICES COMPETITION - Hyperscalers building native managed services (AWS Managed Services, Azure Managed Services) that directly compete with MSP model, creating strategic incentive to reduce partner credits to make direct managed services more price-competitive. (4) MARGIN PRESSURE MECHANISM - Current partner credits estimated 5-15% constitute Rackspace's entire infrastructure margin per Stage 2.5, any credit reduction flows directly to gross margin compression (10.4% current gross margin could fall to 5-7% with 30-50% credit reduction), no ability to offset through cost reduction (infrastructure costs are pass-through, cannot be reduced without losing hyperscaler access). (5) PRECEDENT - Hyperscalers have history of partner program changes reducing partner economics: Azure moved to Partner Earned Credit model (2021-2022) reducing credits for some partners, AWS periodically adjusts APN (Partner Network) tier benefits and requirements, Google Cloud Partner Advantage restructuring (2023) modified credit structures. Credit compression is ONGOING not one-time. (6) IRREVERSIBILITY - Once hyperscalers reduce credits, reversal is unlikely (would require admitting error or competitive pressure from partners switching allegiance to other hyperscalers, but all three hyperscalers moving in same direction simultaneously). Margin pressure is PERMANENT downward ratchet. EVIDENCE: Stage 2.5 documents unilateral credit control, Stage 2.2 shows 10.4% margin vulnerability to credit changes.",
      "who_absorbs_margin_loss": "MSPs including Rackspace absorb 100% of margin loss because: (1) CANNOT PASS THROUGH TO CUSTOMERS - credit reduction is invisible to customers (no change in hyperscaler list rates customers pay), MSP attempting to raise management fees to offset credit loss triggers customer churn to hyperscaler-direct or competing MSPs per Stage 2.4 LOW lock-in, (2) CANNOT NEGOTIATE WITH HYPERSCALER - zero leverage due to revenue asymmetry, hyperscaler willing to lose MSP if MSP terminates partnership (immaterial revenue loss), (3) CANNOT EXIT HYPERSCALER - Public Cloud business model requires hyperscaler access, terminating partnership eliminates 61% of revenue, (4) NO ALTERNATIVE SOURCES - credit loss is pure margin compression with no cost offset opportunities (infrastructure costs are pass-through, cannot reduce delivery costs proportionally to credit loss without service degradation triggering churn). MSP TRAPPED: must absorb credit compression or exit Public Cloud business entirely. Small portion of margin loss may ultimately transfer to customers through imperceptible service quality degradation (support response time increases, fewer proactive optimizations) if MSP reduces delivery costs to partially offset margin loss, but majority is MSP profit destruction. EVIDENCE: Stage 2.5 value capture analysis, Stage 2.4 customer switching cost analysis shows inability to pass through pricing.",
      "touch_test_what_breaks": "IF HYPERSCALER CREDITS REDUCED 50% (from estimated 10% to 5% of infrastructure spend): Public Cloud gross margin falls from 10.4% to 5.4%. Gross profit declines from $175M to $91M (loss of $84M, 20-25% of company gross profit eliminated). Public Cloud segment operating margin falls from estimated 15-25% to near-zero or negative after overhead allocation - segment becomes loss-making. Rackspace must: (1) EXIT PUBLIC CLOUD - terminate 61% of revenue, triggers immediate financial distress (SG&A becomes 67% of remaining revenue, business unprofitable), (2) SHRINK TO MATCH ECONOMICS - reduce Public Cloud revenue from $1,683M to ~$800M to maintain minimum viable margin, requires eliminating 50% of customer base through price increases or service degradation, creates death spiral as remaining customers perceive failing provider and proactively exit, (3) ABSORB LOSSES - continue operating Public Cloud at loss, subsidizing segment with profits from Private Cloud/Government segments, unsustainable as burn rate exhausts remaining profit pools within 18-24 months. NO VIABLE RESPONSE exists. If credit compression occurs gradually (10% reduction annually over 3-5 years), creates slow-motion financial deterioration vs immediate crisis but outcome identical - Public Cloud becomes unviable. EXISTENTIAL THREAT from single partner decision. EVIDENCE: Calculated from Stage 2.2 gross margin data and Stage 2.5 partner credit economics.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 2.5: Partner credits estimated 5-15% constitute Rackspace infrastructure margin on Public Cloud",
        "Stage 2.5: 'Hyperscalers can modify partner programs, reducing Rackspace infrastructure margin'",
        "Stage 2.2: Public Cloud gross margin 10.4%",
        "Stage 2.5: Rackspace <0.5% of hyperscaler revenue, zero negotiating leverage",
        "Stage 2.4: Public Cloud LOW lock-in prevents passing credit reduction to customers",
        "Industry precedent: Azure Partner Earned Credit changes (2021-2022), AWS APN tier adjustments (periodic)",
        "Calculated impact: 50% credit reduction eliminates $84M gross profit, making Public Cloud unprofitable",
        "INFERENCE: Credit compression is structural threat based on hyperscaler strategic incentives and control asymmetry"
      ]
    },
    {
      "source_of_pressure": "VMware Licensing Cost Inflation (Broadcom Strategy)",
      "affected_role_or_segment": "Private Cloud Managed Services ($1,055M, 39% of revenue)",
      "why_pressure_is_structural": "VMware cost inflation is STRUCTURAL not cyclical because: (1) BROADCOM ACQUISITION STRATEGY - Broadcom's stated strategy for VMware acquisition is: maximize profit per customer vs maximize market share, accept 20-30% customer attrition while raising prices 200-300% on remaining 70-80%, focus on captive enterprise customers who cannot easily migrate. This is PERMANENT business model change, not temporary price adjustment. (2) CUSTOMER CAPTIVITY - VMware workloads cannot migrate to alternatives without 20-30% failure rate and multi-year timeline per Stage 2.5, creates captive customer base enabling aggressive pricing, Broadcom explicitly targeting customers with high switching costs (enterprises, MSPs with customer commitments), (3) ALTERNATIVE SUPPRESSION - lack of feature-comparable alternatives (OpenStack maturity gap, Hyper-V adoption gap) preserves VMware pricing power, Broadcom has no competitive pressure forcing price moderation, (4) PRECEDENT - Broadcom applied identical strategy to previous acquisitions (CA Technologies, Symantec Enterprise): acquire captive customer base, immediately raise prices 100-300%, shed unprofitable customers, maximize profit from remaining customers. VMware price increase fits established Broadcom playbook - PREDICTABLE not anomalous. (5) PAST PRICE SHOCK ALREADY ABSORBED - 200-300% increase already occurred 2023-2024, but Broadcom has NOT FINISHED: likely to implement annual price escalations of 10-20% going forward as baseline, may introduce additional bundling requirements forcing customers to buy products they don't need. Initial shock was FIRST MOVE not final state. (6) NO REVERSAL MECHANISM - Broadcom has no incentive to reverse course (price increase was highly profitable, any customer attrition was acceptable), competitive or regulatory pressure insufficient to force pricing change. Price inflation is PERMANENT new baseline. EVIDENCE: Stage 2.5 documents 200-300% VMware price increase, Stage 2.2 shows Private Cloud margin compression, industry reporting confirms Broadcom strategy pattern.",
      "who_absorbs_margin_loss": "Private Cloud MSPs including Rackspace absorb majority of margin loss because: (1) LIMITED CUSTOMER PASS-THROUGH - Private Cloud customers likely have multi-year contracts with fixed or limited escalation pricing per Stage 2.2, cannot immediately pass 200-300% cost increase to customers without contract breach, (2) CHURN ACCELERATION RISK - attempting to pass through 20-30% customer price increases to offset VMware costs triggers customer migration to public cloud alternatives (AWS Outposts, Azure Stack, hyperscaler-direct), Private Cloud customers already contemplating public cloud migration, VMware-driven price increase becomes migration trigger, (3) PARTIAL ABSORPTION REQUIRED - MSPs likely negotiate with customers for partial cost sharing (e.g., 10-15% customer price increase + 10-15% MSP margin compression), but MSPs absorb majority because customers have alternative leverage, (4) NO EXIT WITHOUT VALUE DESTRUCTION - MSPs cannot migrate customer base off VMware without 20-30% customer loss during multi-year migration per Stage 2.5, attempting to exit VMware destroys more value than absorbing cost increase. MARGIN TRANSFER: VMware price increase transferred estimated $100-210M annual value from Rackspace Private Cloud margins to VMware licensing costs per Stage 2.5. Private Cloud gross margin compressed from 38.6% to estimated 25-30%, operating margin from 30-40% to 15-25% (estimated), destroying $160-260M operating profit (representing 50-60% of segment profit, 25-40% of total company profit). VMware captured value that was MSP profit pool, customers experienced modest price increases or service quality degradation. EVIDENCE: Stage 2.5 quantifies $100-210M value transfer, Stage 2.2 documents Private Cloud margin under pressure.",
      "touch_test_what_breaks": "IF BROADCOM CONTINUES ANNUAL PRICE ESCALATIONS 10-20% (compounding on top of initial 200-300% increase): Private Cloud operating margin continues compressing from current estimated 15-25% toward single digits over 3-5 years. At 5-10% operating margin, Private Cloud contributes $50-105M operating profit vs current $315-420M (loss of $210-315M, representing 50-75% of total company operating income). Rackspace must: (1) EXIT PRIVATE CLOUD - walk away from 39% of revenue and 40-50% of operating income, remaining business (Public Cloud thin margin + Government compliant) insufficient to cover $709M SG&A, company becomes loss-making or marginally profitable, (2) PASS COSTS TO CUSTOMERS - Private Cloud price increases 30-50% cumulatively over 3-5 years trigger customer migration to public cloud, Private Cloud revenue decline accelerates from -13% YoY to -20-30% YoY, death spiral as remaining customers bear higher per-customer overhead, (3) MIGRATE TO ALTERNATIVES - attempt to migrate customer base from VMware to OpenStack/Hyper-V, 20-30% customer loss during migration plus operational disruption plus multi-year distraction from retention/sales, likely accelerates decline faster than absorbing VMware costs. NO PATH EXISTS to maintain Private Cloud viability under continued VMware cost inflation - segment becomes terminal. Combined with Public Cloud commoditization (10.4% margin) and email death spiral (706% price increase), Rackspace left with only Government segment as viable business ($270-410M revenue insufficient to support $709M SG&A + delivery costs). BUSINESS MODEL COLLAPSE from vendor pricing power. EVIDENCE: Calculated from Stage 2.4 profit concentration and Stage 2.5 VMware cost analysis.",
      "claim_type": "FACT",
      "evidence_sources": [
        "Stage 2.5: 'Broadcom acquired VMware (Nov 2023) and IMMEDIATELY raised prices 200-300%' - documented fact",
        "Stage 2.5: Estimated $100-210M value transfer from Rackspace to VMware from price increase",
        "Stage 2.2: Private Cloud gross margin 38.6% compressed to estimated 25-30% from VMware costs",
        "Stage 2.4: Private Cloud contributes 40-50% of total operating income",
        "Stage 2.5: 'Cannot migrate customers off VMware without multi-year migrations with 20-30% failure rate'",
        "Industry reporting: Broadcom strategy pattern across acquisitions (CA Technologies, Symantec) - acquire, raise prices, shed customers",
        "Calculated impact: Continued cost inflation eliminates $210-315M operating profit, making business unviable"
      ]
    },
    {
      "source_of_pressure": "Commoditization of Managed Services (Market-Wide Trend)",
      "affected_role_or_segment": "All segments, primarily Public Cloud ($1,683M) and Mid-Market customers",
      "why_pressure_is_structural": "Managed services commoditization is STRUCTURAL not cyclical because: (1) TECHNOLOGY MATURATION - Cloud platforms have matured from complex early-stage technology (2010-2015) requiring specialized expertise to standardized commodity (2020-present) with: comprehensive documentation, extensive training/certification programs, user-friendly management consoles, automated deployment/scaling/healing. Technology maturation reduces MSP differentiation from 'expert guidance through complex technology' to 'incremental convenience over doing it yourself'. (2) CUSTOMER EXPERTISE INCREASE - Enterprise customers have built internal cloud teams over 2015-2025 period: hiring cloud-certified engineers, developing internal automation and tooling, accumulating institutional knowledge. Customers increasingly capable of managing cloud directly, question value of paying MSP 10-15% markup for services they can perform internally. (3) TOOLING DEMOCRATIZATION - Third-party monitoring, management, security, and optimization tools (Datadog, New Relic, Terraform, Kubernetes) available as low-cost SaaS, provide capabilities previously exclusive to MSPs at <1% of infrastructure cost. Customers can assemble tooling stack cheaper than MSP markup. (4) HYPERSCALER DIRECT COMPETITION - AWS Managed Services, Azure Managed Services, Google Cloud Managed Services offer direct alternative to MSP model: same hyperscaler infrastructure + hyperscaler-provided management at lower cost (eliminate MSP markup), integrated deeply with platform (no third-party integration friction), backed by hyperscaler brand and scale. Hyperscalers actively marketing direct managed services to MSP customers, subsidizing service costs to win direct relationships. (5) PRICE TRANSPARENCY - Cloud cost management tools (CloudHealth, Cloudability, native hyperscaler cost tools) make MSP markup visible to customers, customers can calculate exact MSP margin (see that $100 infrastructure spend includes $10-15 MSP fee), transparency increases price sensitivity and competitive pressure. (6) BUSINESS MODEL OBSOLESCENCE - MSP value proposition ('we manage complex cloud for you') becomes obsolete as cloud becomes standardized utility, similar to managed hosting obsolescence in 2000s as web hosting became commodity. Managed services following same commoditization trajectory as previous infrastructure services. EVIDENCE: Stage 2.2 Public Cloud 10.4% margin reflects commodity economics, Stage 2.5 documents hyperscaler competition.",
      "who_absorbs_margin_loss": "MSPs including Rackspace absorb 100% of commoditization margin pressure because: (1) CANNOT MAINTAIN DIFFERENTIATION PRICING - customers unwilling to pay premium for commoditized service regardless of 'Fanatical Support' brand or historical relationships, must price competitively with hyperscaler-direct and competing MSPs or lose customers, (2) CANNOT REDUCE COSTS PROPORTIONALLY - managed services require: delivery personnel (cloud engineers, support teams), tooling and automation infrastructure, sales and account management. These costs are largely FIXED or SEMI-FIXED, cannot scale down proportionally to margin compression without service degradation triggering churn. MSP operating leverage works in reverse - margin compression flows directly to profit compression, (3) NO CUSTOMER COMPENSATION - customers benefit from commoditization through: lower pricing from MSPs competing for business, ability to switch to cheaper alternatives (hyperscaler-direct savings 10-15%), or insource management with better tools (eliminate MSP spend entirely). Customer savings come from MSP profit destruction. (4) NO VALUE CAPTURE BY NEW ENTRANTS - unlike some disruptions where new entrants capture value lost by incumbents, managed services commoditization transfers value to CUSTOMERS and HYPERSCALERS, not to other MSPs. Entire MSP profit pool shrinking (estimated 40-60% margin compression industry-wide 2015-2025: from 15-25% operating margins to current 5-15%), not redistributing. VALUE DESTRUCTION: Rackspace estimated $100-200M annual profit lost to commoditization 2015-2025 period (Public Cloud + Mid-Market segments declining from estimated 20-30% operating margins historically to current 15-25% Mid-Market and 10-15% Public Cloud per Stage 2.4 estimates). EVIDENCE: Stage 2.2 margin data, Stage 2.4 churn rates demonstrate customer willingness to switch from premium providers.",
      "touch_test_what_breaks": "IF COMMODITIZATION CONTINUES COMPRESSING MSP MARGINS 20-30% OVER NEXT 3-5 YEARS: Rackspace Public Cloud operating margin falls from estimated 15-25% currently to 5-10%, Mid-Market margins fall from 15-25% to 8-12%. Company-wide operating margin (currently estimated 15-20% from Stage 2.4 segment analysis) falls to 8-12%. With $2,737M revenue, operating income falls from $410-550M currently to $220-330M. SG&A $709M (25.9% of revenue per Stage 2.2) consumes larger portion of gross profit, requires 35-40% gross margins to maintain current operating income but commoditization prevents gross margin expansion (in fact driving gross margin compression). MARGIN-COST SCISSORS: Gross margins compressing (commoditization) while SG&A ratio increasing (revenue decline + fixed cost structure) creates profitability squeeze - margins falling faster than revenue. Company operating margin approaches zero over 3-5 years unless: (1) RADICAL COST REDUCTION - cut SG&A 40-50% ($280-355M), likely requires 40-50% headcount reduction (from 5,100 to 2,500-3,000 FTEs), may accelerate revenue decline through service quality degradation, (2) EXIT LOW-MARGIN SEGMENTS - terminate Public Cloud and Mid-Market segments (70% of revenue), retain only high-margin Government and Large Enterprise Private Cloud, shrink to $800-1,200M revenue company, (3) SELL BUSINESS - M&A as only exit preserving some equity value before margins hit zero. COMMODITIZATION DEATH SPIRAL where margin compression makes business unviable at any revenue level. EVIDENCE: Calculated from Stage 2.2 cost structure and current margin estimates.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 2.2: Public Cloud gross margin 10.4% reflects commodity pricing",
        "Stage 2.5: Hyperscaler managed services (AWS MS, Azure MS) compete directly with MSP model",
        "Stage 2.4: Mid-market estimated 15-25% annual churn indicates customer willingness to switch providers",
        "Stage 2.2: SG&A $709M (25.9% of revenue) creates fixed cost burden during margin compression",
        "Industry trend: MSP operating margins compressed from 20-30% (2010s) to 10-20% (2020s) per industry surveys",
        "INFERENCE: Commoditization is structural based on technology maturation, customer capability building, hyperscaler competition",
        "Calculated impact: Continued commoditization eliminates $180-220M operating income over 3-5 years"
      ]
    },
    {
      "source_of_pressure": "Scale Economics Requirement vs Structural Fragmentation Constraint",
      "affected_role_or_segment": "All segments - company-wide overhead pressure",
      "why_pressure_is_structural": "Overhead margin pressure is STRUCTURAL not cyclical because: (1) MINIMUM EFFICIENT SCALE - MSP business model requires $4-5B revenue to efficiently amortize corporate overhead at healthy 15-18% SG&A ratio per Stage 2.6, Rackspace at $2.7B revenue operates at 25.9% SG&A (7-11 percentage points above efficient), would need 48-85% revenue growth to achieve scale economics, (2) STRUCTURAL FRAGMENTATION - Multi-entity operations CANNOT consolidate per Stage 1: Government requires isolated entity (FedRAMP tied to Rackspace Government Solutions, cannot merge with commercial operations), UK Sovereign requires isolated entity (data sovereignty permanently prohibits integration with non-UK operations), Jurisdictional entities required for compliance and local operations. Fragmentation prevents economies of scale - must maintain duplicate: sales organizations per segment/entity, finance/HR/legal per entity, operations teams per isolated infrastructure, compliance overhead per authorization. (3) GROWTH IMPOSSIBILITY - Cannot grow to $4-5B to achieve scale because: 21% net revenue leakage per Stage 2.1 (losing customers faster than acquiring), all revenue engines declining or low-growth (Private Cloud -13% YoY, Public Cloud commoditized with 15-25% churn, Email death spiral, Government and UK Sovereign mature/constrained markets), would need to REVERSE current decline and THEN grow 80% from current base - mathematically implausible. (4) COST REDUCTION LIMITS - Cannot cut SG&A proportionally to revenue decline because: multi-entity structure requires minimum overhead per entity regardless of scale (cannot eliminate entity-level finance/legal/compliance), reduction beyond current $709M triggers operational breakage (systems degradation, compliance risk, talent exodus), Stage 2.2 documents only 12% headcount reduction vs 7% revenue decline indicating limited cost flexibility. (5) IRREVERSIBILITY - Cannot unwind structural fragmentation without: exiting Government segment (foreign buyer loses FedRAMP per Stage 1.5, domestic buyer faces re-authorization risk), exiting UK Sovereign (destroy $5-15M investment in isolated infrastructure), violating compliance requirements (immediate authorization loss). Once fragmented, PERMANENT fragmentation. (6) COMPETITIVE DISADVANTAGE - Competitors at scale (IBM multi-cloud $20B+, hyperscalers $35B+ each) enjoy 15-20% SG&A ratios, can price 5-10% below Rackspace while maintaining superior margins, or match Rackspace pricing while investing more in product/sales/marketing. Rackspace CANNOT compete on cost structure. EVIDENCE: Stage 2.6 identifies scale vs fragmentation as systemic contradiction, Stage 2.2 quantifies 25.9% SG&A burden.",
      "who_absorbs_margin_loss": "Rackspace absorbs 100% of overhead margin pressure because: (1) CANNOT PASS TO CUSTOMERS - customers pay for services received, not for MSP internal efficiency problems, attempting to raise prices to fund overhead triggers customer churn to more efficient competitors, (2) CANNOT OFFSET WITH REVENUE GROWTH - revenue declining (-7% YoY per Stage 2.1) not growing, net leakage means overhead ratio INCREASING not decreasing (denominator shrinking while numerator fixed), creates negative operating leverage, (3) CANNOT CONSOLIDATE ENTITIES - legally and regulatorily blocked from eliminating fragmentation per Stage 1.5, (4) LIMITED COST REDUCTION - already operating lean compared to historical levels (headcount down 12% per Stage 2.2), further cuts risk operational collapse. MARGIN EROSION MECHANISM: Every 1% revenue decline with flat SG&A increases SG&A ratio by ~0.26% (from 25.9% base). At -7% annual revenue decline, SG&A ratio increases to 27.7% in year one, 29.6% in year two, 31.7% in year three. Operating margin compresses proportionally - if gross margin stays flat at 35%, operating margin falls from 9.1% (current) to 7.3% to 5.4% to 3.3% over three years. DEATH SPIRAL from overhead burden on declining revenue base. No external party absorbs this pressure - it's pure profit destruction from scale-fragmentation contradiction. EVIDENCE: Calculated from Stage 2.2 SG&A data and Stage 2.1 revenue decline trajectory.",
      "touch_test_what_breaks": "IF REVENUE DECLINE CONTINUES -7% ANNUALLY WHILE SG&A STAYS FLAT: Year 1 revenue $2,546M with $709M SG&A (27.8%), Year 2 revenue $2,368M with $709M SG&A (29.9%), Year 3 revenue $2,202M with $709M SG&A (32.2%). Assuming 35% gross margin (Stage 2.2 company average): Year 1 gross profit $891M - $709M SG&A = $182M operating income (7.1% margin), Year 2 gross profit $829M - $709M SG&A = $120M operating income (5.1% margin), Year 3 gross profit $771M - $709M SG&A = $62M operating income (2.8% margin). Three-year trajectory from current ~$410M operating income to $62M (85% profit decline) WITHOUT any margin compression from other sources (hyperscaler credits, VMware costs, commoditization). ADD margin pressures from other sources and operating income approaches ZERO within 36 months. Company must: (1) CUT SG&A 30-40% ($210-280M) requiring massive headcount reduction and entity consolidation (impossible per fragmentation constraints), (2) STOP REVENUE DECLINE through retention improvement (impossible per 21% net leakage and low lock-in segments), (3) SELL BEFORE PROFIT HITS ZERO (2-3 year window to find buyer). NO VIABLE OPERATIONAL PATH - only exit is sale. OVERHEAD STRUCTURE GUARANTEES BUSINESS FAILURE under revenue decline + fragmentation combination. EVIDENCE: Calculated from Stage 2.2 overhead data and Stage 2.1 decline trajectory.",
      "claim_type": "FACT",
      "evidence_sources": [
        "Stage 2.6: Scale economics require $4-5B revenue for healthy 15-18% SG&A ratio, Rackspace at $2.7B with 25.9% SG&A",
        "Stage 2.2: SG&A $709M (25.9% of revenue), flat despite 7% revenue decline",
        "Stage 2.1: Revenue declining 7% YoY with 21% net leakage",
        "Stage 1.5: Government and UK Sovereign fragmentation cannot be consolidated (compliance requirements)",
        "Stage 2.6: 'Scale imperative vs fragmentation constraint' identified as systemic contradiction with no resolution",
        "Calculated impact: -7% annual revenue decline increases SG&A ratio from 25.9% to 32.2% over 3 years, operating income falls from ~$410M to $62M (85% decline)"
      ]
    }
  ]
}
