{
  "sub_stage": "3.1",
  "uncertainty_register": [
    {
      "unknown": "Exact terms of hyperscaler partner credit agreements (rates, duration, modification rights, volume commitments)",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Understanding credit agreement terms determines: (1) Probability and timeline of credit compression (are reductions imminent or speculative?), (2) Rackspace's ability to forecast Public Cloud profitability (locked rates vs at-risk rates), (3) Existence of any contractual protections against adverse changes. Without knowing terms, cannot assess whether Public Cloud margin compression is CERTAIN NEAR-TERM vs POSSIBLE MEDIUM-TERM threat. Credit agreement terms could shift margin compression from 'inevitable within 12 months' to 'likely over 3-5 years' or vice versa - material difference to valuation and viability assessment.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED. Partner agreements with AWS, Azure, and Google are confidential commercial contracts not disclosed publicly. Would require: (1) Rackspace management provision of actual partnership contracts (likely requires NDA), (2) Direct questions to hyperscaler partner managers about program stability and planned changes, (3) Industry channel checks with other MSPs about their credit terms and recent changes (competitive intelligence). From external position with public data only, this uncertainty is UNRESOLVABLE."
    },
    {
      "unknown": "Timeline and magnitude of potential future VMware price increases beyond the initial 200-300% shock",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL - Broadcom's future pricing behavior determines Private Cloud segment viability: (1) If VMware implements 10-20% annual escalations compounding on initial increase, Private Cloud becomes unviable within 3-5 years per touch test analysis, (2) If initial 200-300% is final state with stable pricing afterward, Private Cloud remains marginally viable though compressed, (3) If Broadcom moderates pricing in response to customer attrition (unlikely per Broadcom strategy but possible), Private Cloud pressure eases. Difference between these scenarios is $150-250M operating income preservation vs destruction - CRITICAL to business viability. Without knowing Broadcom's multi-year pricing roadmap, cannot forecast whether Private Cloud death is slow (5-7 years) vs fast (2-3 years).",
      "what_would_reduce_uncertainty": "PARTIALLY KNOWABLE through: (1) Broadcom earnings calls and investor presentations where management discusses VMware strategy and customer pricing trajectory, (2) Industry reporting from VMware customer base (surveys, interviews with enterprises about renewal pricing), (3) Consulting firm reports analyzing Broadcom's historical acquisition patterns to predict VMware trajectory, (4) Direct outreach to Broadcom VMware sales representatives about expected pricing evolution (unlikely to receive honest answer but may provide directional guidance). MANAGEMENT ACCESS to Rackspace VMware relationship managers would provide best intelligence on Broadcom signals and pricing expectations. Some uncertainty reducible with research, residual uncertainty persists."
    },
    {
      "unknown": "Rate of customer cloud expertise maturation reducing MSP dependency - how fast is customer self-service capability increasing?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Customer expertise growth rate determines MSP value proposition erosion speed: (1) If enterprises rapidly building internal cloud teams (50%+ of mid-market building cloud COEs over next 3 years), MSP demand collapses accelerating commoditization, (2) If customer expertise growth is slow (cloud skills shortage persists, enterprises continue outsourcing), MSP value proposition persists longer providing more time to adapt. Difference is 3-5 year vs 7-10 year value proposition lifespan - material to investment horizon and exit timing. Faster expertise growth accelerates need for Rackspace exit/pivot; slower growth provides runway for transformation attempts.",
      "what_would_reduce_uncertainty": "RESEARCH REDUCIBLE. Can investigate through: (1) Enterprise IT hiring trends and job postings for cloud engineers (growth rate of internal cloud capability building), (2) Cloud certification trends (AWS/Azure/Google certification volumes as proxy for customer expertise growth), (3) Survey data from enterprises on cloud strategy (in-house vs outsourced roadmaps), (4) MSP customer interviews about future outsourcing intentions, (5) Analyst reports on enterprise cloud operating models. Combination of labor market data, certification trends, and survey data would substantially reduce uncertainty about expertise maturation rate."
    },
    {
      "unknown": "Hyperscaler strategic intent toward MSP channel - increase, maintain, or phase out partner programs?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL - Hyperscaler strategic direction determines MSP channel viability: (1) If hyperscalers strategically committed to partner channel as permanent go-to-market (believe channel provides unique value), MSP model has structural stability despite margin pressure, (2) If hyperscalers view channel as transitional (tolerate partners while building direct capabilities, plan to eventually disintermediate), MSP model is in managed decline with finite lifespan, (3) If hyperscalers are ambivalent (no strong strategic view, pragmatic about channel economics), MSP viability depends on demonstrating continued value. Difference between 'strategic channel' vs 'transitional channel' is 10+ year viability vs 3-5 year sunset - CRITICAL distinction. Current evidence (hyperscaler direct managed services expansion per Stage 2.5) suggests 'transitional' but not conclusive.",
      "what_would_reduce_uncertainty": "PARTIALLY KNOWABLE through: (1) Hyperscaler earnings calls and partner event keynotes for strategic messaging about channel importance, (2) Hyperscaler partner program investment trends (expanding resources into partner enablement or pulling back?), (3) Interviews with hyperscaler channel leaders (unlikely to admit disintermediation strategy but may signal through resource allocation), (4) Analysis of hyperscaler direct vs channel sales mix trends over time (channel losing share = disintermediation underway), (5) Observation of hyperscaler competitive behavior (are they actively soliciting MSP customers or maintaining channel discipline?). Combination of public statements, investment patterns, and behavioral observation would reduce uncertainty but hyperscalers unlikely to explicitly declare disintermediation strategy."
    },
    {
      "unknown": "Rackspace customer concentration within hyperscaler platforms - is Public Cloud revenue 60% AWS, 25% Azure, 15% Google or different distribution?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Customer concentration on single hyperscaler determines: (1) Single-hyperscaler dependency risk (if 70%+ on AWS, AWS credit reduction or partnership termination is existential), (2) Multi-cloud management value proposition (if customers are truly multi-cloud, Rackspace has differentiation; if customers are single-cloud, multi-cloud value is fiction), (3) Negotiating leverage with hyperscalers (balanced distribution provides options, concentrated distribution increases dependency). Without knowing distribution, cannot assess whether Rackspace has partial hedge through diversification or maximum exposure through concentration. Affects valuation discount for partner dependency risk.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED. Customer distribution across hyperscalers is internal operational data not publicly disclosed. Would require: (1) Rackspace management provision of Public Cloud revenue breakdown by hyperscaler, (2) Customer-level data on multi-cloud vs single-cloud deployments, (3) Growth trends by hyperscaler to understand concentration evolution. From external position, UNRESOLVABLE without management data. Could attempt industry benchmarks (typical MSP distribution ~50-60% AWS, 30-40% Azure, 10% Google) but Rackspace-specific distribution could differ materially."
    },
    {
      "unknown": "Competitive MSP pricing and margin structures - are Rackspace's 10.4% Public Cloud margins competitive, below-market, or above-market?",
      "type": "UNKNOWN",
      "decision_impact": "MODERATE - Knowing competitive margin positioning determines: (1) Whether Rackspace has pricing room (if competitors at 12-15% margins, Rackspace underpricing; if competitors at 8-10% margins, Rackspace at market), (2) Whether margin compression is Rackspace-specific (operational inefficiency) or industry-wide (structural), (3) Whether Rackspace can stabilize margins at current levels or faces continued compression to match lower-cost competitors. Understanding competitive positioning affects assessment of whether Rackspace margins are 'new normal' vs 'still compressing'. However, Stage 3.1 analysis already established structural forces driving industry-wide compression, so competitive margin data is confirmatory rather than decisional.",
      "what_would_reduce_uncertainty": "PARTIALLY KNOWABLE through: (1) Public MSP peer financial disclosures (limited - most MSPs private or divisions of larger companies), (2) Industry surveys and consulting firm reports on MSP economics, (3) Customer RFP responses showing competitive MSP pricing (Rackspace would have competitive intelligence from lost deals), (4) Channel partner feedback on relative MSP pricing and margins. Combination of peer financials and industry intelligence would provide directional guidance on Rackspace's competitive position. MANAGEMENT ACCESS to Rackspace competitive intelligence would provide best visibility."
    },
    {
      "unknown": "Large Enterprise customer concentration - are top 10 customers 10%, 15%, or 20%+ of revenue? What is concentration in Government segment?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Customer concentration determines: (1) Single-customer risk magnitude (if top customer is 5%+ of revenue, loss is material event; if top customer is 1-2% of revenue, loss is manageable), (2) Negotiating leverage asymmetry (highly concentrated customer base has disproportionate power), (3) Churn impact sensitivity (loss of top 10 customers could eliminate 15-25% of revenue per Stage 2.4 estimates, but uncertainty range is wide). Without knowing actual concentration, cannot quantify customer dependency risk precisely. Affects assessment of revenue volatility and tail risk.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS STRONGLY PREFERRED. Customer concentration data is internal operational metric, though public companies must disclose any customer >10% of revenue (Rackspace has disclosed none, suggesting top customer <10%). Would require: (1) Rackspace management provision of customer concentration analysis (top 10, top 20 customers as % of revenue), (2) Segment-level concentration (Government, Private Cloud concentration may differ from company average), (3) Customer tenure and contract status for top accounts. Without management data, can only use Stage 2.4 estimates (top 10-15 customers 15-25% of revenue) which have wide uncertainty range."
    }
  ]
}
