{
  "sub_stage": "2.4",
  "uncertainty_register": [
    {
      "unknown": "ACTUAL CUSTOMER COUNT AND CONCENTRATION BY SEGMENT: Total customers per segment, customer size distribution (contract value histogram), top 10/50/100 customer revenue concentration %, identification of largest customers by name and contract value, customer tenure distribution (how many customers <1 year, 1-3 years, 3-5 years, 5+ years).",
      "type": "UNKNOWN",
      "decision_impact": "CUSTOMER CONCENTRATION RISK QUANTIFICATION: If Private Cloud top 10 customers represent 35%+ of segment revenue ($210M+), loss of 2-3 customers is MATERIAL EVENT threatening segment viability. If concentration is <20%, risk is distributed. ACQUIRER DILIGENCE: Any acquirer will demand customer-by-customer analysis - inability to provide creates deal friction. VALUATION: High concentration = higher risk premium = lower valuation multiple. OPERATIONAL PRIORITY: If top 10 customers identified, can prioritize retention investments (dedicated account management, service improvements, pricing protection) to protect concentrated revenue. AFFECTS: Valuation discount magnitude (10-20% if high concentration), acquisition feasibility (acquirers may demand top customer retention commitments), retention strategy design.",
      "what_would_reduce_uncertainty": "ACCESS: Request from management: (1) Customer list by segment with contract value and tenure, (2) Revenue concentration analysis (top 10/50/100 customer revenue % by segment), (3) Customer size distribution histogram, (4) Identification of top 25 customers across all segments by revenue. VALIDATE: Compare concentration to industry benchmarks (typical MSP top 10 customers 15-30% of revenue). PRIORITIZE: Focus retention efforts on identified high-value customers."
    },
    {
      "unknown": "ACTUAL GROSS AND NET CHURN RATES BY SEGMENT: Monthly/annual gross churn % (customers lost) and $ (revenue lost), monthly/annual net churn % (gross churn minus upsells/expansions), cohort retention curves (Year 1/2/3/5 retention % by acquisition cohort), churn by customer size (are large customers churning at same rate as small?), churn drivers by segment (top 10 reasons from exit interviews).",
      "type": "UNKNOWN",
      "decision_impact": "BUSINESS MODEL VIABILITY ASSESSMENT: If Mid-Market gross churn is 25%+ annually ($240M+ annual revenue loss), segment requires $240M+ new bookings just to maintain revenue - MAJORITY of sales capacity consumed replacing churned customers. If SMB churn is 40%+ ($80M+ annual loss), segment is in DEATH SPIRAL and should be exited. Conversely, if Private Cloud churn is <5% ($30M annual loss), segment is STABLE cash generator. Churn magnitude determines: (1) Sales capacity allocation (how much capacity to replacement bookings vs growth), (2) Retention investment ROI (if churn 5%, $1M retention investment saves $137M*5%=$7M revenue; if churn 25%, saves $34M revenue - 5X ROI difference), (3) Segment strategic priority (defend stable segments, triage dying segments). AFFECTS: Sales strategy, retention program investment, segment exit decisions, valuation (high churn segments have low terminal value).",
      "what_would_reduce_uncertainty": "ACCESS: Request from management: (1) Monthly gross churn % and $ by segment (2022-2024), (2) Monthly net churn % by segment (including upsells/expansions), (3) Cohort analysis (for customers acquired Q1 2020, Q1 2021, Q1 2022, Q1 2023, what % of customers and revenue retained after 12/24/36 months?), (4) Churn by customer size bucket (<$50K, $50-250K, $250K-1M, $1M-5M, $5M+ annual contract value), (5) Churn exit interview synthesis (top 10 reasons by segment). BENCHMARK: Compare to industry standards (MSPs 10-20% typical, cloud service providers 5-15% typical). IDENTIFY: Addressable vs structural churn drivers."
    },
    {
      "unknown": "CONTRACT TERMS DISTRIBUTION BY SEGMENT: % of customers/revenue on pure month-to-month vs annual committed spend vs multi-year contracts, distribution of committed spend levels ($0, $100K, $500K, $1M, $5M+ annual commits), early termination fee prevalence and magnitude, average/median termination notice period, renewal rate % by contract type.",
      "type": "UNKNOWN",
      "decision_impact": "CONTRACTUAL PROTECTION QUANTIFICATION: If 80% of revenue is pure month-to-month (no committed spend), contractual lock-in is ZERO and churn barrier is ONLY operational/technical friction. If 40% of revenue has committed spend agreements with meaningful early termination fees, provides modest churn buffer. Contract mix affects: (1) Revenue predictability (committed spend provides forward visibility), (2) Churn modeling (customers with committed spend churn at lower rates, those with ETFs have economic barrier), (3) Pricing strategy (can offer committed spend discounts to improve retention). AFFECTS: Revenue forecasting confidence, retention strategy design (push committed spend adoption), valuation (contracted revenue has higher multiple than pure month-to-month).",
      "what_would_reduce_uncertainty": "ACCESS: Request from management: (1) Revenue distribution by contract type (pure month-to-month %, annual committed spend %, multi-year contracts %), (2) Committed spend level distribution ($0, <$100K, $100K-500K, $500K-1M, $1M-5M, $5M+ buckets), (3) Early termination fee prevalence (% of contracts, average fee as % of remaining commitment), (4) Churn rate comparison: month-to-month customers vs committed spend customers vs multi-year customers. IDENTIFY: Opportunity to increase committed spend adoption (offer 10-15% discount for annual commits to improve retention)."
    },
    {
      "unknown": "CUSTOMER SATISFACTION, NPS, AND RETENTION INDICATORS BY SEGMENT: Net Promoter Score by segment, customer satisfaction scores (CSAT) by segment, customer effort scores, support ticket volume and resolution time by segment, customer escalation rates, customer reference-ability (% willing to provide reference), upsell/expansion rate % by segment, contraction rate % (customers reducing spend).",
      "type": "UNKNOWN",
      "decision_impact": "CHURN LEADING INDICATORS AND SERVICE QUALITY ASSESSMENT: NPS and CSAT are LEADING INDICATORS of churn (typically 6-12 months lag). If Private Cloud NPS is <20 (detractor-heavy), HIGH CHURN is coming even if current churn is low (customers staying due to switching costs but dissatisfied). If Government NPS is 50+ (promoter-heavy), churn risk is LOWER even if switching costs decrease. Customer satisfaction by segment determines: (1) Retention investment priority (fix service issues in dissatisfied segments before investing in marketing), (2) Churn acceleration risk (dissatisfied customers churn at 2-3X rate of satisfied customers), (3) Upsell potential (satisfied customers expand, dissatisfied customers contract then churn), (4) 'Fanatical Support' value proposition validation (if NPS is low, brand promise not delivered). AFFECTS: Retention program design (service improvement vs sales/marketing), churn forecast confidence, brand value assessment.",
      "what_would_reduce_uncertainty": "ACCESS: Request from management: (1) Quarterly NPS by segment (2022-2024 trend), (2) Monthly CSAT scores by segment, (3) Support ticket metrics: volume, severity distribution, time-to-resolution, escalation rate by segment, (4) Customer expansion/contraction analysis: % of customers increasing spend vs decreasing spend vs flat, $ magnitude of expansion vs contraction, (5) Customer reference program participation (% of customers willing to provide references = proxy for satisfaction). BENCHMARK: Compare NPS to competitors (AWS, Azure, other MSPs) and identify satisfaction gaps. IDENTIFY: Correlation between satisfaction metrics and subsequent churn (validate NPS as leading indicator)."
    },
    {
      "unknown": "CROSS-ENTITY AND MULTI-SEGMENT CUSTOMER OVERLAP: # and % of customers present in multiple Rackspace segments (e.g., customer using both Private Cloud + Public Cloud + Professional Services), revenue from multi-segment customers, # and % of customers spanning multiple Rackspace entities (US + Government, US + UK, etc.), coordination quality for cross-entity/cross-segment customers (single account manager vs fragmented), satisfaction comparison (cross-entity customers vs single-entity).",
      "type": "UNKNOWN",
      "decision_impact": "UPSELL OPPORTUNITY AND FRAGMENTATION IMPACT: If 30% of customers use multiple segments, UPSELL potential is DEMONSTRATED (customers comfortable buying multiple services). If <10% multi-segment, either (1) segments serve different customer needs (no natural upsell path), OR (2) organizational silos prevent cross-selling. Cross-entity customers likely LARGEST, HIGHEST-VALUE (enterprises with government and commercial operations, or global presence) - if 5-10% of customers span entities but represent 20-30% of revenue, concentration risk is HIGHER. Fragmentation impact: If cross-entity customers have LOWER satisfaction or HIGHER churn than single-entity, proves fragmentation is visible customer friction (not just internal cost issue). AFFECTS: Sales strategy (invest in cross-sell programs), organizational design priorities (reduce fragmentation if it affects customers), retention strategy (cross-entity customers may need dedicated coordination).",
      "what_would_reduce_uncertainty": "ACCESS: Request from management: (1) Customer segment overlap analysis: % of customers using 1, 2, 3, 4+ segments, revenue distribution by segment combination, (2) Cross-entity customer mapping: list of customers present in multiple Rackspace entities, revenue by customer by entity, (3) Satisfaction and churn comparison: cross-segment customers vs single-segment, cross-entity customers vs single-entity, (4) Organizational coordination mechanisms: do cross-entity customers have single global account manager or separate teams per entity? IDENTIFY: High-value multi-entity customers requiring dedicated retention focus, organizational friction points visible to customers."
    }
  ]
}
