{
  "sub_stage": "2.4",
  "unknowns_requests": [
    {
      "information_needed": "Customer concentration and identification analysis by segment: Total customer count, customer size distribution (contract value buckets: <$50K, $50-250K, $250K-1M, $1M-5M, $5M+), revenue concentration in top 10/25/50/100 customers by segment, identification of top 25 customers overall (name, segment, annual contract value, tenure, key decision makers), customer tenure distribution (customers by acquisition year cohort)",
      "why_needed": "EXISTENTIAL CUSTOMER RISK QUANTIFICATION: Hypothesis testing shows operating income is 55-75% dependent on two segments (Large Enterprise Private Cloud, Government). If top 10-15 customers across these segments represent 30-50% of segment profit, loss of 3-5 customers could eliminate $80-200M operating income (40-80% of total OI estimate), rendering business unprofitable. CONCENTRATION MAGNITUDE determines: (1) Valuation discount (high concentration = 10-20% valuation haircut), (2) Retention investment priority (identify high-value customers requiring dedicated account management), (3) Acquisition feasibility (acquirers demand top customer retention commitments if concentration high), (4) Single-customer dependency risk (if any customer >5% of revenue, creates material single-customer risk). Without customer-level data, cannot assess existential dependency on small number of accounts.",
      "request_to": "Management / Chief Revenue Officer OR CFO",
      "format": "Excel files: (1) Customer master list by segment: Customer name, Segment, Annual contract value (trailing 12 months), Tenure (customer since date), Account owner, Key customer decision makers (CIO, CTO names), (2) Revenue concentration analysis by segment: Top 10 customers (% of segment revenue), Top 25 customers (% of segment revenue), Top 50 customers (% of segment revenue), Top 100 customers (% of segment revenue), (3) Customer size distribution: Count of customers and revenue in each size bucket (<$50K, $50-250K, $250K-1M, $1M-5M, $5M+), (4) Customer tenure distribution: Count of customers and revenue by acquisition cohort (2019, 2020, 2021, 2022, 2023, 2024), (5) Top 25 customers overall: Name, Segment, Annual contract value, Tenure, Products/services used, Account team, Notes on strategic importance or risk factors"
    },
    {
      "information_needed": "Actual gross and net churn rates by segment with cohort retention analysis: Monthly gross churn % (customers) and $ (revenue) by segment (2022-2024), Monthly net churn % (gross churn minus expansions/upsells) by segment, Cohort retention curves (for customers acquired Q1 2020, Q1 2021, Q1 2022, Q1 2023, what % of customers and revenue retained after 6/12/24/36 months?), Churn by customer size (do large customers churn at same rate as small?), Churn exit interview synthesis (top 10 reasons by segment from churned customer interviews)",
      "why_needed": "BUSINESS MODEL VIABILITY ASSESSMENT: Implied 21% net leakage from revenue/bookings math (Stage 2.1: 14% bookings growth - 7% revenue decline) suggests HIGH CHURN, but exact magnitude is unknown. If Mid-Market churn is 25%+ annually ($240M+ loss), requires $240M+ new bookings just to maintain segment revenue - MAJORITY of sales capacity consumed with replacement bookings, making growth impossible. If SMB churn is 40%+ ($80M+ loss), segment is in DEATH SPIRAL and should be strategically exited. Conversely, if Private Cloud churn is <5% ($30M loss), segment is stable cash generator justifying focused retention investment. Churn magnitude by segment determines: (1) Sales capacity allocation (replacement vs growth bookings), (2) Retention investment ROI calculation (if churn 5%, $1M retention spend saves $7M revenue; if churn 25%, saves $34M revenue - 5X difference), (3) Segment strategic priority (defend stable segments, exit dying segments), (4) Cohort retention curves predict lifetime value and CAC payback periods. Without segment-specific churn data, cannot distinguish VIABLE segments (worth defending) from DYING segments (exit to stop bleeding).",
      "request_to": "Management / Chief Revenue Officer OR VP Customer Success",
      "format": "Excel files: (1) Monthly churn analysis by segment (2022-2024): For each month and segment: Gross churn % (customers lost / beginning customers), Gross churn $ (revenue lost / beginning revenue), Net churn % (gross churn minus expansions/upsells), Customer expansion $ (upsells/cross-sells), Customer contraction $ (downgrades), Ending customer count and revenue, (2) Cohort retention analysis: For each acquisition cohort (Q1 2020, Q1 2021, Q1 2022, Q1 2023), show % of customers retained and % of revenue retained at 6/12/24/36 months post-acquisition, (3) Churn by customer size: Churn rate % for each size bucket (<$50K, $50-250K, $250K-1M, $1M-5M, $5M+), (4) Churn exit interviews: Top 10 churn reasons by segment with % of churned customers citing each reason (price, service quality, competitive displacement, customer business failure, strategic change, etc.), (5) Churn by tenure: Do customers acquired recently churn faster than long-tenure customers? (churn rate by tenure bucket: <1 year, 1-3 years, 3-5 years, 5+ years)"
    },
    {
      "information_needed": "Contract terms distribution and committed spend analysis by segment: % of customers and % of revenue on (A) pure month-to-month (no commitment), (B) annual committed spend agreements, (C) multi-year contracts; Distribution of committed spend levels (customer count and revenue in buckets: $0, <$100K, $100K-500K, $500K-1M, $1M-5M, $5M+); Early termination fee prevalence (% of contracts with ETFs, average ETF as % of remaining commitment); Average termination notice period by contract type; Churn rate comparison (month-to-month vs committed spend vs multi-year customers)",
      "why_needed": "CONTRACTUAL PROTECTION QUANTIFICATION: Stage 2.2 shows month-to-month billing is STANDARD, creating zero contractual lock-in. However, magnitude of contractual vulnerability is unknown. If 80%+ of revenue is pure month-to-month with 30-day notice, business has NEAR-ZERO contractual retention barrier - customers can exit at will with one month notice. If 40% of revenue has committed spend agreements with meaningful ETFs, provides modest churn buffer and revenue predictability. Contract mix determines: (1) Revenue forecasting confidence (committed spend provides forward visibility, month-to-month is unpredictable), (2) Churn modeling accuracy (customers with committed spend churn at 30-50% lower rates than month-to-month, those with ETFs have economic barrier to exit), (3) Pricing strategy opportunity (offer 10-15% discount for annual commits to improve retention and predictability), (4) Acquisition risk assessment (acquirer values contracted revenue at 1.2-1.5X multiple vs month-to-month at 0.8-1.0X). Without contract mix data, cannot assess degree of contractual exposure or opportunity to improve retention through contract restructuring.",
      "request_to": "Management / CFO OR Chief Revenue Officer",
      "format": "Excel files: (1) Contract type distribution by segment: For each segment: % of customers and % of revenue in each category (pure month-to-month, annual committed spend, multi-year contract), Average contract length in months, (2) Committed spend distribution: Count of customers and revenue in each committed spend bucket ($0, <$100K, $100K-500K, $500K-1M, $1M-5M, $5M+), (3) Early termination fee analysis: % of contracts with ETFs, Average ETF as % of remaining commitment, Distribution of ETF levels (0%, <25%, 25-50%, 50-100% of remaining commitment), (4) Termination notice period: Average and distribution of notice periods (30 days, 60 days, 90 days, 180+ days), (5) Churn comparison by contract type: Annual churn rate % for month-to-month customers vs annual committed spend customers vs multi-year contract customers (proves contractual lock-in effect on retention)"
    },
    {
      "information_needed": "Customer satisfaction, NPS, and leading churn indicators by segment: Quarterly Net Promoter Score by segment (2022-2024 trend), Monthly CSAT (Customer Satisfaction Score) by segment, Support metrics by segment (ticket volume, average resolution time, escalation rate, repeat ticket rate), Customer expansion and contraction analysis (% of customers and $ expanding spend vs contracting spend vs flat annually), Customer reference program participation (% of customers willing to provide references as satisfaction proxy), Satisfaction correlation with subsequent churn (do low-NPS customers churn at higher rates?)",
      "why_needed": "CHURN LEADING INDICATORS AND SERVICE QUALITY VALIDATION: Customer satisfaction metrics (NPS, CSAT) are LEADING INDICATORS of churn with 6-12 month lag. If Private Cloud NPS <20 (detractor-heavy), HIGH CHURN is approaching even if current churn is low - customers staying due to switching costs but dissatisfied, will exit when able. If Government NPS 50+ (promoter-heavy), churn risk is lower even if switching costs decrease. Satisfaction by segment determines: (1) Retention investment priority (fix service issues in dissatisfied segments BEFORE investing in sales/marketing - retaining dissatisfied customers is futile), (2) Churn acceleration risk quantification (dissatisfied customers churn at 2-3X rate of satisfied customers), (3) Upsell potential assessment (satisfied customers expand 40-60% more than dissatisfied customers), (4) 'Fanatical Support' value proposition validation (if NPS low, brand promise not delivered, differentiation claim invalid). Support metrics (escalation rates, resolution time) indicate operational health. Without satisfaction data, cannot distinguish RETENTION PROBLEM (customers dissatisfied with service) from MARKET PROBLEM (competitive commoditization). Root cause determines solution approach.",
      "request_to": "Management / VP Customer Success OR Chief Customer Officer",
      "format": "Excel files: (1) Quarterly NPS by segment (2022-2024): For each quarter and segment: NPS score, % Promoters (9-10 rating), % Passives (7-8 rating), % Detractors (0-6 rating), Response rate, (2) Monthly CSAT by segment: Average CSAT score (1-5 or 1-10 scale), Response rate, (3) Support metrics by segment: Monthly ticket volume, Average time to resolution (hours), % of tickets escalated to management, % of repeat tickets (same customer <30 days), Top 10 support issue categories, (4) Customer expansion/contraction analysis by segment: % of customers expanding spend YoY (>10% increase), % contracting spend YoY (>10% decrease), % flat spend (±10%), Expansion $ magnitude, Contraction $ magnitude, Net expansion revenue (expansions minus contractions), (5) Churn correlation: Average NPS 6-12 months before churn for churned customers vs average NPS for retained customers (proves NPS is leading indicator), Churn rate by satisfaction bucket (Promoters, Passives, Detractors)"
    },
    {
      "information_needed": "Cross-segment and cross-entity customer overlap analysis: Count and % of customers using multiple Rackspace segments (e.g., Private Cloud + Public Cloud + Professional Services), Revenue from multi-segment customers by segment combination, Count and % of customers spanning multiple Rackspace entities (US Commercial + Government, US + UK, etc.), Revenue from cross-entity customers by entity, Organizational coordination model for cross-entity/cross-segment customers (single global account manager or fragmented teams?), Satisfaction and churn comparison (cross-segment vs single-segment customers, cross-entity vs single-entity customers)",
      "why_needed": "UPSELL OPPORTUNITY QUANTIFICATION AND FRAGMENTATION CUSTOMER IMPACT: If 30% of customers use multiple segments, demonstrates PROVEN UPSELL paths and customer willingness to consolidate with Rackspace. If <10% multi-segment, either (1) segments serve non-overlapping needs (limited upsell potential), OR (2) organizational silos prevent cross-selling (fixable problem). Cross-entity customers likely LARGEST and HIGHEST-VALUE (enterprises with both government and commercial operations, or global presence requiring US + UK presence). If 5-10% of customers span entities but represent 20-30%+ of revenue, CONCENTRATION RISK is higher than single-entity analysis suggests. CRITICAL: If cross-entity customers have LOWER satisfaction or HIGHER churn than single-entity customers, proves multi-entity fragmentation (Stage 1, Stage 2.3) is VISIBLE CUSTOMER FRICTION causing tangible business harm, not just internal cost issue. Fragmentation impact determines: (1) Organizational redesign priority (if fragmentation drives customer dissatisfaction/churn in high-value accounts, must fix), (2) Sales strategy (invest in cross-sell if multi-segment customers have higher satisfaction/lower churn), (3) Retention focus (cross-entity customers may require dedicated global account management). Without overlap data, cannot assess whether fragmentation is COST ISSUE ONLY (internal inefficiency) or CUSTOMER ISSUE (affecting satisfaction and retention in high-value accounts).",
      "request_to": "Management / Chief Revenue Officer OR CFO",
      "format": "Excel files: (1) Customer segment overlap: Count of customers and revenue using 1 segment only, 2 segments, 3 segments, 4+ segments, For multi-segment customers: most common segment combinations (e.g., Private Cloud + Public Cloud, Public Cloud + Professional Services, etc.) with customer count and revenue, (2) Cross-entity customer mapping: List of customers present in multiple Rackspace entities (customer name, entities present in, revenue by entity), % of customers and % of revenue that is cross-entity vs single-entity, (3) Satisfaction and churn by overlap: Average NPS for single-segment vs multi-segment customers, Average NPS for single-entity vs cross-entity customers, Annual churn rate % for single-segment vs multi-segment customers, Annual churn rate % for single-entity vs cross-entity customers, (4) Coordination model documentation: For cross-entity customers, do they have single global account manager or separate account managers per entity? For multi-segment customers, single account owner or separate owners per segment? (5) Customer case studies: 3-5 examples of large cross-entity customers with description of coordination challenges, satisfaction issues, or success stories"
    }
  ]
}
