{
  "sub_stage": "3.3",
  "uncertainty_register": [
    {
      "unknown": "Customer segmentation by switching cost tier and inertia type - what percentage of revenue base has high structural lock-in vs low structural lock-in vs pure behavioral inertia?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL - Determines revenue at risk from different churn trigger types. If 60-70% of revenue has high structural lock-in ($2-10M switching costs, Large Enterprise Private Cloud/Government), churn risk is DELAYED but CONCENTRATED in specific trigger events (VMware pricing, incidents, mandates). If 40-50% of revenue has low/zero structural lock-in (behavioral inertia, SMB/Mid-Market), churn risk is IMMEDIATE and EPISODIC (can collapse rapidly on any attention-forcing event). Different distributions require different risk assessments. Without knowing revenue distribution by lock-in tier, cannot accurately model churn risk exposure. Stage 1.2 provides segment sizing ($486M Private Cloud likely high lock-in, $690M Public Cloud likely mixed, $144M Email likely zero lock-in) but within-segment heterogeneity unknown (Large Enterprise vs Mid-Market within Public Cloud have different lock-in).",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED. Need: (1) Customer count and revenue by customer size tier (Enterprise >$10M annually, Mid-Market $1-10M, SMB <$1M) showing distribution, (2) Customer infrastructure type breakdown (Private Cloud dedicated, Public Cloud managed, Public Cloud billed-through) correlating to lock-in levels, (3) Customer deployment complexity metrics (application count, integration depth, customization level) as proxy for switching costs, (4) Account team classification of customers by switching cost estimate. Combination would enable mapping of $1.38B revenue to lock-in tiers. Without management data, can only estimate from segment-level analysis: assume Private Cloud $486M is 60-80% high lock-in, Public Cloud $690M is 20-40% high lock-in + 40-60% low lock-in, Email $144M is 100% behavioral inertia. Use ranges for scenario analysis."
    },
    {
      "unknown": "Hyperscaler-direct competitive approach frequency and effectiveness - are AWS/Azure account teams systematically targeting Rackspace customers, how often, and what is win rate?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL - Determines whether latent Mid-Market Public Cloud churn risk ($40-110M identified in Stage 3.3) is IMMINENT THREAT (hyperscalers actively hunting, 20-40% base at risk over 2-3 years) vs FUTURE RISK (hyperscalers not yet systematic, 5-10% base at risk over 5 years). If AWS/Azure account teams have TARGET LISTS of MSP-managed customers and systematic outreach programs with incentives (credits, migration funding), threat materializes RAPIDLY (customers approached proactively, offered zero-friction switching with financial benefits). If hyperscaler-direct is PASSIVE (customers discover organically, no proactive targeting), threat materializes SLOWLY. Difference is 2-3 year urgency (systematic) vs 5-7 year (organic). Without knowing hyperscaler competitive strategy and execution intensity, cannot forecast Public Cloud retention trajectory.",
      "what_would_reduce_uncertainty": "PARTIALLY KNOWABLE through: (1) Customer interviews asking 'Has AWS/Azure account team approached you about direct managed services?' (indicates targeting frequency), (2) Rackspace sales team intelligence from competitive situations (how often do hyperscaler-direct appear as alternative in renewals?), (3) Industry channel checks with peer MSPs about hyperscaler competitive behavior patterns, (4) Analysis of hyperscaler partner program changes (reducing benefits, tightening requirements suggests prioritizing direct over channel), (5) Hyperscaler direct managed services revenue growth rates (rapid growth suggests active sales effort). MANAGEMENT ACCESS would provide customer feedback data and competitive intelligence. Without data, must model scenarios: AGGRESSIVE (hyperscalers targeting 40-60% base over 3 years), MODERATE (targeting 20-30% base over 5 years), PASSIVE (organic discovery 5-10% base over 5 years)."
    },
    {
      "unknown": "VMware/Broadcom price increase pass-through strategy and customer response - is Rackspace passing full cost increase to customers, negotiating, or absorbing? How are customers responding?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL - Determines whether VMware pricing latent churn risk ($90-150M identified in Stage 3.3) materializes as ACTUAL CHURN vs absorbed by Rackspace/customers vs negotiated compromise. If Rackspace passes through 200-300% VMware increase FULLY to customers at renewals, triggers customer economics calculation favoring switching (pay $2-10M switching cost vs accept $2-5M annual recurring increase forever = switching rational). If Rackspace ABSORBS portion of increase (reducing margins to retain customers), churn is lower but Rackspace profitability destroyed (Stage 2.2 shows 3.1% EBITDA margin, cannot absorb $100-210M cost increase). If Rackspace NEGOTIATES partial pass-through (50-100% increase to customers vs 200-300% full increase), may reduce churn but still triggers some customer switching and damages margins. Different strategies have different outcomes, strategy choice and customer response are both UNKNOWN.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED. Need: (1) Rackspace pricing strategy for VMware-based Private Cloud renewals 2024-2026 (are cost increases being passed through?), (2) Customer renewal outcomes for VMware-based contracts renewed 2024-2025 (acceptance rate, negotiation outcomes, churn rate), (3) Account team intelligence on customer reactions to pricing discussions (willingness to accept increases, evaluating alternatives, demanding concessions), (4) Financial analysis of margin impact from VMware costs (is Rackspace absorbing costs or passing through?). Without management access, can infer directionally: Stage 2.2 shows 3.1% EBITDA margin insufficient to absorb material costs, Rackspace MUST pass through or face losses. Stage 2.1 Private Cloud declining 13% YoY suggests customers ARE RESPONDING to pricing (churning or downsizing). Model scenarios: FULL PASS-THROUGH (40-60% customer churn, Rackspace maintains margins), PARTIAL PASS-THROUGH (20-40% churn, margins decline), ABSORB (5-15% churn, margins collapse)."
    },
    {
      "unknown": "Customer satisfaction and loyalty depth - are retained customers satisfied and committed, or dissatisfied but trapped by switching costs?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Determines whether retained customers are RESILIENT (will resist competitive pressure and trigger events) vs VULNERABLE (will churn rapidly when triggers occur). If customers are GENUINELY SATISFIED (high NPS, expanding relationships, active advocates), latent churn risk is LOWER than structural analysis suggests (some customers will stay despite alternatives due to preference). If customers are TRAPPED (maintaining minimum relationships, flat spending, no advocacy, complaints suppressed), latent churn risk is HIGHER (customers will leave at first opportunity). Difference affects churn forecasting: satisfied customers stay until economics FORCE switch (high bar), trapped customers leave when economics JUSTIFY switch (lower bar) or when any trigger provides excuse. Without customer satisfaction depth data, cannot distinguish fragile retention from genuine loyalty.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS PREFERRED but PARTIALLY REDUCIBLE through inference. Management data: (1) NPS scores by segment with trends (declining NPS indicates deteriorating satisfaction), (2) Customer expansion rates (growing spend indicates satisfaction, flat/declining indicates dissatisfaction), (3) Customer reference willingness and advocacy (willing references indicate loyalty), (4) Customer complaint and escalation data (high complaints indicate dissatisfaction, low complaints ambiguous). INFERENCE from existing evidence: Stage 2.1 shows revenue declining 7% YoY and flat customer spending (no expansion) suggests LOW satisfaction. Stage 3.3 false loyalty signals analysis: customers appear trapped not committed (minimal expansion, defensive retention, relationship-dependent not company-dependent). Stage 2.4 explicit statement: retention is 'STRUCTURAL not earned through superior service quality'. CONCLUSION from inference: retention is primarily CONSTRAINT-BASED with low genuine loyalty. Use pessimistic assumption (customers are trapped not satisfied) for base case, optimistic assumption (some genuine loyalty exists) for sensitivity."
    },
    {
      "unknown": "Churn trigger event timing and sequencing - when do identified triggers (VMware pricing renewals, hyperscaler campaigns, AWS UK Sovereign launch, government mandates, PE acquisitions, economic downturn) materialize and do they overlap?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Determines whether latent churn risks materialize SEQUENTIALLY (spread over 5-7 years, allowing time to respond) vs SIMULTANEOUSLY (concentrated in 2-3 years, overwhelming management capacity). If VMware pricing hits 2025-2027, hyperscaler campaigns hit 2024-2026, AWS UK Sovereign hits 2025-2026, economic downturn hits 2025-2026, triggers OVERLAP creating COMPOUND CHURN EVENT (multiple customer cohorts churning simultaneously = 20-30% total base over 2 years). If triggers are SEQUENTIAL (VMware 2025-2027, hyperscalers 2027-2029, economy 2026-2027, AWS UK 2028-2030), churn is DISTRIBUTED (10-15% annually over 5 years, more manageable). Overlapping triggers create DEATH SPIRAL RISK (high churn → revenue decline → cost pressure → management distraction → service degradation → more churn). Sequential triggers allow ADAPTATION (respond to one threat before next emerges).",
      "what_would_reduce_uncertainty": "PARTIALLY KNOWABLE through research and inference. (1) VMware pricing timeline: Broadcom acquisition 2023, contract renewals typically 3-5 years, PEAK IMPACT 2025-2027 for contracts signed 2020-2024. (2) Hyperscaler targeting: AWS/Azure Managed Services growth suggests active customer acquisition but timing uncertain, likely ONGOING 2024-2026+. (3) AWS UK Sovereign: Public announcements suggest 2025-2026 launch, IMPACT 2025-2027 as customers evaluate. (4) Government mandates: Cloud-smart policies ongoing, enforcement GRADUAL 2024-2028. (5) PE acquisitions: Unpredictable external events, assume BASELINE rate 10-20% of enterprise base over 3-5 years. (6) Economic downturn: Unknown, model both expansion scenario (no downturn, triggers sequential) and recession scenario (downturn 2025-2026, triggers overlapping). CONCLUSION: Multiple triggers likely OVERLAP in 2025-2027 period (VMware renewals + AWS UK launch + ongoing hyperscaler competition + potential economy), creating CONCENTRATED RISK not distributed risk."
    },
    {
      "unknown": "Customer contractual terms and renewal timing distribution - when do major contracts renew, what percentage of base is in renewal annually, are renewals concentrated or distributed?",
      "type": "UNKNOWN",
      "decision_impact": "MODERATE-HIGH - Determines churn risk TIMING precision. If contracts renew EVENLY over time (20% of base renews each year in 5-year cycle), churn is DISTRIBUTED and predictable (can forecast 'X% of renewals will churn annually'). If contracts renew in CONCENTRATED WAVES (40% of base renews 2025-2026 due to contracts signed 2020-2023), churn is LUMPY and creates CLIFF RISK (large revenue loss in single year vs steady decline). Also determines PROTECTION WINDOW: customers with 3-year contracts signed 2023 are protected until 2026 (low immediate churn risk even if dissatisfied), customers with annual contracts or near-term renewals are IMMEDIATE churn risk. Without knowing contract term distribution and renewal timing, cannot forecast churn timing with precision (know churn will occur, don't know when).",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED. Need: (1) Contract term distribution (percentage of revenue on 1-year, 3-year, 5-year contracts), (2) Contract renewal schedule showing revenue at renewal by year/quarter (enables forecasting churn windows), (3) Historical contract signing patterns (if major signing wave 2020-2023, then renewal wave 2023-2028 based on term lengths). This is STANDARD CONTRACT MANAGEMENT DATA that B2B companies maintain. Without data, can only model generically: assume TYPICAL enterprise contract mix (30% annual, 50% 3-year, 20% 5-year) with DISTRIBUTED renewals (15-25% base renews annually). Use distributed assumption for base case, concentrated assumption (30-40% base renewing 2025-2027) for stress scenario."
    }
  ]
}
