{
  "sub_stage": "2.4",
  "disconfirming_evidence_not_found": [
    "Evidence of DIVERSIFIED profit contribution across many segments showing no segment contributes >25% of operating income (SOUGHT but NOT FOUND): Analysis shows Private Cloud + Government contribute 55-75% of operating income from 30-45% of revenue, indicating CONCENTRATED profit dependency.",
    "Evidence of LOW customer concentration within segments showing top 10 customers represent <15% of segment revenue (SOUGHT but NOT FOUND): Estimated concentration 20-35% in Private Cloud, 20-40% in Government segment.",
    "Evidence of UNIFORM churn rates across segments (all 10-15% annually) indicating similar retention dynamics (SOUGHT but NOT FOUND): Estimated churn ranges from 5-8% (Large Enterprise) to 25-40% (SMB), wide variation by segment.",
    "Evidence of LOW actual churn rates <10% annually in Mid-Market or SMB segments (SOUGHT but NOT FOUND): Stage 2.1 email churn on price increase proves high SMB churn, estimated Mid-Market 15-25%, SMB 25-40%.",
    "Evidence of DECLINING churn trends showing retention initiatives working (SOUGHT but NOT FOUND): Revenue declining 7% YoY despite bookings growth 14% suggests persistent high churn.",
    "Evidence of NET NEGATIVE CHURN (upsells/expansions exceed gross churn) in any segment (SOUGHT but NOT FOUND): Stage 2.1 revenue decline proves net positive churn across business.",
    "Evidence of MULTI-YEAR non-cancelable contracts creating contractual lock-in (SOUGHT but NOT FOUND): Stage 2.2 shows month-to-month billing is standard, eliminating contractual barriers.",
    "Evidence of SIGNIFICANT early termination penalties (>25% annual contract value) preventing exits (SOUGHT but NOT FOUND): Some Large Enterprise have modest committed spend ETFs but not material barriers.",
    "Evidence of RACKSPACE-PROPRIETARY technology creating technical lock-in independent of third-party dependencies (SOUGHT but NOT FOUND): VMware is third-party (Stage 2.2), hyperscalers are third-party, no Rackspace proprietary platform identified.",
    "Evidence of INCREASING lock-in in Public Cloud through proprietary technology or platform adoption (SOUGHT but NOT FOUND): Public Cloud remains commoditized reseller model with hyperscaler portability.",
    "Evidence of CONTRACTUAL PROTECTIONS preventing rapid customer loss such as minimum commit volumes or usage guarantees (SOUGHT but NOT FOUND): Month-to-month standard allows customer exit with minimal notice.",
    "Evidence of HIGH lock-in in high-revenue segments creating alignment of scale and retention (SOUGHT but NOT FOUND): Inverse relationship - highest revenue segments (Mid-Market, SMB) have lowest lock-in.",
    "Evidence of LOW-MARGIN segments having LOWER churn than high-margin segments (SOUGHT but NOT FOUND): Opposite pattern found - low-margin segments have highest churn.",
    "Evidence of STABLE or GROWING revenue in low-lock-in segments despite churn (SOUGHT but NOT FOUND): Stage 2.1 shows revenue declining across segments except immature UK Sovereign.",
    "Evidence of CUSTOMER LOYALTY programs or retention initiatives creating behavioral lock-in (SOUGHT but NOT FOUND): No retention programs disclosed beyond standard 'Fanatical Support'.",
    "Evidence of SWITCHING COST INCREASES over time making exit more difficult (SOUGHT but NOT FOUND): Technology commoditization (Kubernetes, containers) likely REDUCING technical lock-in over time.",
    "Evidence of COMPETITOR SWITCHING COSTS being higher than Rackspace exit costs (SOUGHT but NOT FOUND): Hyperscaler-direct switching from Rackspace to AWS/Azure has LOW technical friction per customer_contract_and_lock_in_dynamics.json.",
    "Evidence of HIGH customer satisfaction (NPS >40) supporting 'Fanatical Support' value proposition (SOUGHT but NOT FOUND): No customer satisfaction metrics disclosed.",
    "Evidence of LOW support ticket escalation rates indicating service quality (SOUGHT but NOT FOUND): No operational quality metrics disclosed.",
    "Evidence of HIGH customer expansion rates (>20% of customers expanding spend annually) (SOUGHT but NOT FOUND): Revenue decline suggests contraction exceeds expansion.",
    "Evidence of MANY SMALL high-margin customers creating portfolio diversification (SOUGHT but NOT FOUND): Private Cloud and Government segments have large contract sizes creating concentration.",
    "Evidence of RELATIONSHIP-BASED retention succeeding in low-lock-in segments (SOUGHT but NOT FOUND): Mid-Market and SMB have minimal account management relationships per customer_contract_and_lock_in_dynamics.json.",
    "Evidence of SEGMENT GROWTH offsetting churn (new customer acquisition exceeding losses) (SOUGHT but NOT FOUND): All mature segments declining or stable, only immature UK Sovereign growing from zero base.",
    "Evidence of REFERENCE customers or case studies demonstrating high satisfaction by segment (SOUGHT but NOT FOUND): No customer reference program metrics disclosed.",
    "Evidence of LONG average customer tenure (5-10+ years typical) indicating stickiness (SOUGHT but NOT FOUND): Customer tenure distribution not disclosed.",
    "Evidence of LOW price sensitivity in any segment (customers accepting 15-20%+ price increases without churn) (SOUGHT but NOT FOUND): Stage 2.1 email churn on price increase proves HIGH price sensitivity in SMB, other segments unknown.",
    "Evidence of CONTRACTUAL PRICE PROTECTION for customers (caps on annual increases) creating stability (SOUGHT but NOT FOUND): No contractual price caps identified.",
    "Evidence of CUSTOMER CO-INVESTMENT in Rackspace platform (customer-funded development, joint ventures) creating mutual lock-in (SOUGHT but NOT FOUND): No customer co-investment programs disclosed.",
    "Evidence of ECOSYSTEM LOCK-IN through partner/vendor relationships (customers integrated with Rackspace partner ecosystem) (SOUGHT but NOT FOUND): No partner ecosystem lock-in identified.",
    "Evidence of DATA NETWORK EFFECTS creating lock-in (customer value increases with usage, customer data creates switching barrier) (SOUGHT but NOT FOUND): MSP model does not create data network effects.",
    "Evidence of CERTIFICATION OR COMPLIANCE VALUE portable only with Rackspace (FedRAMP authorization non-transferable) (SOUGHT but NOT FOUND): FedRAMP authorization is PROVIDER-SPECIFIC but 100 alternatives exist, compliance value is not unique to Rackspace.",
    "Evidence of CUSTOMER SUCCESS programs demonstrating proactive retention (health scoring, early warning systems, proactive outreach) (SOUGHT but NOT FOUND): No customer success program details disclosed.",
    "Evidence of EXECUTIVE RELATIONSHIPS at customer organizations creating retention advantage (SOUGHT but NOT FOUND): Large Enterprise likely has exec relationships but not systematically disclosed or measured."
  ]
}
