{
  "sub_stage": "8.4",
  "document_metadata": {
    "title": "Data Residency and Geographic Immutability Map - Where Data Cannot Move",
    "target_entity": "Rackspace Technology, Inc.",
    "analysis_date": "2026-02-15",
    "scope": "Identification of data, workloads, and processing activities that are legally or contractually bound to specific jurisdictions"
  },
  "immutability_map": [
    {
      "data_or_workload": "US Federal Government Customer Data - FedRAMP-Authorized Environments",
      "locked_location": "Continental United States (CONUS) only, US-based data centers operated by US citizens",
      "legal_or_contractual_basis": "STATUTORY + CONTRACTUAL: (1) FedRAMP authorization requirements implicitly require CONUS data residency (federal data sovereignty doctrine), (2) Individual federal agency contracts often explicitly require data remain in US, (3) DoD Impact Level 4 authorization requires US-person access controls (non-US citizens cannot access federal data), (4) DFARS/CMMC requirements for defense contractors mandate US data residency, (5) Federal customer contracts typically include FAR clause 52.239-1 requiring data remain under US jurisdiction. TOUCH TEST: If Rackspace stores federal customer data outside CONUS or allows non-US personnel access: (1) FedRAMP ATO IMMEDIATE SUSPENSION by JAB (within 24-72 hours of discovery), (2) Federal customer contract breaches triggering immediate termination rights, (3) Potential False Claims Act liability (31 USC §3729) if Rackspace certified CONUS residency while violating, (4) Loss of DoD clearances for personnel, (5) Permanent loss of federal business (agencies will not return after residency violation, re-authorization would require 12-18 months IF granted). Stage 1.5 documents Rackspace serves >50% of cabinet agencies, federal revenue estimated $50M+ annually - ALL at risk if residency violated.",
      "operational_consequence": "FORCES: (1) Maintain separate US-only infrastructure for federal customers (cannot consolidate with global operations for cost efficiency), (2) Maintain US-citizen-only security/support teams for federal environments (limits talent pool, increases labor costs vs using global workforce), (3) Duplicate security operations, monitoring tools, incident response capabilities in CONUS (cannot leverage global SOC economies of scale), (4) Separate compliance/audit teams for FedRAMP (cannot share with commercial compliance staff if non-US citizens). PROHIBITS: (1) Offshore support for federal customers (common cost-reduction strategy for commercial customers unavailable), (2) Global data backup/disaster recovery (cannot replicate federal data to non-US regions even for Rackspace's own DR), (3) Cross-customer threat intelligence sharing (cannot analyze federal customer attack patterns alongside commercial/international customers to identify global threat trends), (4) Consolidated billing/CRM systems (federal customer data must be segregated from international customer data in all business systems).",
      "immutability_type": "ABSOLUTE",
      "claim_type": "FACT (legal requirements) + INFERENCE (cost impacts based on operational constraints)",
      "evidence_sources": [
        "FedRAMP authorization requirements: Implicit CONUS data residency for federal cloud services",
        "Stage 1.5: Rackspace Government Solutions, Inc. entity-specific authorization, serves >50% cabinet agencies",
        "FAR 52.239-1: Privacy or Security Safeguards clause requiring US jurisdiction",
        "DoD IL4 authorization: US-person access control requirements",
        "DFARS/CMMC: Defense contractor data residency mandates",
        "Stage 8.1: FedRAMP security controls freeze, cannot rapidly change without JAB approval",
        "False Claims Act 31 USC §3729: Penalties for false certification to government"
      ]
    },
    {
      "data_or_workload": "UK Sovereign Services Customer Data - Government, NHS, Police, Financial Services",
      "locked_location": "United Kingdom only, UK-based data centers with UK-only personnel access, architecturally isolated from Rackspace global network",
      "legal_or_contractual_basis": "CONTRACTUAL + REGULATORY + CERTIFICATION: (1) VMware Sovereign Cloud certification (January 2026) REQUIRES demonstrable architectural isolation - UK data cannot leave UK, UK-only personnel access, no global network connection, (2) UK government, NHS, police customer contracts include data sovereignty as MATERIAL TERM - breach allows immediate termination, (3) UK GDPR Article 46 restricts international transfers requiring adequacy decision, SCCs, or explicit consent, (4) UK National Cyber Security Centre (NCSC) guidance for public sector cloud requires UK data residency, (5) NHS Class V risk data requirements mandate UK-isolated infrastructure, (6) FCA/PRA operational resilience regulations for financial services require UK data residency for critical operations. TOUCH TEST: If UK Sovereign data leaves UK OR non-UK personnel access: (1) VMware Sovereign Cloud certification REVOKED within 30-90 days upon audit discovery (certification is prerequisite for serving UK government/NHS), (2) Customer contracts breached - UK government/NHS/police customers terminate immediately (government will not tolerate sovereignty violation), (3) UK ICO investigation for UK GDPR Article 46 transfer violations (£17.5M or 4% global revenue penalty = £108M maximum), (4) Reputational destruction in UK public sector (sovereignty violation is political scandal, permanently bars Rackspace from UK government business).",
      "operational_consequence": "FORCES: (1) Complete operational duplication in UK - separate infrastructure, separate security operations, separate support teams, separate billing/CRM (estimate 2-3x cost per customer vs global operations per Stage 8.1), (2) UK-only hiring for all roles touching UK Sovereign (limits talent acquisition to UK labor market, higher labor costs than leveraging India/Eastern Europe global workforce), (3) Separate vendor relationships for UK (cannot use global vendor contracts if vendor accesses data, must negotiate UK-specific agreements), (4) UK-specific disaster recovery WITHIN UK (cannot replicate to other Rackspace regions for geographic diversity). PROHIBITS: (1) Global security operations center monitoring UK Sovereign (violates personnel access restrictions, Stage 8.1 documents this prevents security consolidation), (2) Centralized threat intelligence (UK attack patterns cannot be shared with global teams to improve worldwide security), (3) Cross-border incident response (if UK experiences breach, global security experts cannot assist without violating UK-only access requirement), (4) Data analytics/AI model training using UK data (cannot extract UK data for global product development or service improvement), (5) M&A integration (if Rackspace acquired, acquirer CANNOT integrate UK Sovereign into global operations without losing UK government business).",
      "immutability_type": "ABSOLUTE",
      "claim_type": "FACT",
      "evidence_sources": [
        "Stage 1.5: UK Sovereign Services March 2024 launch, VMware Sovereign Cloud certification January 2026",
        "Rackspace announcement March 27, 2024: 'Platforms and support teams isolated from global network'",
        "VMware Sovereign Cloud requirements: Demonstrable isolation, UK data stays UK, UK-only personnel",
        "Stage 8.1: UK Sovereign isolation prevents global security consolidation, creates duplicate operations",
        "UK customer contracts: Government, NHS, police, FCA/PRA require sovereignty as material term",
        "UK GDPR Article 46: International transfer restrictions",
        "Stage 8.3: VMware can revoke certification within 30-90 days, ICO enforcement £17.5M maximum"
      ]
    },
    {
      "data_or_workload": "China Customer Data - Personal Information and Important Data",
      "locked_location": "People's Republic of China only, China-based data centers (Shanghai documented), China legal entity operations",
      "legal_or_contractual_basis": "STATUTORY (MANDATORY): China Cybersecurity Law (CSL) Article 37 mandates 'critical information infrastructure operators' (CIIOs) store personal information and important data collected/generated in China WITHIN CHINA. Cross-border data transfer requires: (1) Security assessment by Cyberspace Administration of China (CAC) under CSL Article 38, (2) Approval process takes 6-12 months with uncertain outcome, (3) 'Important data' definition is BROAD and discretionary - CAC determines what qualifies, (4) National security review under CSL Article 45 can be triggered for any data activities 'affecting or potentially affecting national security'. TOUCH TEST: If China customer data leaves China without CAC approval: (1) Business license suspension or REVOCATION by Chinese government (cannot operate in China), (2) Fines up to RMB 1M ($140K USD) for data localization violations per CSL Article 66, (3) CRIMINAL PENALTIES for responsible executives including detention, travel bans, prosecution under Chinese criminal law, (4) Mandatory data deletion or transfer to government-approved custodian (loss of customer data assets), (5) US export control implications if China data contained US-origin technology (ITAR, EAR violations triggering US enforcement in addition to Chinese penalties).",
      "operational_consequence": "FORCES: (1) China-isolated operations - separate legal entity, separate infrastructure, separate personnel (cannot share with global operations), (2) China-domiciled executives accepting PERSONAL LEGAL RISK (detention, criminal prosecution if data leaves China), (3) All business systems (CRM, billing, analytics, security monitoring) must be China-hosted if they touch customer data (cannot use global Salesforce/ServiceNow instances), (4) China government OVERSIGHT of all operations - government audits, government access to systems, government approval for major changes. PROHIBITS: (1) M&A due diligence if acquirer is non-China entity (transferring China customer data to acquirer for due diligence is cross-border transfer requiring CAC approval, likely denied), (2) Global customer analytics (cannot combine China customer usage patterns with global customers to identify trends), (3) Consolidated security operations (China customer data cannot be analyzed by global security teams for threat detection), (4) Corporate reporting (Rackspace global cannot access China customer data for financial/operational reporting without constituting cross-border transfer). GEOPOLITICAL WEAPON: Chinese government can use data localization enforcement as leverage in US-China disputes - suspend Rackspace China business license to pressure US policy changes, forcing Rackspace into diplomatic conflicts.",
      "immutability_type": "ABSOLUTE",
      "claim_type": "FACT",
      "evidence_sources": [
        "China Cybersecurity Law (CSL) Article 37: Data localization mandate for CIIOs",
        "CSL Article 38: Cross-border data transfer requires CAC security assessment",
        "CSL Article 45: National security review for data activities",
        "CSL Article 66: Penalties including fines up to RMB 1M, business license revocation, criminal liability",
        "Stage 1.5: Rackspace China entity with Shanghai data center confirmed",
        "Stage 8.3: Chinese government enforcement is OPAQUE, creates executive detention risk",
        "Industry precedent: DiDi $1.2B fine July 2022 for data security violations demonstrates large-scale CSL enforcement"
      ]
    },
    {
      "data_or_workload": "EU Personal Data Subject to GDPR - Customer and Employee Data",
      "locked_location": "European Union member states (27 jurisdictions) + EEA + UK (post-Brexit separate regime), with CONDITIONAL transfer to US/other third countries only via approved mechanisms",
      "legal_or_contractual_basis": "STATUTORY: GDPR Article 44-50 (Chapter V) restricts international data transfers. Data can leave EU ONLY if: (1) European Commission adequacy decision exists for destination country (current: EU-US Data Privacy Framework July 2023, UK adequacy renewed 2025, both UNDER LEGAL CHALLENGE), (2) Standard Contractual Clauses (SCCs) implemented PLUS supplementary measures addressing destination country surveillance laws (Schrems II requirement), (3) Binding Corporate Rules approved by lead DPA (lengthy approval process, not applicable to processor-customer relationships), (4) Explicit data subject consent (impractical for business operations), (5) Derogations for specific situations (contract performance, legal claims - narrow exceptions). TOUCH TEST: If EU personal data transferred to US without valid mechanism: (1) 27 EU DPAs can EACH investigate and fine up to €20M or 4% global revenue (€108M based on $2.7B revenue) PER DPA, realistically 3-5 DPAs would enforce = €60M-€100M exposure, (2) DPAs can issue IMMEDIATE SUSPENSION ORDERS halting data processing (injunction), (3) DPAs can issue IMMEDIATE BAN on data transfers outside EU (destroys cross-border operations overnight), (4) EU customers become NON-COMPLIANT with GDPR immediately, forcing emergency migration to EU-only providers (40-60% customer churn within 6 months per Stage 8.3 analysis), (5) Corrective orders requiring data deletion (destroys derived analytics, AI models trained on EU data).",
      "operational_consequence": "FORCES: (1) Maintain EU-based support, security operations, billing systems for EU customers (cannot offshore to US/India without valid transfer mechanism), (2) If Data Privacy Framework invalidated (Schrems III scenario, legal challenges filed February 2024 per Stage 8.3), MUST implement EU operational isolation similar to UK Sovereign within 6-12 months grace period = $50M-$100M investment, (3) Separate EU infrastructure, separate EU personnel, separate EU vendors to avoid ANY data transfer to US, (4) EU employees' HR data also subject to GDPR transfer restrictions - US parent company accessing EU employee data for payroll/benefits/compliance is international transfer requiring valid mechanism. PROHIBITS: (1) Consolidated global security operations center in US analyzing EU customer security events (constitutes transfer of EU personal data to US, requires valid mechanism), (2) Global customer analytics/business intelligence combining EU and non-EU customer data (EU customer IPs, usage patterns, performance metrics are personal data under GDPR, transfer restricted), (3) Centralized AI/ML model training using EU customer data (would require transferring EU data to US-based data science teams, blocked), (4) M&A due diligence if acquirer is US entity without adequate transfer mechanisms (cannot provide EU customer data to acquirer for due diligence without customer consent or valid transfer mechanism). LATENT RISK: EU-US DPF under legal challenge, Irish High Court ruling expected 2026-2028 - if invalidated, creates IMMEDIATE OPERATIONAL CRISIS requiring emergency EU isolation implementation.",
      "immutability_type": "CONDITIONAL (currently transferable via DPF, but DPF validity challenged and may become ABSOLUTE immobility)",
      "claim_type": "FACT",
      "evidence_sources": [
        "GDPR Articles 44-50: Chapter V international transfer restrictions",
        "EU-US Data Privacy Framework adequacy decision July 2023, under legal challenge per Stage 8.3",
        "Schrems II decision July 2020: Invalidated Privacy Shield, established supplementary measures requirement",
        "Stage 1.5: EU data centers Amsterdam and Frankfurt, EU customers estimated 20-30% of revenue",
        "Stage 8.2: Rackspace operates as GDPR processor, cross-border transfers require valid mechanisms",
        "Stage 8.3: Max Schrems filed DPF challenges February 2024, decision 2026-2028, if invalidated creates $300M-$450M revenue operational catastrophe",
        "Austrian DPA 2022: Banned Google Analytics US transfers, demonstrates individual DPA enforcement before CJEU final decisions"
      ]
    },
    {
      "data_or_workload": "Protected Health Information (PHI) - US Healthcare Customer Data",
      "locked_location": "United States (PRACTICAL residency requirement despite HIPAA not mandating geographic restriction)",
      "legal_or_contractual_basis": "CONTRACTUAL + PRACTICAL: HIPAA does NOT explicitly mandate US data residency, BUT: (1) US healthcare customers (covered entities) CONTRACTUALLY require US residency in Business Associate Agreements due to: liability concerns, regulatory interpretation uncertainty, state breach notification law compliance complexity, (2) Stage 8.2 documents Rackspace HIPAA Addendum Section 5 requires 'customer must encrypt PHI before transmission to Rackspace' - this creates operational constraint where Rackspace cannot decrypt PHI, limiting offshore processing utility, (3) Offshore PHI processing creates perception of increased breach risk and regulatory scrutiny (OCR investigations more likely if offshore breach), (4) HITECH Act breach notification costs escalate if offshore processing (more complex notification to patients explaining 'your data was processed in India'). TOUCH TEST: If Rackspace attempts to store/process US healthcare customer PHI offshore: (1) Healthcare customers REFUSE to sign/renew Business Associate Agreements (contractual non-compliance with customer internal policies), (2) Existing healthcare customers TERMINATE contracts upon discovering offshore processing (material change to BAA terms requires customer consent, customers will refuse), (3) OCR investigation MORE LIKELY if breach occurs with offshore PHI (OCR scrutiny increases for BAs using offshore processing perceived as higher-risk), (4) Healthcare customer churn 60-80% upon offshore migration announcement (healthcare is risk-averse sector, will not accept perceived increased breach risk).",
      "operational_consequence": "FORCES: (1) Maintain US-based infrastructure for HIPAA/HITRUST-certified services (cannot leverage lower-cost offshore infrastructure), (2) US-based support teams for healthcare customers (cannot use India/Philippines offshore support common in other verticals for cost reduction), (3) Separate US-based security operations for PHI environments (even though HIPAA doesn't mandate, customer expectations and liability concerns drive US residency), (4) Higher cost structure for healthcare business vs commercial due to inability to leverage global cost arbitrage. PROHIBITS: (1) Offshore disaster recovery for PHI (technically HIPAA-compliant if encrypted, but customers refuse due to perception risk), (2) Global security operations analyzing PHI breach patterns (customers require US-only security team access), (3) Offshore analytics or AI using PHI (research exception exists under HIPAA but customers will not consent), (4) M&A integration if acquirer uses offshore operations for healthcare data (acquirer must maintain US isolation or lose healthcare customers). COMPETITIVE DISADVANTAGE: Cloud hyperscalers (AWS, Azure, Google Cloud) have same HIPAA restrictions but SCALE allows them to absorb US-only operations cost - Rackspace smaller scale means higher per-customer cost for US-isolated healthcare infrastructure, reducing margin or forcing higher prices (price disadvantage vs hyperscalers).",
      "immutability_type": "CONDITIONAL (HIPAA allows offshore if safeguards implemented, but customer contracts and market expectations create PRACTICAL absolute residency)",
      "claim_type": "INFERENCE (based on healthcare industry practice, customer contract standards, and operational reality)",
      "evidence_sources": [
        "Stage 8.2: Rackspace HIPAA Addendum requires customer encrypt PHI, Rackspace operates as Business Associate",
        "HIPAA regulations: No explicit geographic restriction, but Privacy Rule and Security Rule create liability concerns for offshore processing",
        "Industry practice: US healthcare covered entities typically require US data residency in BAA contracts",
        "Stage 8.3: OCR enforcement acceleration ($7M in BA settlements 2024), offshore processing increases OCR scrutiny perception",
        "Healthcare customer risk aversion: Sector prioritizes perceived security over cost, will not accept offshore processing even if technically compliant",
        "HITECH Act: Breach notification complexity increases for offshore processing"
      ]
    },
    {
      "data_or_workload": "Department of Defense and Classified Workloads - DoD Impact Level 4/5/6",
      "locked_location": "United States only, DoD-approved facilities, US citizens with appropriate security clearances only",
      "legal_or_contractual_basis": "STATUTORY + NATIONAL SECURITY: (1) DoD Cloud Computing Security Requirements Guide (SRG) Impact Level 4 requires US-only operations with US-person access controls, IL5/IL6 (classified workloads) require DoD-approved facilities and cleared personnel, (2) Executive Order 13556 and 32 CFR Part 2004 establish Controlled Unclassified Information (CUI) handling requirements including US residency for CUI data, (3) ITAR (International Traffic in Arms Regulations) 22 CFR 120-130 prohibits export of defense-related data without State Department approval - storing on non-US infrastructure constitutes 'export', (4) Export Administration Regulations (EAR) 15 CFR 730-774 restricts transfer of dual-use technology data to certain countries. TOUCH TEST: If DoD/classified data leaves US or non-cleared personnel access: (1) DoD contract IMMEDIATE TERMINATION (DoD will not continue contract with entity that exported defense data), (2) ITAR/EAR criminal violations - 22 USC §2778 allows penalties up to $1M per violation and 20 years imprisonment for willful ITAR violations, civil penalties up to $500K per violation, (3) Loss of facility security clearances (cannot host future classified workloads, permanent loss of DoD classified business), (4) Foreign Ownership, Control, or Influence (FOCI) investigation if data accessed by foreign nationals (could result in broader loss of DoD business, not just classified), (5) FBI counterintelligence investigation if classified data compromised (executives face espionage investigation).",
      "operational_consequence": "FORCES: (1) US-only facilities for DoD IL4+ workloads (cannot leverage global infrastructure), (2) US citizen cleared personnel only (limits talent pool, increases labor costs, clearance processing takes 6-18 months), (3) Separate physical and logical infrastructure for classified workloads (cannot share with commercial infrastructure due to cross-domain restrictions), (4) DoD-specific security controls, auditing, continuous monitoring exceeding FedRAMP requirements (IL4 is FedRAMP+, IL5/6 even more stringent), (5) Physical security requirements for classified facilities (guards, vault doors, TEMPEST shielding for IL5/6) creating massive infrastructure investment. PROHIBITS: (1) Offshore support for DoD customers even for unclassified administrative functions (DoD contracts often prohibit any offshore access), (2) Non-US executives or board members accessing DoD business data (FOCI concerns), (3) M&A by foreign entity without DoD FOCI mitigation (Special Security Agreement, Voting Trust, or divestiture - Stage 1.5 documents FOCI creates 6-12 month approval process, may be denied), (4) Consolidated operations with commercial business if efficiency requires cross-domain data access (classified data air-gapped from commercial). PERMANENT COST STRUCTURE: DoD classified business will ALWAYS operate at higher cost than commercial due to personnel clearances, facility security, US-only operations - cannot achieve cost efficiencies through globalization.",
      "immutability_type": "ABSOLUTE",
      "claim_type": "FACT",
      "evidence_sources": [
        "DoD Cloud Computing SRG: Impact Level 4/5/6 requirements for US-only operations, cleared personnel",
        "Stage 1.5: Rackspace holds DoD IL4 authorization, serves DoD customers",
        "ITAR 22 CFR 120-130: Export controls for defense-related data",
        "EAR 15 CFR 730-774: Dual-use technology transfer restrictions",
        "Executive Order 13556 and 32 CFR Part 2004: CUI handling requirements",
        "ITAR penalties 22 USC §2778: Up to $1M per violation, 20 years imprisonment for willful violations",
        "Stage 1.5: FOCI regulations for government contractors, foreign acquisition triggers FOCI review"
      ]
    },
    {
      "data_or_workload": "Financial Services Data - UK FCA/PRA Regulated Firms, EU MiFID II/PSD2",
      "locked_location": "UK for UK FCA/PRA firms (must use UK Sovereign Services per Rackspace positioning), EU for EU financial services firms (jurisdiction-specific requirements)",
      "legal_or_contractual_basis": "REGULATORY + CONTRACTUAL: (1) UK FCA/PRA operational resilience regulations require critical financial services operations maintain UK data residency, (2) EU MiFID II (Markets in Financial Instruments Directive) and PSD2 (Payment Services Directive) impose data protection and operational resilience requirements with implicit data residency expectations, (3) Financial services customer contracts include data residency requirements as MATERIAL TERMS due to regulatory obligations, (4) Bank regulators (ECB, Bank of England, national banking regulators) require oversight of critical service providers - non-EU/UK cloud providers face additional scrutiny, creating practical residency requirement. TOUCH TEST: If UK financial services data leaves UK without customer/regulator approval: (1) UK financial services customers breach FCA/PRA operational resilience requirements (customer faces regulatory enforcement, customer terminates Rackspace contract to regain compliance), (2) Rackspace faces FCA investigation as critical third party to regulated firms (FCA has authority to examine service providers to regulated firms under SYSC 8), (3) Customer contract breach allowing immediate termination, (4) Loss of UK financial services business (estimated material portion of £1B+ UK Sovereign Services target market). Similarly for EU: if EU financial services data leaves EU, customers face national regulator enforcement, terminate contracts.",
      "operational_consequence": "FORCES: (1) Maintain UK-isolated infrastructure for UK financial services customers (UK Sovereign Services launched March 2024 specifically for this requirement per Stage 1.5), (2) Maintain EU-isolated infrastructure for EU financial services customers (separate from UK post-Brexit, separate from US), (3) Financial services-specific compliance certifications by jurisdiction (PCI DSS, local banking regulations, operational resilience frameworks), (4) Separate financial services operations teams by jurisdiction due to data access restrictions and regulatory oversight requirements. PROHIBITS: (1) Consolidated global financial services platform (must maintain separate UK, EU, US platforms due to jurisdictional requirements), (2) Cross-border analytics for financial services customers (cannot analyze UK financial data alongside EU/US financial data to identify global trends due to residency restrictions), (3) Shared disaster recovery across jurisdictions for financial services (UK financial data cannot replicate to EU for DR, must stay UK), (4) Cost efficiency through global consolidation (financial services stuck at higher cost due to forced jurisdiction-specific operations). COMPETITIVE PRESSURE: Financial services customers demand LOWEST COST due to margin pressure, but residency requirements force HIGH COST operations - Rackspace caught between customer price expectations and regulatory-driven cost structure, compressing margins.",
      "immutability_type": "CONDITIONAL (regulators MAY approve offshore processing with adequate safeguards, but practical reality is customers require local residency to avoid regulatory scrutiny)",
      "claim_type": "FACT (regulatory requirements) + INFERENCE (customer contract standards)",
      "evidence_sources": [
        "Stage 1.5: UK Sovereign Services launched March 2024 targeting FCA/PRA financial services customers",
        "UK FCA/PRA operational resilience regulations: Critical operations data residency requirements",
        "EU MiFID II and PSD2: Data protection and operational resilience requirements for financial services",
        "Rackspace March 27, 2024 announcement: 'alignment with regulatory compliance mandates, such as data residency, is a critical factor for financial institutions'",
        "FCA SYSC 8: Outsourcing rules allowing FCA oversight of service providers to regulated firms",
        "Stage 8.1: UK Sovereign architectural isolation, no global network connection"
      ]
    },
    {
      "data_or_workload": "Payment Card Industry (PCI) Cardholder Data",
      "locked_location": "No statutory geographic restriction, BUT customer contracts and card brand requirements create PRACTICAL jurisdiction-specific processing",
      "legal_or_contractual_basis": "INDUSTRY STANDARD + CONTRACTUAL: PCI DSS (Payment Card Industry Data Security Standard) v4.0 does NOT mandate specific geographic data residency, BUT: (1) Card brands (Visa, Mastercard) impose regional processing requirements in merchant agreements - e.g., European cardholder data must be processed by European acquiring banks unless merchant has specific approval, (2) Customers (merchants, payment processors) include data residency requirements in service provider contracts due to: card brand regional rules, local data protection laws (GDPR for EU cards), perceived liability reduction if breach occurs with local processing, (3) Regional card schemes (e.g., UnionPay China, RuPay India) explicitly require in-country processing for domestic transactions. TOUCH TEST: If cardholder data processed in unauthorized jurisdiction: (1) Card brand CONTRACT VIOLATION - merchant/acquirer faces penalties from Visa/Mastercard for violating regional processing rules ($5K-$500K per month per Stage 8.3), (2) Customer (merchant/processor) terminates Rackspace service provider contract for breach of PCI DSS cardholder data handling terms, (3) If breach occurs with cross-border processing, card brand fines INCREASE (card brands penalize 'out of region' breaches more severely than local breaches due to forensic complexity and regulatory coordination challenges), (4) Merchant/acquirer loses card brand authorization (cannot process Visa/Mastercard transactions, business destruction).",
      "operational_consequence": "FORCES: (1) Regional PCI DSS cardholder data environments - separate infrastructure for North America, Europe, APAC card processing (cannot consolidate globally even though technically one PCI DSS standard), (2) Regional security operations and compliance teams for cardholder data (PCI DSS forensic investigators, QSAs must be regionally available for breach response within 24-48 hours), (3) Regional disaster recovery for cardholder data (EU cardholder data cannot replicate to US for DR due to GDPR transfer restrictions + card brand regional rules). PROHIBITS: (1) Global cardholder data analytics (cannot analyze transaction patterns across regions to identify global fraud trends due to regional processing restrictions), (2) Consolidated payment security operations (cannot have single global SOC monitoring all cardholder data environments - must maintain regional SOCs), (3) Cross-border payment fraud prevention using global data (each region must develop fraud models using only regional data, less effective than global model would be). HIDDEN COST: Regional PCI DSS operations create 2-3x cost vs hypothetical global consolidated model, but cost is UNAVOIDABLE due to card brand rules and GDPR.",
      "immutability_type": "CONDITIONAL (PCI DSS allows global processing technically, but card brand contracts and GDPR create practical regional restrictions)",
      "claim_type": "FACT (card brand rules) + INFERENCE (cost impacts)",
      "evidence_sources": [
        "PCI DSS v4.0: No explicit geographic restriction, but cardholder data must be protected per standard",
        "Visa/Mastercard merchant agreements: Regional processing requirements for cardholder data",
        "Stage 8.3: Card brand fines $5K-$500K per month for violations, per-card breach penalties escalate to $200+ per card beyond 1M cards",
        "GDPR restrictions: EU cardholder personal data subject to Article 46 transfer restrictions",
        "Regional card schemes: UnionPay (China), RuPay (India) require in-country processing for domestic transactions",
        "Industry practice: Payment processors maintain regional infrastructure to comply with card brand rules and reduce breach liability"
      ]
    },
    {
      "data_or_workload": "Rackspace Internal Operations Data Touching Customer PII - HR, Billing, CRM, Security Logs",
      "locked_location": "VARIES by data subject jurisdiction - EU employee data must stay EU per GDPR, EU customer data in business systems subject to transfer restrictions, UK customer data subject to UK GDPR, etc.",
      "legal_or_contractual_basis": "STATUTORY (GDPR APPLIES TO PROCESSOR'S OWN OPERATIONS): Stage 8.2 documents Rackspace operates as 'processor' for customer data, BUT Rackspace is 'controller' for its OWN employee data and for customer personal data in Rackspace's business systems (CRM, billing, security incident logs). GDPR applies to: (1) Rackspace EU employee HR data (names, salaries, performance reviews, health information) - Rackspace is controller, must comply with GDPR including Article 46 transfer restrictions if data goes to US parent for payroll/benefits, (2) Customer contact information in Rackspace CRM/billing (customer employee names, emails, phone numbers) - if customers are EU data subjects, GDPR applies, transfer to US for sales/support operations requires valid mechanism, (3) Security incident logs containing customer IP addresses, usernames (personal data under GDPR) - Stage 8.2 documents incident data contains customer confidential information, if EU customers affected, GDPR restricts transfer to US security teams. TOUCH TEST: If Rackspace transfers EU employee data or EU customer PII in business systems to US without valid mechanism: (1) EU DPA enforcement against Rackspace as CONTROLLER (not just processor) - same €20M or 4% global revenue penalties, (2) EU employee works councils or data protection representatives can FILE COMPLAINTS to DPAs triggering investigations, (3) EU customers can SUE for breach of Data Processing Addendum if their contact information transferred unlawfully.",
      "operational_consequence": "FORCES: (1) Regional HR systems - EU employee data must be processed in EU-hosted HRIS, payroll, benefits systems (cannot use centralized US-based Workday/ADP instance for all global employees), (2) Regional CRM/billing systems - if EU customer contact data in Salesforce/ServiceNow, must use EU-hosted instances or implement valid transfer mechanisms (adds cost and complexity vs single global instance), (3) Regional security logging - EU customer incident data must be stored/analyzed in EU to avoid GDPR transfer restrictions (prevents global security team in US from analyzing all customer incidents together). PROHIBITS: (1) Consolidated global HR operations in US for efficiency (EU employees' data cannot be accessed by US HR without valid transfer mechanism), (2) Single global Salesforce/CRM instance (EU customer contact data triggers GDPR, requires EU data residency or valid transfers), (3) Centralized security operations analyzing all global customer incidents (EU customer data in logs subject to GDPR). HIDDEN BUSINESS IMPACT: Rackspace's OWN operations data is LESS MOBILE than generally assumed - not just customer data, but Rackspace's internal business systems are fragmented by jurisdiction, increasing operational complexity and cost.",
      "immutability_type": "CONDITIONAL (same as EU customer data - currently transferable via DPF, but DPF validity challenged)",
      "claim_type": "FACT",
      "evidence_sources": [
        "GDPR applies to Rackspace as controller for own employee data and customer PII in business systems",
        "GDPR Article 46: Applies to ALL controller international transfers including internal business operations",
        "Stage 8.2: Rackspace operates as processor for customer data but is controller for own operations data",
        "EU-US Data Privacy Framework covers business operations data transfers, under legal challenge per Stage 8.3",
        "Stage 8.2: Security incident data contains customer confidential information including personal data",
        "EU works councils: Can file complaints to DPAs on behalf of employees triggering investigations"
      ]
    }
  ]
}
