{
  "sub_stage": "3.5",
  "uncertainty_register": [
    {
      "unknown": "Hyperscaler partner program terms and credit structure details - actual discount percentages, tier requirements, program changes 2020-2024",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL - Stage 3.4 estimates partner credits declined from 20-25% to 10-15% causing 6-13% input cost increase and 30-65% gross margin compression, but estimates based on industry patterns not Rackspace-specific data. Actual credit levels determine: (1) Public Cloud segment true gross margins (if credits better than estimated 10-15%, margins higher than thought, if worse, margins lower/negative), (2) Vulnerability to further erosion (if currently at 15% with downside to 10%, vs currently at 10% with downside to 5% = different risk profiles), (3) Hyperscaler negotiating outcomes (did Rackspace successfully negotiate better terms than typical MSPs, or receiving worse due to competitive conflict with hyperscaler-direct). Difference affects valuation: Public Cloud segment worth materially more if 15% credits (potentially profitable) vs 10% credits (break-even) vs 5% credits (unprofitable, value destroyed).",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED - Request: (1) Hyperscaler partner agreements (AWS, Azure, Google) showing discount structure, volume tiers, credit percentages by service category (compute, storage, networking), (2) Historical partner program statements showing credit evolution 2020-2024 (trend line determines if erosion accelerating, stable, or plateauing), (3) Partner program requirements and performance metrics (what Rackspace must do to maintain current tier, risk of tier downgrade if requirements tighten). WITHOUT DATA: Use sensitivity analysis with PESSIMISTIC (5-10% credits, Public Cloud unprofitable), BASE (10-15% credits, low single-digit margins), OPTIMISTIC (15-20% credits, mid single-digit margins viable) scenarios. Given Rackspace competitive disadvantage vs hyperscaler-direct and industry trend of partner devaluation, weight analysis toward pessimistic case."
    },
    {
      "unknown": "VMware contract terms and price protection provisions - does Rackspace have any contractual defenses against further Broadcom increases?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL for Private Cloud segment viability - If Rackspace has NO price protection, Broadcom can increase prices AGAIN (already 200-300%, could go to 400-600% total = doubling from current levels), would make Private Cloud segment completely unviable (currently estimated 0-3% EBITDA, further increases create deep losses requiring immediate restructuring or exit). If Rackspace has SOME protection (price caps through 2026, committed discounts for volume, term commitments), provides 2-3 years breathing room to execute migration strategy (move customers to alternative platforms, wind down VMware dependency controlled manner). Affects timing and urgency: NO PROTECTION = immediate crisis (can't wait for orderly transition), PROTECTION THROUGH 2026-2027 = have time for managed wind-down (urgent but not immediate).",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS CRITICAL - Request: (1) VMware/Broadcom licensing agreements showing price terms, escalation clauses, term commitments (when do current agreements renew, what protections exist at renewal), (2) Communications with Broadcom regarding price increases (was 200-300% negotiated or imposed without discussion, what future increases threatened/projected), (3) VMware licensing audit results (Broadcom commonly conducts compliance audits post-acquisition finding 'violations' requiring true-up payments = backdoor price increase mechanism, any audits conducted or threatened). WITHOUT DATA: Assume PESSIMISTIC case (no material protections given Broadcom's aggressive extraction strategy post-acquisition, further increases likely) for base case, model scenario where Broadcom increases another 50-100% by 2026-2027 (400-500% total vs pre-Broadcom baseline) as stress case. Base case assumes current $100-210M VMware cost burden, stress case adds $50-105M more = $150-315M total (50-105% of Private Cloud segment revenue consumed by VMware alone = mathematically impossible to operate profitably)."
    },
    {
      "unknown": "Marketplace revenue percentage and growth rate - how much Rackspace revenue flows through hyperscaler marketplaces currently, and how fast is adoption growing?",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL for Public Cloud trajectory - Currently estimated 15-30% of Public Cloud revenue through marketplace (~$100-200M of $690M), growing to majority (50-70%) over 3-5 years. Actual penetration and growth rate determine: (1) Current margin impact (if 30% through marketplace at 3-7% fees = $6-14M annual cost, material to segment that generates estimated $21-35M EBITDA at 3-5% margins), (2) Future dependency urgency (if marketplace growing 50% annually, reaches 50% penetration by 2026, vs 25% annually reaches 50% by 2028-2029 = different timeline pressures), (3) Strategic response window (fast growth = little time to adapt, slow growth = more time to find alternatives, though alternatives don't exist). Affects forecasting: If marketplace penetration accelerating (doubling annually), Public Cloud segment faces IMMINENT margin compression crisis (2-3 years to dominant channel), vs gradual penetration gives 5-7 years transition period.",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED - Request: (1) Revenue by sales channel (marketplace vs direct sales vs referral partners) annually 2020-2024 showing marketplace penetration trend, (2) Customer procurement preference data (what percentage of NEW customers find Rackspace through marketplace vs other channels, what percentage of RENEWALS customers request marketplace vs direct), (3) Marketplace transaction fees paid to AWS/Azure/Google in 2023-2024 (actual cost vs estimated $3-14M). WITHOUT DATA: Use industry benchmark penetration curves (marketplace adoption typically follows S-curve: slow early adoption 2020-2022, inflection 2023-2024, rapid growth 2024-2027, plateau 2028-2030 at 60-80% penetration). Model BASE CASE of 15% current → 30% by 2025 → 50% by 2026 → 70% by 2028 (doubling every 18-24 months during growth phase). Apply 5% average marketplace fees to projected penetration to estimate margin impact: 2024: $7M, 2025: $10M, 2026: $17M, 2027: $24M, 2028: $24M (plateau)."
    },
    {
      "unknown": "Hyperscaler direct competitive approach intensity and targeting strategy - are AWS/Azure systematically targeting Rackspace customers, or opportunistic only?",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL for Public Cloud revenue forecasting - Stage 3.3 estimates $40-110M Public Cloud revenue at risk from hyperscaler targeting over 2-3 years (5-15% of base). If hyperscalers conducting SYSTEMATIC targeting (dedicated sales teams, CRM-driven outreach campaigns, coordinated approaches timed to Rackspace customer renewal cycles), upper bound $110M or MORE at risk with COMPRESSED timeline (could lose 10-15% base in 2-3 years = -$110-150M). If OPPORTUNISTIC only (account teams approach when naturally encountering Rackspace customer, no systematic program), lower bound $40M at risk with EXTENDED timeline (lose 5-7% base over 4-5 years = -$40-70M). Difference: SYSTEMATIC = existential threat requiring immediate response (accelerated transformation, urgent M&A, accept losses), OPPORTUNISTIC = serious but manageable threat allowing more gradual adaptation.",
      "what_would_reduce_uncertainty": "PARTIALLY REDUCIBLE through customer intelligence and competitive research - Management should provide: (1) Win/loss analysis showing lost opportunities to hyperscaler-direct over past 2 years (frequency, customer size patterns, timing relative to renewals), (2) Customer feedback on hyperscaler approaches (in renewal discussions, do customers mention receiving AWS/Azure direct outreach, how often, what offers), (3) Competitive intelligence from sales team (how often do hyperscaler account teams appear in competitive situations, are they proactive or reactive). EXTERNAL research: Interview former AWS/Azure enterprise account executives about managed services competitive strategy (are MSP customer targets priority, how much emphasis in sales training/quotas, are there dedicated MSP-displacement programs). WITHOUT ACCESS: Model TWO SCENARIOS - OPPORTUNISTIC (5% base over 4 years = $35M, CAGR -1.5%), SYSTEMATIC (12% base over 3 years = $100M, CAGR -4%). Given hyperscaler incentives (direct managed services generates more revenue than partner revenue) and Stage 3.2 identification as PRIMARY THREAT, weight toward SYSTEMATIC scenario (60% probability) vs opportunistic (40%)."
    }
  ]
}
