{
  "sub_stage": "4.4",
  "document_metadata": {
    "title": "Information Requests - Incentives & Accountability Unknowns",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-09"
  },
  "unknowns_requests": [
    {
      "request_id": "4.4-REQ-01",
      "priority": "CRITICAL",
      "unknown_addressed": "Incentive structure details by function—compensation formulas, performance metrics, measurement systems",
      "specific_request": "(1) Sales compensation structure: Bookings weight vs profitability weight in commission calculations, quota structures (individual/team/BU), performance review criteria (volume metrics vs margin metrics), any profitability gates or veto mechanisms, compensation mix (base/variable/equity), (2) Support performance measurement: SLA weight vs customer satisfaction weight in reviews, resolution quality metrics if any, cross-functional coordination metrics if any, escalation penalty metrics, activity vs outcome metric prioritization, (3) Operations measurement system: Incident response metrics (MTTD/MTTR weight), proactive work metrics if any, prevention investment allocation metrics if any, stability metrics in performance reviews, (4) Engineering performance criteria: Feature velocity weight vs operational stability weight, technical debt metrics if any, on-call/operational accountability if any, (5) BU President compensation: P&L weight, cross-functional coordination metrics if any, how P&L calculated (attributed revenues/costs), authority scope matching accountability",
      "why_material": "Cannot assess incentive misalignment magnitude without understanding specific incentive structures. Cannot design incentive reforms without knowing current formulas, weightings, measurement systems. Cannot predict personnel response to reforms without understanding current compensation levels and dependencies. Critical for determining whether execution drag addressable through incentive realignment or requires personnel changes/capability building."
    },
    {
      "request_id": "4.4-REQ-02",
      "priority": "HIGH",
      "unknown_addressed": "Execution drag value quantification—margin erosion, customer churn, incident costs attributable to incentive misalignment",
      "specific_request": "(1) Margin erosion attribution: Margin trends by customer/deal, correlation with sales comp changes, profitability distribution (profitable vs unprofitable customer mix), margin erosion rate before/after sales refresh Q3 2024, (2) Customer churn analysis: Churn rate trends, churn attribution (support quality vs product quality vs competitive alternatives), customer lifetime value impact from satisfaction decline, correlation between support metrics and churn, (3) Incident cost analysis: Total cost per incident type (ransomware, zero-day), prevention cost modeling (what would proactive controls have cost vs reactive response cost?), incident recurrence rates and trends, vendor dependency costs (ScienceLogic contract terms, external constraint costs), (4) Activity vs outcome metric value gap: Revenue impact from margin erosion (how much revenue unprofitable?), customer acquisition cost wasted on churned customers, incident response cost vs prevention cost differential",
      "why_material": "Cannot prioritize incentive/accountability reforms by ROI without quantifying value destruction. Need to assess which drag patterns most material: Sales drag through margin erosion? Support drag through churn? Operations drag through incident costs? Cannot justify reform investment without demonstrating value recovery potential. Critical for business case building and resource allocation prioritization."
    },
    {
      "request_id": "4.4-REQ-03",
      "priority": "HIGH",
      "unknown_addressed": "Personnel capability to operate under reformed incentive/accountability structure",
      "specific_request": "(1) BU President capability assessment: Prior roles and coordination experience, cross-functional management background, P&L management track record, authority exercised in prior roles (did they have deal approval, resource allocation, etc.?), (2) Support leadership capability: Does VP Support role exist (if so, why doesn't have authority per Stage 4.1 analysis)? Support management experience with cross-functional coordination, escalation resolution capability, (3) Sales profitability analysis capability: Sales organization experience with margin-based selling, cost estimation capability, value-based pricing vs volume-based selling background, (4) Operations prevention capability: Proactive security control design experience, risk management background, infrastructure automation capability, SRE/prevention methodology experience if any, (5) Leadership bench strength: Succession planning for key roles, internal promotion candidates vs external hiring needs, organizational learning programs if any",
      "why_material": "Structural reforms fail if personnel lack capability to operate under reformed structure. Need to assess whether incentive/authority realignment sufficient or requires simultaneous personnel augmentation (hiring, training). Critical for implementation planning—determines whether reform self-sufficient or requires extensive change management/capability building. Determines reform timeline and cost—capability gaps extend timeline and increase investment."
    },
    {
      "request_id": "4.4-REQ-04",
      "priority": "MEDIUM",
      "unknown_addressed": "Structural reform attempts history—what has been tried, why failed, what learned",
      "specific_request": "(1) Incentive reform history: Any compensation structure changes in past 5 years (sales, support, operations), outcomes and lessons learned, why discontinued if unsuccessful, (2) Accountability structure changes: 2023 reorganization details (was authority reallocated or only reporting structure changed?), any deal review board or governance creation attempts, any empowered coordinator role creation attempts, why failed or incomplete, (3) Measurement system changes: Any attempts to introduce outcome-based metrics (profitability, satisfaction, incident frequency), why not sustained if attempted, data infrastructure limitations preventing outcome measurement, (4) Cultural change initiatives: Any values/culture transformation programs, leadership development focused on coordination/collaboration, change management capacity and track record",
      "why_material": "History of reform attempts reveals organizational change capacity and constraints. If reforms attempted but failed, why? Capability deficit? Cultural resistance? Capital constraints? Leadership commitment insufficient? Understanding failure modes critical for designing successful reforms—avoid repeating past mistakes. Reveals organizational learning capacity—can learn from failures or doomed to repeat? Critical for realistic implementation planning and risk assessment."
    },
    {
      "request_id": "4.4-REQ-05",
      "priority": "MEDIUM",
      "unknown_addressed": "Board and executive leadership commitment to structural reform vs short-term financial optimization",
      "specific_request": "(1) Board expectations and patience: Board performance evaluation criteria for CEO (short-term financial results weight vs organizational capability building), Board willingness to accept short-term performance cost for long-term reform, Board composition and expertise (operational transformation experience?), (2) Executive leadership tenure and incentives: Current CEO tenure and expected duration, CEO compensation formula (short-term vs long-term incentive weight), executive team stability and turnover patterns, (3) Strategic priorities: Is operational transformation/capability building stated priority?, Resource allocation to transformation initiatives if any, trade-offs between short-term financial results and capability building, (4) Apollo expectations as 57% owner: Apollo investment thesis (financial engineering vs operational improvement), Apollo timeline and exit expectations, Apollo willingness to fund transformation investment",
      "why_material": "Structural reforms require multi-year commitment and short-term performance sacrifice. Board/leadership must have patience and commitment—otherwise reforms aborted mid-stream when quarterly results disappoint. Three CEOs in three years suggests Board lacks patience—critical barrier to reform. Apollo as 57% owner has decisive influence—if Apollo prioritizes short-term exit over capability building, reforms infeasible. Critical for assessing reform feasibility and determining whether to recommend structural transformation vs accept status quo with containment strategies."
    }
  ]
}
