{
  "sub_stage": "6.2",
  "document_metadata": {
    "title": "Uncertainty Register - Critical Unknowns in Cloud Dependency Reality",
    "target_entity": "Rackspace Technology, Inc.",
    "analysis_date": "2026-02-10",
    "scope": "Documentation of information gaps that create decision uncertainty in hyperscaler dependency and exit feasibility analysis"
  },
  "uncertainty_register": [
    {
      "unknown": "Exact hyperscaler partner program terms - discount percentages, rebate structures, specific requirements",
      "type": "UNKNOWN",
      "decision_impact": "Cannot precisely quantify Rackspace margin on Public Cloud services. Analysis uses estimates: AWS Advanced Partner ~5-15% credits/rebates, Azure CSP 2-Tier Distributor ~15% PEC (industry sources), Google Cloud Partner ~5-10% credits. Ranges are WIDE (2-3X variance) due to confidential partner agreements. Imprecision affects: (1) Margin compression risk assessment (how much cushion exists before unprofitable?), (2) Pricing power analysis (can Rackspace absorb hyperscaler price increases?), (3) Competitive positioning (are terms better/worse than other MSPs?). With precise partner terms, could model margin sensitivity more accurately. Without it, must use conservative assumptions increasing perceived vulnerability. Additionally, REQUIREMENTS for maintaining partner status are unknown - what revenue thresholds must Rackspace meet? What certification counts? What customer satisfaction scores? If Rackspace close to failing requirements, at risk of tier demotion (worse terms).",
      "what_would_reduce_uncertainty": "Access to: (1) AWS Partner Agreement (full contract with pricing schedules), (2) Microsoft Azure CSP 2-Tier Distributor Agreement (PEC rates, requirements, terms), (3) Google Cloud Partner Agreement, (4) Partner program performance dashboards (Rackspace's standing vs requirements). These agreements are STRICTLY CONFIDENTIAL - hyperscalers prohibit disclosure, partners sign NDAs. Would require company access during due diligence or hyperscaler channel checks (risky - might alert hyperscalers to transaction discussions)."
    },
    {
      "unknown": "Revenue split by hyperscaler (AWS vs Azure vs Google Cloud) and growth trends by provider",
      "type": "UNKNOWN",
      "decision_impact": "Public Cloud revenue is $1,683M but split between AWS/Azure/Google Cloud is UNDISCLOSED. Analysis uses estimates: AWS ~$500-700M (largest, AWS dominates public cloud market), Azure ~$500-700M (Microsoft enterprise relationships), Google Cloud ~$150-350M (smallest but growing). Ranges are WIDE - AWS could be 40% of Public Cloud or 25%, creates 2X variance. Uncertainty affects: (1) Dependency assessment (if AWS is 40% of Public Cloud = 24% of total revenue, single point of failure severity is HIGHER), (2) Exit cost prioritization (which hyperscaler to exit first if forced?), (3) Growth trajectory analysis (which partnerships are expanding vs declining?), (4) Risk concentration (over-dependence on single hyperscaler). Additionally, growth rates by provider unknown - is Google Cloud growing faster than AWS/Azure for Rackspace (suggesting market shift) or slower (suggesting competitive disadvantage)? Precision matters for strategic planning.",
      "what_would_reduce_uncertainty": "Public disclosure of: (1) Revenue by hyperscaler partner (AWS, Azure, Google Cloud separate line items), (2) Year-over-year growth by provider, (3) Customer count by provider (concentration risk). Rackspace does NOT break out Public Cloud revenue by provider in financial statements - reports only combined Public Cloud $1,683M. Competitive sensitivity likely prevents disclosure (don't want to reveal market position). Would require company access to internal revenue reporting or partner channel checks (ask hyperscalers for Rackspace's revenue through their programs - but hyperscalers may not share due to confidentiality)."
    },
    {
      "unknown": "Customer contract terms regarding cloud provider switching rights and price passthrough clauses",
      "type": "UNKNOWN",
      "decision_impact": "Cannot determine Rackspace's flexibility to respond to hyperscaler terms changes. If customer contracts include: (1) CLOUD PORTABILITY RIGHTS - customers can demand migration to different cloud if terms change, Rackspace bears migration cost and risk, (2) PRICE PROTECTION - customers have fixed pricing regardless of hyperscaler cost changes, Rackspace absorbs all infrastructure cost increases, (3) PASS-THROUGH CLAUSES - Rackspace can pass hyperscaler price changes to customers, reduces margin compression risk but increases churn risk. Contract mix unknown - what percentage have portability rights vs price protection vs pass-through? If 80% have pass-through clauses, hyperscaler price increases manageable (customer bears cost, some churn expected). If 80% have price protection, hyperscaler price increases CATASTROPHIC (Rackspace absorbs all costs, margin eliminated). Uncertainty affects: (1) Margin compression risk modeling, (2) Customer churn estimation, (3) Response optionality to hyperscaler terms changes.",
      "what_would_reduce_uncertainty": "Access to: (1) Sample customer Master Services Agreements (standard contract templates by customer segment), (2) Contract management system analysis (search for 'price', 'pass-through', 'infrastructure cost', 'cloud provider' clauses), (3) Legal counsel memo on contract term prevalence and enforceability, (4) Customer Success team interviews (how do customers typically respond to price increase requests?). Information exists in contract repositories but not publicly available. Would require due diligence data room access."
    },
    {
      "unknown": "Other managed service providers' partner program terms and comparative positioning",
      "type": "UNKNOWN",
      "decision_impact": "Cannot benchmark whether Rackspace receives competitive partner terms or is disadvantaged. If other large MSPs (e.g., Accenture, DXC Technology, Cognizant cloud services) receive BETTER partner terms (higher discounts, lower requirements), suggests: (1) Rackspace has weak negotiating position relative to peers, (2) Room exists for Rackspace to demand better terms (can point to peer terms as benchmark), (3) Competitive disadvantage - peers can undercut Rackspace pricing with same margin. If Rackspace receives BETTER terms than peers, suggests: (1) Rackspace has relatively strong position (may be due to scale, strategic value, or relationship quality), (2) Less downside risk from terms deterioration (already better than typical), (3) Competitive advantage in pricing. Without benchmarking data, cannot assess relative position - Rackspace terms could be at high end, middle, or low end of partner spectrum. Affects: (1) Negotiation strategy assessment, (2) Competitive position evaluation, (3) Terms change risk (if currently above-market terms, at risk of regression to mean).",
      "what_would_reduce_uncertainty": "Channel checks with: (1) Competitor MSPs (unlikely to share - confidential and competitive), (2) Hyperscaler partner managers (may share general ranges but not specific competitor terms - confidentiality), (3) Industry analysts (Gartner, Forrester may have survey data on typical partner economics but not company-specific), (4) Former employees of competitor MSPs (anecdotal information on partner program structures). Very difficult to obtain - partner terms are closely guarded competitive secrets. Best proxy: Industry analyst estimates of typical MSP gross margins (20-30% range suggests infrastructure costs ~70-80% of revenue, implying partner discounts ~5-15% range - consistent with Rackspace estimates but wide range)."
    },
    {
      "unknown": "Hyperscaler strategic intentions toward partner channel - expansion, maintenance, or contraction",
      "type": "UNKNOWABLE",
      "decision_impact": "Cannot predict whether hyperscalers will STRENGTHEN partner channel (increase investment, improve terms) or WEAKEN it (reduce benefits, poach customers more aggressively, ultimately disintermediate partners). Strategic direction determines Rackspace long-term viability: (1) EXPANSION scenario - Hyperscalers recognize limits of direct sales, invest in partner success, improve economics to incentivize partner growth = Positive for Rackspace, partnership sustainable long-term, (2) MAINTENANCE scenario - Hyperscalers keep partner channel stable at current state, neither expanding nor contracting = Neutral for Rackspace, can continue current model but no tailwinds, (3) CONTRACTION scenario - Hyperscalers gradually reduce partner role as direct sales capabilities improve, systematically disintermediate partners over 5-10 years = Negative for Rackspace, business model has limited remaining life. Evidence exists for ALL THREE scenarios: (1) Expansion signals - Growing partner program headcount, new partner tiers/benefits, co-innovation initiatives, (2) Contraction signals - Direct sales teams targeting partner customers, managed services competing with partners, partner program terms deteriorating. Mixed signals create uncertainty - which strategic direction will dominate?",
      "what_would_reduce_uncertainty": "Insights from: (1) Hyperscaler partner organization leadership (what is internal strategy? expanding or contracting partner role?), (2) Hyperscaler board/strategy documents (confidential - inaccessible), (3) Pattern analysis over 5+ years (are partner programs strengthening or weakening directionally?), (4) Industry trend analysis (how are competitors like Oracle, IBM Cloud, Alibaba Cloud treating partners?). Cannot eliminate uncertainty - hyperscaler intentions are INTERNAL STRATEGIC DECISIONS that can change with leadership, market conditions, competitive dynamics. Best approach: Scenario planning for all three outcomes, assess Rackspace viability under each scenario. UNKNOWABLE means must plan for adversarial scenario (contraction/disintermediation) as prudent risk management even if not currently visible."
    },
    {
      "unknown": "VMware (Broadcom) future pricing trajectory and licensing model stability",
      "type": "UNKNOWABLE",
      "decision_impact": "VMware already imposed 200-300% price increase 2023-2024 creating $100-210M annual cost shock (Stage 6.2 cloud dependency map). FUTURE MOVES UNKNOWN: (1) Will Broadcom increase prices FURTHER (compounding existing shock)? (2) Will licensing model change again (eliminate perpetual licenses, force subscription, change metrics)? (3) Will Broadcom offer selectively lower pricing to retain largest customers while maintaining high pricing for smaller customers like Rackspace? (4) Will Broadcom prioritize hyperscalers (AWS, Azure, Google Cloud running VMware on their infrastructure) over traditional providers like Rackspace? Uncertainty affects: (1) Private Cloud business model viability - if prices increase another 50-100%, Private Cloud becomes unprofitable or uncompetitive, (2) Customer retention - customers already facing Rackspace price increases to pass through VMware costs, additional increases may trigger mass exodus, (3) Exit urgency - if VMware costs continuing to rise, exit becomes MORE URGENT but also more expensive (migration costs increase with scale). Broadcom's strategy appears EXTRACTIVE (maximize revenue from installed base) but exact trajectory unknown - could stabilize at current levels or continue increasing.",
      "what_would_reduce_uncertainty": "Insights from: (1) Broadcom investor communications (guidance on VMware pricing strategy, revenue expectations), (2) VMware/Broadcom account team discussions (what is Rackspace's relationship quality? any indications of future changes?), (3) Industry pattern analysis (how has Broadcom treated other acquired properties? what is typical price increase trajectory?), (4) Customer feedback (are other VMware customers seeing similar increases? any getting better terms?). Cannot eliminate uncertainty - Broadcom is private company post-acquisition, limited transparency, pricing strategy is competitive secret. Prudent assumption: VMware costs will NOT DECREASE and may increase further - plan for worst case. UNKNOWABLE means must develop exit strategy from VMware dependency even if immediate execution infeasible, position for long-term shift to alternative platforms."
    },
    {
      "unknown": "Customer churn rate elasticity to price increases - what percentage of customers churn per 10% price increase?",
      "type": "UNKNOWN",
      "decision_impact": "Critical for modeling response to hyperscaler or VMware cost increases. If churn elasticity is LOW (5% churn per 10% price increase), Rackspace can pass most cost increases to customers with acceptable revenue impact. If churn elasticity is HIGH (20% churn per 10% price increase), passing cost increases causes unacceptable revenue loss - better to absorb costs and accept margin compression. Churn elasticity determines optimal strategy: (1) Low elasticity = pass-through strategy viable, (2) High elasticity = absorption strategy required (but may be unsustainable financially). Additionally, elasticity may vary by customer segment - enterprise customers with deep integrations may have LOW elasticity (switching costs too high), small/medium customers with simple deployments may have HIGH elasticity (easy to switch). Segment mix determines aggregate elasticity. Without elasticity data, cannot optimize pricing strategy - forced to guess at customer response and may choose wrong approach (over-price causing excess churn OR under-price leaving margin on table).",
      "what_would_reduce_uncertainty": "Analysis of: (1) Historical price increase events (when Rackspace increased prices previously, what churn resulted? what was elasticity?), (2) Customer surveys (stated willingness to accept price increases vs actual behavior may differ), (3) Competitive benchmarking (what are customer switching costs to move to hyperscaler-direct or competitor MSP?), (4) Cohort analysis (which customer segments are most price-sensitive?). Would require access to: (1) Pricing history and customer retention data, (2) Customer Success team institutional knowledge (which price increases worked? which failed?), (3) Win/loss analysis (why do customers leave Rackspace? is price primary factor or secondary?). Information exists in CRM systems and revenue operations but not publicly disclosed."
    }
  ],
  "uncertainty_impact_assessment": {
    "high_impact_unknowns": [
      "VMware future pricing trajectory (affects Private Cloud viability, $1,055M revenue at risk)",
      "Customer churn elasticity to price increases (determines response strategy to cost shocks)",
      "Exact hyperscaler partner program terms (affects margin precision and compression risk, 61% revenue exposed)"
    ],
    "medium_impact_unknowns": [
      "Revenue split by hyperscaler (affects risk concentration and dependency assessment)",
      "Customer contract price protection vs pass-through mix (affects flexibility to respond to cost increases)",
      "Other MSPs' partner terms (affects competitive positioning assessment)"
    ],
    "low_impact_unknowns": [
      "Hyperscaler strategic intentions toward partner channel (directionally important but doesn't change immediate constraints)"
    ],
    "overall_confidence_despite_uncertainties": "HIGH (80-85%) on DIRECTIONAL conclusions despite unknowns. Uncertainties affect PRECISION (exact margin percentages, exact churn rates, exact future costs) but NOT DIRECTION (cloud dependencies are asymmetric and inescapable, exit is economically irrational, hyperscalers have structural power advantages). Wide estimation ranges capture uncertainty appropriately - partner program benefits 5-15% (3X range), hyperscaler revenue splits ±40% variance, customer churn 30-50% (1.7X range), VMware cost impact $100-210M (2X range). Directional findings ROBUST to uncertainty: (1) Multi-cloud is fiction - exit from any provider infeasible (true across all plausible parameter values), (2) Dependency is asymmetric - Rackspace 61% dependent, hyperscalers <0.5% dependent (true even with revenue measurement error), (3) Power imbalance is structural - hyperscalers set terms unilaterally (true regardless of exact current terms), (4) VMware shock is material - $100-210M range all material to $2,738M revenue base and constrained finances (Stage 5). Precision would improve decisions at margin (which hyperscaler to exit first? exactly how much price increase is tolerable?) but strategic assessment already clear - Rackspace has COMPREHENSIVE, INESCAPABLE, ASYMMETRIC cloud dependencies with LIMITED COUNTERMEASURES. Additional information would refine tactics not change strategy."
  },
  "unknowable_vs_unknown_distinction": {
    "unknown": "Information that EXISTS but is not accessible to external analysis. Examples: Partner agreement terms (exist in contracts but confidential), Revenue by hyperscaler (exists in internal reporting but not disclosed), Customer contract terms (exist in contract database but not public). Could be obtained through: Company access during due diligence, Regulatory filings if required, Channel checks with partners/customers, Freedom of Information requests for government contracts. TIME and ACCESS resolve unknowns.",
    "unknowable": "Information about FUTURE INTENTIONS and DECISIONS that do not yet exist. Examples: Hyperscaler strategic direction toward partners (will be decided by future hyperscaler leadership based on future market conditions), VMware future pricing moves (will be decided by Broadcom based on future revenue targets and competitive pressures), Customer future churn behavior (depends on future alternatives, economic conditions, competitive offerings). Cannot be obtained through ANY current access - requires PREDICTION not DISCOVERY. Scenario planning and probabilistic reasoning required - must consider multiple futures and assess Rackspace viability under each. UNCERTAINTY and OPTIONALITY matter more than precision.",
    "implications": "Unknowns can be reduced through due diligence - negotiate access to confidential data, conduct detailed channel checks, perform customer research. Unknowables CANNOT be reduced through investigation - must be managed through: (1) Scenario planning (plan for multiple futures), (2) Option preservation (maintain flexibility to respond to different outcomes), (3) Hedging strategies (reduce exposure to unknowable risks), (4) Adaptive execution (monitor signals and adjust as information emerges). Due diligence should focus on RESOLVING UNKNOWNS (get partner agreements, customer contracts, internal financial data) while ACKNOWLEDGING UNKNOWABLES (cannot predict hyperscaler strategic shifts but can assess vulnerability to different scenarios). Unknowables often have HIGHER IMPACT than unknowns - future strategic changes (unknowable) more consequential than current term details (unknown)."
  }
}
