{
  "sub_stage": "3.2",
  "unknowns_requests": [
    {
      "priority": "CRITICAL",
      "unknown": "Customer churn attribution by competitive destination (hyperscaler-direct vs low-cost MSP vs insourcing vs other)",
      "why_decision_critical": "Determines which competitive threats are materializing fastest and require immediate response vs theoretical future threats. Stage 2.1 shows 21% net revenue leakage but attribution is unknown - could be 15% to hyperscaler-direct + 5% to low-cost/insourcing + 1% other, OR could be 5% hyperscaler-direct + 10% low-cost + 6% insourcing. Different distributions require different responses. If hyperscaler-direct is 60-70% of churn (primary threat), must focus retention efforts on hyperscaler competitive positioning. If distributed across multiple vectors (no single dominant threat), indicates broad commoditization requiring different strategy. Material to threat prioritization and response resource allocation.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Customer churn analysis by stated reason for departure (from exit interviews or surveys), (2) Identification of departing customer destinations where known (which competitor or insource?), (3) Win/loss analysis from competitive renewal situations showing competitor types and frequency, (4) Sales team competitive intelligence reports on threat vectors by segment. This is standard customer analytics that retention-focused organizations maintain. Request last 12-24 months data to show trends.",
      "fallback_if_unavailable": "If management data unavailable, pursue: (1) Customer interviews or surveys (if accessible) asking about alternatives evaluated, (2) Industry research on MSP customer migration patterns (consulting firm reports, analyst surveys), (3) Channel checks with peer MSPs about their churn attribution patterns, (4) Use Stage 2.4 churn rate estimates and Stage 3.2 threat vector analysis to MODEL attribution: Assume 40-50% to hyperscaler-direct, 20-30% to low-cost/offshore, 15-25% to insourcing, 10-15% other based on threat vector materiality assessment. Use modeled attribution for scenario analysis with wide sensitivity ranges acknowledging high uncertainty."
    },
    {
      "priority": "CRITICAL",
      "unknown": "Hyperscaler direct managed services growth rates and customer acquisition sources (stealing from MSPs vs net new customers)",
      "why_decision_critical": "Determines whether hyperscaler-direct threat is accelerating (growing faster than cloud market) vs stable (growing with market). If AWS Managed Services and Azure Managed Services growing 30-50% annually while cloud market growing 15-20%, indicates ACTIVE CUSTOMER ACQUISITION potentially from MSPs, threat accelerating rapidly. If growing 15-20% in line with market, threat exists but not accelerating. Also determines if hyperscaler direct services are winning MSP customers (substitution) vs winning net new customers MSPs couldn't reach (expansion). Substitution is DIRECT THREAT to Rackspace, expansion is neutral. Material to threat urgency assessment and timeline to business impact.",
      "information_request": "REQUEST: Research of hyperscaler financial disclosures and analyst reports: (1) AWS Managed Services revenue and growth rates (may be disclosed in AWS earnings details or investor presentations), (2) Azure Managed Services growth (Microsoft Azure earnings segmentation), (3) Google Cloud Managed Services metrics, (4) Analyst reports estimating hyperscaler direct managed services market share and growth, (5) Customer case studies from hyperscaler direct services showing customer type (new to cloud vs existing MSP customer). Much of this may be available publicly or through industry analysts without management access.",
      "fallback_if_unavailable": "If hyperscaler direct services metrics unavailable publicly, use PROXY INDICATORS: (1) Hyperscaler partner program changes (reducing credits, tightening requirements suggests direct services becoming strategic priority), (2) Hyperscaler direct managed services hiring trends (LinkedIn job postings growth indicates scaling), (3) Customer references and case studies from hyperscaler marketing materials, (4) Industry analyst estimates of managed services market share (Gartner, Forrester may track hyperscaler vs MSP splits). Assume BASE CASE: Hyperscaler direct services growing 25-35% annually (faster than cloud market 15-20% suggests active customer acquisition including from MSPs), use conservative case 20-25% and aggressive case 35-50% for scenarios."
    },
    {
      "priority": "HIGH",
      "unknown": "Rackspace win/loss analysis by competitor type and customer segment showing which competitive threats are winning head-to-head",
      "why_decision_critical": "Identifies which competitive threats are CURRENT (winning deals today) vs FUTURE (expected but not yet material). Win/loss data shows: Are hyperscalers winning renewals? Are low-cost MSPs winning new customer acquisitions? Are integrated vendors (IBM, Oracle) winning enterprise strategic accounts? Different patterns indicate different threat priorities and response strategies. Also reveals if threats are segment-specific (e.g., low-cost winning SMB, hyperscalers winning enterprise, integrated vendors winning large strategic) enabling targeted responses vs broad-based threats requiring company-wide strategy. Material to understanding competitive positioning reality vs theoretical threat assessment.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Win/loss database showing lost opportunities by competitor, customer segment, deal size, loss reason, (2) Competitive renewal analysis showing which competitors appear in renewal situations and win rates, (3) New customer acquisition competitive analysis showing alternatives customers evaluated, (4) Sales team win/loss debriefs identifying competitive differentiation gaps. This is standard sales operations data. Request 12-24 months data covering minimum 50-100 competitive situations for statistical significance.",
      "fallback_if_unavailable": "If win/loss data unavailable, infer from: (1) Customer interviews about alternatives evaluated (primary research), (2) Industry competitive intelligence from analyst firms tracking MSP market, (3) Sales team interviews (if accessible) about competitive situations, (4) RFP responses showing competitors and pricing (if accessible through customers or channel). Without direct data, rely on STRUCTURAL ANALYSIS from Stage 3.2: Assume hyperscalers are primary threat in Public Cloud renewals (40-60% of competitive losses), low-cost in SMB/mid-market new customer (30-40% of competitive losses), integrated vendors in large enterprise (20-30% of losses). Use structural threat assessment as proxy for competitive outcomes."
    },
    {
      "priority": "HIGH",
      "unknown": "Customer evaluation of Rackspace vs hyperscaler-direct alternatives - what factors drive decision to stay vs migrate?",
      "why_decision_critical": "Identifies Rackspace's actual defensibility (what REALLY keeps customers vs what Rackspace THINKS keeps customers). If customers stay primarily due to: Migration effort/cost (switching friction), Rackspace provides TEMPORARY PROTECTION until customers justify migration investment. If customers stay due to: Service quality/relationship (genuine loyalty), Rackspace has SUSTAINABLE advantage worth investing in. If customers stay due to: Lack of awareness of alternatives (inertia), Rackspace is VULNERABLE to customer education by hyperscalers. Different retention drivers require different strategies. Reveals whether 'Fanatical Support' brand actually drives retention (sustainable) or retention is pure inertia/switching costs (fragile).",
      "information_request": "REQUEST: Customer research through: (1) Customer satisfaction surveys including 'likelihood to switch' and 'alternatives considered', (2) Customer interviews asking 'why stay with Rackspace vs going direct to AWS/Azure?', (3) Exit interviews with churned customers about decision factors, (4) Renewal negotiation insights from account teams about customer objections and concerns. Requires primary customer research, ideally third-party conducted for honest feedback (customers may not be candid with Rackspace directly about considering alternatives).",
      "fallback_if_unavailable": "If customer research unavailable, infer from BEHAVIORAL EVIDENCE: (1) Stage 2.4 shows retention is 'STRUCTURAL not earned through superior service' (customers stay due to switching costs not service quality), indicating fragile retention, (2) Stage 2.1 shows 21% net leakage despite 'Fanatical Support' brand indicating brand insufficient, (3) Stage 2.4 high churn in low-lock-in segments (15-40%) proves retention driven by switching costs not loyalty, (4) Stage 3.2 LOW response flexibility suggests Rackspace lacks sustainable differentiation. CONCLUSION from evidence: Retention is primarily INERTIA and SWITCHING COSTS (fragile) not SERVICE QUALITY or LOYALTY (sustainable). Customers stay until migration effort justified, then leave."
    },
    {
      "priority": "MODERATE",
      "unknown": "AWS UK Sovereign Cloud launch timeline, service availability, and go-to-market strategy",
      "why_decision_critical": "Determines viability timeline for Rackspace UK Sovereign segment. If AWS launches 2025 with aggressive customer acquisition and full service portfolio, Rackspace UK Sovereign growth narrative collapses within 12-18 months (customers choose AWS over Rackspace for brand/breadth/resources). If AWS delayed to 2026-2027 or launches with limited services, Rackspace has 2-3 year window to establish market position. UK Sovereign is Rackspace's ONLY GROWTH INITIATIVE per Stage 2.1, failure threatens entire business narrative (company is terminal decline with no growth offset). Material to strategic assessment of whether growth option exists vs pure harvest/exit scenario.",
      "information_request": "REQUEST: Competitive intelligence research on AWS UK Sovereign Cloud: (1) AWS public announcements, press releases, partner communications about launch timeline and service roadmap, (2) UK government procurement discussions and RFPs mentioning AWS UK Sovereign as qualified option (indicates expected availability), (3) AWS hiring in UK data center operations and sales (indicates launch preparation), (4) Industry analyst reports (Gartner, Forrester, 451 Research) tracking AWS UK Sovereign development. MANAGEMENT ACCESS: Rackspace UK Sovereign sales team intelligence from customer conversations ('waiting for AWS' comments indicate timing expectations).",
      "fallback_if_unavailable": "If specific AWS launch timeline unavailable, use REASONABLE ASSUMPTIONS based on AWS historical patterns: (1) AWS announced UK Sovereign Cloud publicly (2023-2024 timeframe), typically 12-24 months from announcement to full operation, suggests 2024-2025 launch window, (2) AWS GovCloud (US) took ~18 months from announcement to broad availability, similar timeline likely for UK Sovereign, (3) UK data sovereignty requirements are complex (architectural isolation, regulatory approvals), may add 6-12 months vs standard region launch. ESTIMATED TIMELINE: Pilot customers 2024, broad availability 2025-2026, material competitive threat to Rackspace by late 2025. Use 2025-2026 as base case with 2024 (early) and 2027 (delayed) as sensitivity scenarios."
    }
  ]
}
