{
  "sub_stage": "7.4",
  "document_metadata": {
    "title": "Orphaned Data Domains - Material Data with No Clear Ownership or Accountability",
    "analysis_date": "2026-02-15"
  },
  "orphaned_data_domains": [
    {
      "data_domain": "Customer identity reconciliation—enterprise customer count truth across CRM, billing, support systems",
      "why_orphaned": "NO SINGLE OWNER ACROSS SYSTEM-SPECIFIC DEFINITIONS. Sales owns CRM customer data (accounts, contacts, relationships), finance owns billing customer data (revenue-generating accounts), support owns engagement customer data (active support relationships)—but NO OWNER for enterprise customer count reconciliation or cross-system identity resolution. Gap between system-specific ownership and enterprise stewardship. No Chief Data Officer, no customer data steward role identified. No operating committee or data governance committee with reconciliation mandate (Stage 7.1 H7.1-B governance void, Stage 4.1 coordination infrastructure absent). Orphaned through ORGANIZATIONAL DESIGN GAP not oversight—no role chartered with cross-system customer truth responsibility. Functions control own definitions optimizing locally (sales maximizes CRM for territory sizing, finance reports billing for revenue alignment, support tracks engagement for operational planning) without enterprise reconciliation forcing function. CEO could assign owner but hasn't—customer count ambiguity tolerated indefinitely (Stage 7.3 customer identity tolerance), no crisis forcing ownership assignment (unlike margin erosion forcing walk away policy, satisfaction decline forcing external platforms). Political cost of ownership assignment high—forcing reconciliation requires definitional consensus (functions must agree on single customer truth or adopt new shared definition), one function's count declines (CRM inflated count reduced to billing reality, territories shrink, quotas harder), historical metrics restated (comparability disrupted, investor questions). Ownership assignment deferred because political cost high and crisis cost low (ambiguity tolerated without visible failure triggering intervention).",
      "risk_created": "PERSISTENT CUSTOMER METRICS UNRELIABILITY WITH COMPOUNDING STRATEGIC CONSEQUENCES. Customer lifetime value (LTV) calculations vary by definition—sales LTV based on CRM count N, finance LTV based on billing count M where M < N, support operational planning based on engagement count K where K ≠ M, enterprise LTV truth contested, valuation models inconsistent. Churn rate accuracy impossible—churn = lost customers / total customers, denominator varies by definition (Stage 7.3 customer identity tolerance), churn rate 5% using CRM count but 7% using billing count (if M < N materially), retention strategy targets unclear (which customers at risk?), churn forecasting unreliable for revenue planning. Resource allocation misalignment—sales territories sized on CRM count N, support staffing sized on engagement count K, if N ≠ K materially then either sales under-supported (territories too large for support capacity) or support over-staffed (support capacity exceeds sales coverage), operational efficiency compromised by metric misalignment. Investor communications risk—external customer count may not match internal operational reality, if later discovered (M&A diligence, analyst deep-dive, auditor questions), guidance credibility damaged, historical restatement potential if external count materially inaccurate. M&A valuation risk—acquirer demands customer count reconciliation during diligence, discovers material variance, questions which count accurate for valuation purposes, may revalue on conservative count (if billing M significantly < CRM N, acquirer values on M reducing purchase price), may require customer data quality representation (representation impossible if unreconciled, warranty/indemnity implications). Competitive intelligence gap—competitors know Rackspace customer base reality through win/loss analysis and market research, Rackspace lacks clear view of own customer base through internal metric fragmentation, competitors exploit information asymmetry. ORPHANED STATUS PERPETUATES RISK—no owner means no mandate to fix, no accountability for consequences, ambiguity persists until crisis forces ownership (M&A diligence discovers variance, major customer publicly questions metrics, regulatory filing requires reconciliation for specific disclosure), reactive ownership assignment post-crisis more expensive than proactive stewardship.",
      "evidence_sources": ["Stage 7.3 customer identity error tolerance parallel definitions N ≠ M ≠ K indefinite", "Stage 7.4 blame flow customer counts orphaned no owner no blame", "Stage 7.2 customer identity transformation fragmentation", "Stage 7.1 customer count/churn contested domain parallel truths", "Stage 4.1 no operating committee coordination infrastructure", "Stage 7.1 H7.1-B governance void no data governance committee"]
    },
    {
      "data_domain": "Customer satisfaction systematic measurement—enterprise NPS/CSAT program with internal accountability",
      "why_orphaned": "NO CLEAR OWNER ACROSS POTENTIAL STEWARDS. Support could own satisfaction for service interactions (post-ticket CSAT), customer success could own satisfaction for account health (relationship satisfaction), marketing could own satisfaction for brand perception (brand health NPS)—but no single function clearly owns ENTERPRISE CUSTOMER SATISFACTION STEWARDSHIP with measurement mandate and Board/CEO reporting accountability. Support incentivized on SLA not satisfaction (Stage 4.4 controllable activity metric not uncontrollable outcome), customer success role authority unclear or under-resourced (no visible customer success executive or committee Stage 4.1), marketing uses brand claims without systematic validation ('Fanatical Support' without satisfaction data Stage 7.3 satisfaction tolerance). No Chief Customer Officer consolidating satisfaction ownership identified. Orphaned through ACCOUNTABILITY AVOIDANCE not oversight—satisfaction measurement exposes functions to outcome accountability currently avoided through activity metric optimization, measurement reveals activity-outcome divergence (SLA met but satisfaction declining Stage 7.2 Pattern 1), no function volunteers for accountability tightening, CEO doesn't mandate because satisfaction crisis hasn't forced intervention (unlike margin erosion forcing walk away policy). Truth EXTERNALIZED TO CUSTOMERS—Rackspace learns satisfaction from external platforms (Trustpilot 'consistently worse' 2024, BBB complaints, Gartner reviews) not internal systematic measurement, reactive recipient of satisfaction feedback not proactive owner. Three CEOs three years none built satisfaction infrastructure—consistent deprioritization across CEO tenures suggests systemic orphaning not individual CEO oversight (Stage 4.5 talent constraints).",
      "risk_created": "STRATEGIC BLINDNESS TO CUSTOMER EXPERIENCE DETERIORATION WITH RETENTION CONSEQUENCES. Churn risk invisible—satisfaction leading indicator of churn unavailable, churn discovered reactively when customer cancels (revenue lost) not proactively when satisfaction declines (intervention possible to prevent churn), customer success/account management operating without early warning system for at-risk accounts. Service quality investment misallocated—investment targets internal priorities (SLA improvement, cost reduction, efficiency) not customer pain points (satisfaction drivers unmeasured, investment doesn't address actual customer needs), ROI suboptimal (investment optimizes wrong metrics). Brand-reality gap widens—'Fanatical Support' marketing increasingly contradicted by external satisfaction platforms ('consistently worse' 2024), brand damage if gap becomes publicly visible (analysts note satisfaction issues, competitors highlight in marketing, major customer public complaint damages brand), marketing investment wasted if brand promise undeliverable. Competitive disadvantage—competitors with satisfaction measurement can: (1) Target Rackspace weaknesses (competitors survey ex-Rackspace customers, learn switching reasons, market against identified weaknesses), (2) validate own service quality (competitors NPS benchmarking proves superiority if Rackspace lacks comparable data), (3) prioritize retention investment (competitors identify at-risk customers proactively, Rackspace discovers churn reactively losing retention battle). Internal-external divergence—operations optimistic based on SLA compliance (internal confidence high), customer reality pessimistic based on experience (external satisfaction declining), divergence creates false confidence preventing quality intervention until churn accelerates. M&A diligence exposes gap—acquirer conducts independent customer satisfaction surveys discovering: (1) Satisfaction lower than Rackspace claimed (if Rackspace made claims without data) or lower than Rackspace believed (if Rackspace internally optimistic), (2) churn risk higher than modeled (satisfaction predicts churn, low satisfaction increases churn forecast), valuation adjustment for retention risk, (3) post-close satisfaction measurement mandate as integration requirement (acquirer requires NPS program, satisfaction accountability, measurement infrastructure investment). ORPHANED STATUS DELAYS INTERVENTION—no owner means deterioration discovered late (external platforms surface after prolonged decline), no internal escalation path for satisfaction issues, intervention reactive (post-churn customer win-back) not proactive (pre-churn satisfaction improvement).",
      "evidence_sources": ["Stage 7.3 satisfaction measurement error tolerance gap indefinite truth externalized", "Stage 7.4 blame flow satisfaction orphaned no owner no blame", "Stage 7.1 uncertainty satisfaction measurement practices unknown", "Trustpilot 'consistently worse' 2024 external deterioration", "Stage 7.2 support performance transformation SLA-satisfaction drift", "Stage 4.4 support incentive SLA-based not satisfaction-based", "'Fanatical Support' brand claims without validation", "Three CEOs three years none built satisfaction infrastructure"]
    },
    {
      "data_domain": "Deal profitability validation at CRM entry—gap between sales opportunity creation and delivery cost reality",
      "why_orphaned": "OWNERSHIP GAP BETWEEN SALES CRM ENTRY AND DELIVERY EXECUTION DISCOVERY. Sales owns CRM opportunity entry and qualification (controls what opportunities created, how valued, when forecasted to close), delivery owns execution and actual cost discovery (discovers technical complexity, customization requirements, operational overhead post-signature). But PROFITABILITY VALIDATION AT ENTRY orphaned—gap between sales entry (T1 in transformation chain Stage 7.2) and delivery reality discovery (T3 post-signature). No owner for CRM-profitability alignment validation before deal commitment. No deal review board validating profitability assumptions before sales proceeds (Stage 7.1 H7.1-B governance void, Stage 4.1 coordination infrastructure absent no deal review board). Sales lacks incentive to tighten validation—profitability validation delays sales cycle (delivery cost estimation adds weeks-months), reduces pipeline volume (marginal deals rejected at entry not post-signature), threatens quota achievement (bookings volume declines if profitability filter applied upfront Stage 4.4 sales incentive bookings-based). Delivery lacks authority to validate pre-sale—delivery consulted for technical feasibility but not empowered to reject deals for profitability concerns, delivery discovers cost reality post-signature after sales booked revenue (authority-accountability gap Stage 4.1 delivery absorbs margin erosion but no deal rejection authority). Finance receives data from both (sales CRM forecast, delivery actual costs) but doesn't own validation—finance reports aggregate margins, applies conservative adjustment to forecasts (Stage 7.2 finance adjustment methodology), but doesn't validate individual deal profitability at entry. CEO becomes reactive validator through walk away policy Q4 2024—but CEO validation episodic (CEO bandwidth limits systematic validation Stage 4.2 bottleneck), case-by-case (criteria undocumented Stage 7.1 uncertainty), post-booking (walk away policy rejects deals sales already signed, wasted sales effort). Orphaned through AUTHORITY-ACCOUNTABILITY MISALIGNMENT (Stage 4.1)—sales has entry authority but delivery absorbs profitability accountability, gap creates orphaned validation domain.",
      "risk_created": "SYSTEMATIC MARGIN EROSION WITH RECURRING DEAL PROFITABILITY FAILURES. Margin deterioration—CRM systematically overstates profitability by 13-15 percentage points (Stage 7.3 deal profitability tolerance), margin erosion to -13% Private Cloud / -3% Public Cloud before CEO intervention Q4 2024, prolonged period of negative-margin deal acceptance eroding enterprise profitability, debt covenant risk ($1.3B debt Stage 5, negative cash flow from operations Q2 2024, margin pressure threatens covenant compliance). Resource misallocation—hiring, capacity planning, investment based on inflated CRM pipeline value (Stage 7.3 error tolerance), resources allocated to unprofitable deals (delivery executes losing contracts), opportunity cost (resources diverted from profitable opportunities to unprofitable execution). Sales effort waste—sales pursues opportunities CEO later rejects (walk away policy), sales cycle effort (prospecting, qualification, proposal, negotiation, contracting) wasted when CEO filters post-signature, sales unpredictability (sales cannot anticipate CEO rejection, closing confidence undermined). Customer relationship damage—deals accepted by sales then walked away by CEO (Q4 2024 policy rejects renewals/opportunities), customer experiences Rackspace commitment reversal, relationship trust damaged, competitive vulnerability (rejected customer approaches competitors). Wasted delivery pre-deployment effort—between contract signature and CEO walk away decision, delivery may begin deployment work (architecture, provisioning, configuration), effort wasted when deal rejected, delivery bandwidth consumed by doomed deals. Investor guidance risk—if CRM pipeline used for revenue forecasting and pipeline systematically overstates profitability, guidance accuracy questionable, forecast miss risk, investor confidence damage. M&A valuation uncertainty—acquirer diligence discovers CRM-profitability gap, questions pipeline quality for valuation purposes (what percentage of pipeline truly profitable?), may discount pipeline value materially (if 13-15% overstatement systematic, acquirer discounts pipeline), earnout provisions affected (if earnout based on revenue achievement from pipeline, CRM unreliability increases earnout risk). ORPHANED STATUS ENABLES PROLONGED DETERIORATION—validation gap unaddressed for years (margin erosion Q1-Q3 2024 before Q4 policy intervention), walk away policy treats symptoms (filters deals reactively) not causes (validation gap at entry persists, methodology unchanged, orphaned domain continues), pattern likely recurs if CEO policy lapses or CEO transitions (three CEOs three years suggests policy non-transferable Stage 4.5).",
      "evidence_sources": ["Stage 7.3 deal profitability error tolerance 13-15% overstatement CRM entry", "Stage 7.4 blame flow deal profitability orphaned pre-Q4 2024 until CEO intervention", "Walk away policy Q4 2024 reactive validation", "Sales refresh Q3 2024 personnel not methodology", "Stage 4.1 authority-accountability gap delivery no deal rejection authority", "Stage 4.4 sales incentive bookings-based not profitability-based", "Stage 7.1 H7.1-B governance void no deal review board", "Stage 5 margin erosion -13%/-3% debt covenant risk"]
    },
    {
      "data_domain": "Incident recurrence prevention accountability—gap between operations response ownership and prevention stewardship",
      "why_orphaned": "OPERATIONS OWNS RESPONSE, PREVENTION ORPHANED ACROSS FUNCTIONS. Operations owns incident response—detection (MTTD), response (MTTR), resolution, root cause analysis—and exercises this ownership successfully (response capability strong Stage 7.3 incident frequency tolerance). But INCIDENT PREVENTION ACCOUNTABILITY orphaned between: Operations (system reliability engineering, operational excellence), delivery (architectural resilience, redundancy design, failure isolation), vendor management (third-party dependency risk mitigation Stage 6 vendor dependencies), security (vulnerability management, patch management, threat prevention). No single prevention steward consolidating cross-functional prevention mandate. No incident review board analyzing recurrence patterns and assigning prevention accountability (Stage 7.1 H7.1-B governance void). Prevention requires coordination across operations-delivery-vendors-security, but coordination infrastructure absent (Stage 4.1 no operating committee, no coordinators, CEO bottleneck prevents systematic cross-functional prevention management Stage 4.2). Operations incentivized on response capability metrics (MTTD/MTTR Stage 4.4) not prevention outcomes (incident frequency reduction, recurrence elimination)—incentive misalignment creates prevention orphaning. Incident frequency not systematically measured (Stage 7.3 incident frequency tolerance tracking absent)—measurement gap means prevention ROI unknown, prevention investment unjustifiable without frequency/cost data, prevention deprioritized. Blame externalization when incidents recur—ransomware multi-month, zero-day Sept 2024 recurrence blamed on external threats/vendors/resources (Stage 7.4 blame flow operations praised for response not blamed for prevention), blame avoidance removes pressure to assign prevention ownership. Orphaned through INCENTIVE MISALIGNMENT AND MEASUREMENT ABSENCE—response praised and measured (MTTD/MTTR controllable and visible), prevention unmeasured and blame-externalized (frequency not tracked, recurrence normalized), organizational attention follows incentives/measurement creating prevention orphaning.",
      "risk_created": "PERSISTENT INCIDENT RECURRENCE WITH CUMULATIVE CUSTOMER/REGULATORY RISK. Customer experience degradation—ransomware recurs multi-month, zero-day exploited Sept 2024, customers experience repeated service disruptions despite 'strong incident response' claims (Stage 7.3 incident tolerance capability-frequency conflation), customer confidence in operational stability eroded, competitive vulnerability (customers question Rackspace reliability, consider alternatives). Regulatory compliance risk escalation—FedRAMP authorization questioned if incident recurrence pattern indicates inadequate preventive controls (incident response capability insufficient without prevention, FedRAMP audit may find controls ineffective), HIPAA breach risk if incidents expose PHI repeatedly (recurrence indicates systemic control gaps not isolated incidents, HHS enforcement action risk), PCI DSS compliance questioned if payment processing incidents recur (merchant account risk, forensic investigation costs). Security posture deterioration—if ransomware recurs persistently, attackers learn Rackspace vulnerable and targeting intensifies (Rackspace becomes known soft target, attack frequency increases), if zero-day vulnerability exploited Sept 2024, vulnerability management gaps exposed (patching insufficient, threat intelligence inadequate, security control bypassed), security reputation damage (industry peers/customers view Rackspace as security-immature if recurrence public). Operations cost accumulation—repeated incident response more expensive than prevention (response costs: incident manager time, escalation resources, customer communications, post-incident analysis, root cause investigation—recurring for each incident), prevention investment ROI positive if response costs exceed prevention costs, but ROI unknown without frequency measurement (Stage 7.3 incident frequency uncertainty). Prevention investment deprioritization—without prevention owner advocating, prevention competes with operational priorities unfavorably (response urgent/visible, prevention deferrable/invisible), capital constraints ($1.3B debt Stage 5) prioritize debt service over prevention infrastructure (redundancy, vendor diversification, security tooling), prevention systematically under-invested. M&A diligence exposes pattern—acquirer reviews incident history, discovers recurrence (ransomware multi-month, zero-day exploited), questions prevention capability despite response strength, may require post-close prevention infrastructure investment (architectural resilience, vendor dependency reduction Stage 6, security controls) as integration condition, may discount valuation for operational stability risk from incident recurrence. ORPHANED STATUS ENABLES RECURRENCE NORMALIZATION—no prevention owner means recurrence accepted as operational reality not failure requiring accountability, prevention gaps unaddressed (ransomware recurs because prevention not owned, zero-day exploited because vulnerability management not systematically owned across security-operations-vendors), normalization persists until regulatory action or major customer loss forces prevention ownership assignment reactively.",
      "evidence_sources": ["Stage 7.3 incident frequency error tolerance recurrence tolerated prevention orphaned", "Stage 7.4 blame flow operations response praised prevention orphaned", "Ransomware multi-month recurrence", "Zero-day vulnerability Sept 2024", "Stage 6 vendor dependencies third-party incident risk", "Stage 4.1 coordination infrastructure absent no operating committee", "Stage 4.4 operations incentive response metrics not prevention outcomes", "Stage 7.1 H7.1-B governance void no incident review board", "Stage 5 capital constraints prevention investment limited"]
    },
    {
      "data_domain": "Support ticket escalation path systematization and executive resolution recording—gap between ticketing system ownership and escalation process stewardship",
      "why_orphaned": "SUPPORT OWNS TICKETING SYSTEM, ESCALATION PROCESS ORPHANED. Support owns ticketing system—ticket creation, routing, assignment, resolution tracking, SLA measurement. But CUSTOMER ESCALATION PATH and EXECUTIVE RESOLUTION PROCESS orphaned between: Support (initial ticket handling), account management (customer relationship, escalation receipt), executives (CEO, VPs handling escalations manually Stage 7.3 support ticketing tolerance), customer success (if exists—role unclear). No single owner for escalation path design, escalation resolution process, escalation recording in ticketing system. No operating committee or customer experience governance defining escalation standards (Stage 7.1 H7.1-B governance void, Stage 4.1 coordination infrastructure absent). Escalation path informal—customers escalate to BBB, social media, direct CEO contact because systematic escalation mechanism absent (BBB complaints 'cannot reach CEO' indicate path unclear), escalation handled ad-hoc by whoever receives customer contact. Executive resolution unrecorded—CEOs/VPs resolve escalations outside ticketing system (resolution occurs via email, phone, direct contact), ticketing system not updated with resolution (Stage 7.3 support ticketing tolerance executive escalations unrecorded), support metrics exclude executive interventions (SLA compliance calculated on recorded tickets only, executive resolutions invisible). Support lacks incentive to systematize—escalation recording degrades support metrics (resolution time increases if executive intervention included, SLA compliance declines, resolution rates fall Stage 7.3 touch test), support benefits from incompleteness (metrics preserved through data gap). CEO lacks bandwidth to systematize—CEO handles escalations reactively consuming bandwidth (Stage 4.2 CEO bottleneck worsened by escalation workload), CEO lacks capacity to design/implement systematic escalation process, three CEOs three years prevents escalation process institutionalization (each CEO handles escalations personally, process not transferred across CEO transitions Stage 4.5). Orphaned through MEASUREMENT THEATER PROTECTION—systematizing escalations exposes support metric limitations (activity-outcome divergence: SLA met but escalations necessary Stage 7.2 Pattern 1), support avoids systematization protecting metrics, CEO tolerates ad-hoc handling while bandwidth available, orphaning persists until escalation volume exceeds CEO capacity forcing systematization.",
      "risk_created": "CUSTOMER EXPERIENCE INCONSISTENCY WITH EXECUTIVE BANDWIDTH CONSUMPTION AND BRAND DAMAGE. Customer experience inconsistency—customers with executive access (large accounts, persistent complainers, BBB/social media escalators) receive resolution, customers without executive access (small accounts, non-escalators) may remain unresolved, inequitable service quality by customer persistence/size not need. Customer effort required—customers must escalate outside support to achieve resolution (BBB complaint, CEO direct contact necessary), 'Fanatical Support' brand promise contradicted by escalation necessity (support should resolve without escalation, reality requires customer extra effort), brand-reality gap damages credibility (Stage 7.3 satisfaction tolerance brand contradiction). Executive bandwidth consumption—CEO handles escalations manually consuming strategic leadership capacity (Stage 4.2 CEO bottleneck worsened, CEO time diverted from strategy/operations to customer firefighting), escalation handling may contribute to CEO turnover (three CEOs three years, CEO burnout from operational escalation workload possible Stage 4.5 talent constraints). Support metric misleadingness—SLA compliance, resolution rates exclude executive interventions creating false performance picture (metrics suggest support effective, reality includes escalations indicating support gaps Stage 7.3 support ticketing tolerance measurement theater), support investment decisions based on misleading metrics (support staffing, training, process based on incomplete data, misallocated or insufficient). Escalation volume growth risk—if customers learn executive escalation achieves resolution, escalation volume increases (word-of-mouth, BBB complaint patterns, social media visibility creating escalation knowledge diffusion), CEO bandwidth exceeded, escalations unhandled or delayed, customer dissatisfaction accelerates. Churn risk from escalation handling failures—if escalation volume exceeds CEO capacity, escalations not resolved promptly, customer cancels due to unresolved issue, churn from support quality gaps invisible in support metrics (support reports SLA met, customer churns due to escalation failure, churn cause misattributed). M&A diligence discovers escalation pattern—acquirer surveys customers, discovers escalation frequency higher than support metrics suggest, questions support quality and customer satisfaction, may revalue for churn risk, may require post-close escalation process systematization (escalation path defined, escalation recording mandated, support accountability for escalation reduction). ORPHANED STATUS ENABLES PERSISTENCE—no escalation owner means systematization deferred (support avoids for metric protection, CEO tolerates for bandwidth reasons while capacity available), escalation pattern continues consuming CEO bandwidth, customer experience gaps persist, brand damage accumulates (BBB complaints, Trustpilot decline), systematization forced only when CEO bandwidth exceeded or M&A diligence exposes gap.",
      "evidence_sources": ["Stage 7.3 support ticketing error tolerance escalations unrecorded while CEO bandwidth available", "Stage 7.4 blame flow support not blamed CEO absorbs workload", "BBB complaints customers 'cannot reach CEO' escalation path unclear", "Stage 4.2 CEO bottleneck escalation handling bandwidth consumption", "Stage 4.1 coordination infrastructure absent no escalation governance", "Stage 7.2 manual override pattern executive resolution unlogged", "Three CEOs three years escalation workload contribution to turnover", "Stage 7.3 selective enforcement support metrics exclude escalations measurement theater"]
    }
  ],
  "synthesis_notes": "Five material data domains identified as ORPHANED—no clear ownership or accountability. Orphaning patterns: (1) CROSS-SYSTEM GAPS: Customer identity reconciliation orphaned between sales (CRM), finance (billing), support (engagement)—no enterprise steward consolidating. Deal profitability validation orphaned between sales (entry) and delivery (execution)—no bridge owner validating CRM-profitability alignment. (2) CROSS-FUNCTIONAL GAPS: Incident prevention orphaned between operations (reliability), delivery (architecture), vendors (dependencies), security (vulnerabilities)—no prevention coordinator. Support escalation process orphaned between support (ticketing), account management (relationships), executives (resolution)—no escalation steward. (3) OUTCOME MEASUREMENT GAPS: Customer satisfaction measurement orphaned—no owner for enterprise NPS/CSAT despite multiple potential stewards (support, customer success, marketing), measurement absence protects functions from outcome accountability. Orphaning mechanisms: (1) Accountability avoidance—functions avoid ownership of difficult domains (satisfaction measurement exposes activity-outcome divergence, profitability validation delays sales cycle, prevention harder than response), orphaning through non-volunteering. (2) Authority fragmentation—domains requiring cross-functional coordination orphaned when coordination infrastructure absent (no operating committee Stage 4.1, no governance committees Stage 7.1 H7.1-B), CEO bottleneck prevents cross-functional stewardship (Stage 4.2). (3) Measurement absence—domains without measurement lack accountability basis (incident frequency unmeasured means prevention ROI unknown Stage 7.3, satisfaction unmeasured means outcome accountability impossible), measurement gaps enable orphaning. (4) Blame externalization—when domains fail, blame externalized (incident recurrence blamed on threats not prevention, satisfaction decline blamed on market not service) or diffused (customer count contested but no function blamed), lack of blame removes pressure to assign ownership. (5) Political cost avoidance—CEO avoids ownership assignment when politically expensive (customer count reconciliation forces definitional consensus creating conflict, satisfaction measurement exposes multiple functions to accountability tightening), deferral until crisis forces assignment. Orphaning consequences: Persistent problems without resolution (customer metrics unreliable indefinitely, incident recurrence continues, satisfaction deteriorates unaddressed), strategic blindness (churn risk invisible without satisfaction, margin erosion prolonged without profitability validation, prevention gaps unquantified without frequency tracking), M&A valuation uncertainty (orphaned domains exposed during diligence, acquirer demands ownership assignment or discounts for unmanaged risk). Orphaning structural causes: Governance void (Stage 7.1 H7.1-B no committees assigning cross-functional ownership), coordination infrastructure absence (Stage 4.1 no operating committee, no coordinators bridging functional gaps), CEO bottleneck (Stage 4.2 CEO lacks bandwidth for ownership design, reactive crisis management not proactive stewardship assignment), three CEOs three years (Stage 4.5 ownership assignment non-transferable across CEO transitions, orphaning persists institutionally)."
}
