{
  "sub_stage": "4.4",
  "document_metadata": {
    "title": "Execution Drag Patterns - Rackspace Technology, Inc.",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-09"
  },
  "execution_drag_patterns": [
    {
      "drag_pattern": "Sales maximizes bookings volume at expense of delivery profitability—rational under sales incentive but destroys business value",
      "how_drag_manifests": "Sales pursues deal volume maximization: Books deals without profitability validation, accepts customer requirements creating delivery complexity, negotiates pricing below true cost, commits to timelines delivery cannot meet. Each individual deal decision rational for sales rep (increases commission, meets quota) but aggregate effect destroys business value through margin erosion (Private Cloud -13%, Public Cloud -3%).",
      "why_behavior_rational": "Sales compensation tied to bookings volume/revenue (not delivered profitability). Sales rep maximizing personal compensation rationally maximizes bookings regardless of profitability. Sales rep captures upside (commission) immediately upon booking. Delivery absorbs downside (margin erosion, execution difficulty) post-signature—externality to sales. No penalty to sales for unprofitable deals—moral hazard. Quarterly/annual quotas create urgency to book deals even if marginal/unprofitable—end-of-period gaming. Career progression rewards top bookings—sales reps competing on volume not value.",
      "systemic_cost": "Delivery capacity consumed executing unprofitable deals—less capacity for profitable customers. Margin destruction: Private Cloud -13%, Public Cloud -3% FY2024. Customer execution failures from under-resourced unprofitable accounts—churn risk. Revenue growth sacrificed for profitability—Q4 2024 walk away policy rejects renewals, FY2024 -7% revenue decline. Delivery team morale degradation—forced to execute impossible commitments. Competitive position erodes—cannot invest in differentiation when margins consumed by unprofitable deals.",
      "why_drag_persists": "Sales organization resists profitability accountability—argues veto authority slows deal closure (competitive disadvantage). Sales management evaluated on team bookings—management rational to defend sales autonomy. Sales refresh Q3 2024 replaced personnel but not incentive structure—treats symptom not cause. Walk away policy Q4 2024 reactive (CEO intervention after crisis) not proactive (sales incentive realignment). Changing incentive structure complex: Requires delivered profitability measurement by deal (data infrastructure may not exist), creates conflict over attribution when deals modified post-signature, reduces sales compensation in short term (retention risk).",
      "touch_test": "What if sales incentive realigned to delivered profitability (not bookings)? Sales behavior would change: Conduct profitability validation pre-signature, negotiate pricing reflecting true delivery cost, walk away from unbuildable deals proactively. But transition painful: Short-term sales compensation reduction (fewer unprofitable deals booked), sales attrition risk from comp changes, potential revenue decline during transition (fewer deals overall), measurement complexity (how attribute margin to specific deals when delivery shared across customers?). Walk away policy Q4 2024 demonstrates feasibility—deals can be rejected when profitability prioritized. But CEO intervention required—indicates sales won't self-regulate without incentive change.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: Sales on bookings not profitability",
        "Margin erosion: Private Cloud -13%, Public Cloud -3%",
        "Q4 2024: CEO walk away policy (reactive)",
        "Q3 2024: Sales refresh (personnel not incentive change)",
        "FY2024: Revenue -7% (walk away impact)",
        "Stage 4.1: Sales has booking authority, delivery lacks veto",
        "Stage 4.2: Sales-delivery negative-value cascade"
      ]
    },
    {
      "drag_pattern": "Support optimizes SLA response time at expense of issue resolution—rational under support incentive but degrades customer satisfaction",
      "how_drag_manifests": "Support responds within SLA timeframe (15min/1hr/4hr) without resolving customer issue. Support rational behaviors: Respond quickly with incomplete information (meets SLA, defers resolution), Close/transfer tickets to maintain throughput (meets processing metric, passes coordination burden), Avoid complex cross-functional issues requiring extended resolution time (reduces measured response time variance), Optimize measurable activity (response time) over unmeasurable outcome (resolution quality).",
      "why_behavior_rational": "Support staff measured on SLA compliance—performance reviews, escalations, team metrics tied to response time adherence. Responding within SLA earns credit regardless of resolution. Resolution requires cross-functional coordination (billing, delivery, engineering) over which support lacks authority (Stage 4.1: no VP Support). Complex issue resolution time unbounded—support cannot guarantee resolution timeline so rationally avoids commitment. Support staff individual performance optimization: Process maximum tickets with minimum time per ticket—resolution attempts reduce throughput. Career progression rewards SLA compliance not resolution rate.",
      "systemic_cost": "Customer satisfaction declining: Trustpilot 'consistently getting worse' 2024, BBB 'dozens of engineers' but issues unresolved. Support staff heroics (informal coordination) burning capacity—unsustainable, burnout risk. Customer churn from unresolved issues—revenue impact. 'Fanatical Support' brand promise eroding—competitive differentiation lost. Organizational learning impossible—support processing tickets without understanding root causes, so systemic issues persist. Support escalation queue lengthening as complex issues deferred—backlog accumulation.",
      "why_drag_persists": "Support lacks authority to change measurement system—SLA metrics imposed by management/contracts. Creating resolution-based metrics complex: Resolution quality subjective (requires customer satisfaction surveys), resolution attribution difficult (cross-functional coordination makes single owner unclear), resolution timeline unbounded (cannot guarantee when other functions respond). SLA metrics simple: Objectively measurable, directly controllable by support, contractually specified (customer SLAs may mandate response times). Organization optimizes what it measures—SLA measured continuously, resolution measured sporadically/never. Support heroics mask severity—informal coordination achieves eventual resolution preventing complete failure, delaying recognition that measurement broken.",
      "touch_test": "What if support measured on resolution rate and customer satisfaction (not SLA response time)? Support behavior would change: Prioritize complex issue resolution over ticket throughput, invest in cross-functional coordination process, escalate authority gaps to force structural fixes, track root causes to drive systemic improvements. But transition requires: Resolution measurement infrastructure (satisfaction surveys, resolution tracking), support authority over cross-functional coordination (VP Support role creation), customer SLA renegotiation (replace response time SLAs with resolution time SLAs—may resist). BBB 'dozens of engineers' indicates support already attempting resolution despite incentive misalignment—suggests would embrace outcome-based measurement if created.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: Support on SLA response not resolution",
        "Stage 4.2: SLA met, satisfaction declining",
        "Trustpilot: 'consistently getting worse' 2024",
        "BBB: Dozens of engineers involved, issues unresolved",
        "Stage 4.1: No VP Support, support lacks authority",
        "Stage 4.3: Support absorbing coordination failures through heroics",
        "Activity vs outcome metric divergence (Stage 4.2)"
      ]
    },
    {
      "drag_pattern": "Operations prioritizes reactive incident response over proactive prevention—rational under operations incentive but increases incident frequency",
      "how_drag_manifests": "Operations optimizes incident response metrics (MTTD/MTTR): Maintains 24/7 on-call rotation, builds incident runbooks and response procedures, trains crisis mobilization, allocates capacity to reactive troubleshooting. Operations rational behaviors: Prioritize immediate incident response (visible, urgent, rewarded), Defer proactive investments (infrastructure hardening, monitoring automation, vendor dependency elimination—invisible, non-urgent), Heroic crisis response earns recognition (all-hands mobilization, executive visibility), Proactive work invisible until incident prevented (but prevented incidents uncountable).",
      "why_behavior_rational": "Operations measured on incident response speed (MTTD/MTTR) not prevention (incident frequency reduction). Incident response visible: Executive attention during crisis, customer communication requirements, all-hands mobilization creates organization-wide awareness. Incident prevention invisible: Successful prevention means nothing happens—no executive attention, no visibility, no recognition. Proactive investment uncertain ROI: Cannot prove counterfactual (how many incidents would have occurred without investment?), Requires multi-year investment with delayed benefit, Capital allocation prioritizes immediate visible needs over future invisible prevention. Career progression rewards crisis response heroics not prevention—firefighting visible, fire prevention invisible.",
      "systemic_cost": "Incident recurrence: Ransomware multi-month impact, zero-day monitoring offline Sept 2024. Reactive spending pattern—each incident forces spending exceeding proactive prevention cost (Stage 4.2). Vendor dependencies create external constraints: ScienceLogic zero-day remediation timeline controlled externally. Regulatory risk: FedRAMP, HIPAA/HITRUST require proactive controls—reactive-only posture creates authorization risk. Operations team burnout from crisis cycles—extended incident hours unsustainable. Technical debt accumulation as infrastructure investment deferred—increases future incident likelihood. Customer trust erosion from recurring incidents.",
      "why_drag_persists": "Operations lacks authority to change measurement system—incident response metrics imposed by management. Creating prevention metrics complex: Incident frequency influenced by factors beyond operations control (engineering feature stability, security vulnerabilities, vendor issues), Prevented incidents uncountable (counterfactual measurement problem), Proactive investment ROI uncertain (multi-year payback, cannot guarantee incident elimination). Budget process prioritizes reactive spending: Incident creates immediate crisis forcing budget allocation, proactive investment deferrable (no immediate consequence). No CRO or proactive risk advocate (Stage 4.1)—operations voice insufficient against finance cost control. Each incident resets proactive investment cycle—crisis spending crowds out prevention budget before accumulation.",
      "touch_test": "What if operations measured on incident frequency reduction (not response speed)? Operations behavior would change: Invest in proactive controls (monitoring, automation, infrastructure hardening), eliminate vendor dependencies creating constraints, build automated prevention rather than manual response, track incident root causes to drive systemic fixes. But transition requires: Multi-year investment with uncertain counterfactual ROI, CRO or proactive risk authority with budget allocation power, measurement infrastructure tracking incident trends and prevention effectiveness, executive patience accepting short-term prevention cost for long-term frequency reduction. Reactive spending pattern shows capital available during crisis—reallocating to proactive feasible but requires budget process change.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: Operations on response speed not prevention",
        "Stage 4.2: Reactive spending pattern—incidents displace proactive",
        "Stage 4.1: No CRO, reactive risk posture only",
        "Ransomware multi-month impact, zero-day monitoring offline Sept 2024",
        "ScienceLogic vendor dependency creates external constraint",
        "Stage 4.3: Operations absorbing risk failures reactively",
        "Capital constrained: $1.3B debt limits proactive investment"
      ]
    },
    {
      "drag_pattern": "Engineering prioritizes feature velocity over operational stability—rational under engineering incentive but increases incident frequency and technical debt",
      "how_drag_manifests": "Engineering optimizes feature delivery: Maximizes story points completed, maintains release cadence, delivers customer-requested features. Engineering rational behaviors: Ship features meeting functional requirements without operational hardening (testing, monitoring, scalability validation deferred), Accept technical debt to accelerate delivery (refactoring, infrastructure investment postponed), Deprioritize operational stability work (unglamorous, no immediate customer value, invisible until incident), Optimize measured performance (feature velocity) over unmeasured (stability).",
      "why_behavior_rational": "Engineering measured on feature velocity: Story points, release cadence, roadmap delivery. Product roadmap prioritizes features—customer requests, competitive parity, revenue opportunities dominate. Operational stability work invisible: No customer requests for stability (until incident occurs), no competitive pressure (competitors not measured on stability), no immediate revenue impact. Engineering career progression rewards features shipped: Promotion criteria include launched products, shipped capabilities, delivered roadmap—not prevented incidents or maintained stability. Operations absorbs stability failures—incident response is operations problem not engineering problem, externalizes cost of instability.",
      "systemic_cost": "Operational stability degrading (inference from incident pattern). Monitoring degradation: Sept 2024 dashboards offline during zero-day incident. Incident recurrence: Ransomware, zero-day, customer complaints suggest pattern. Technical debt accumulation: Deferred infrastructure investment constrains future velocity—'interest payments' on debt consume engineering capacity. Operations team capacity consumed reactive incident response (Stage 4.3)—reduces operations capacity for proactive work. Customer trust erosion from operational instability. Regulatory risk: Operational incidents create FedRAMP, HIPAA/HITRUST authorization jeopardy.",
      "why_drag_persists": "Engineering lacks accountability for operational stability—measured on features not stability. Operations lacks authority to block unstable releases (Stage 4.1)—can request delay but cannot enforce. Product management lacks operational representation—no voice advocating stability over features. Creating stability accountability requires cultural change: SRE model with error budgets, engineering on-call for production incidents, stability metrics in performance reviews. Resistance likely: Engineering argues operations responsible for stability, product argues customers prioritize features, finance argues stability investment delays revenue-generating features. Technical debt invisible until crisis—accumulates slowly, surfaces suddenly creating incident forcing reactive response.",
      "touch_test": "What if engineering accountable for operational stability (SRE model with error budgets)? Engineering behavior would change: Invest in monitoring, testing, infrastructure hardening before shipping features, Build automated controls rather than manual operations procedures, Carry pager for production incidents—creates skin in the game, Track stability metrics (error rates, latency, availability) alongside feature velocity. But transition requires: Authority reallocation—operations must have veto over unstable releases OR engineering must carry operational accountability, Measurement infrastructure—error budgets, stability metrics, incident attribution, Cultural change—engineering career progression must reward stability alongside features. Google SRE model demonstrates feasibility but requires multi-year transformation.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: Engineering on features not stability",
        "Stage 4.1: Operations lacks authority over engineering priorities",
        "Stage 4.3: Operations absorbing stability failures reactively",
        "Sept 2024: Monitoring dashboards offline during incident",
        "Ransomware multi-month impact, incident pattern suggests recurrence",
        "Technical debt inference from incident pattern",
        "Engineering/operations separation creates accountability void"
      ]
    },
    {
      "drag_pattern": "BU Presidents escalate cross-functional conflicts to CEO rather than coordinate directly—rational when lacking authority but creates CEO bottleneck",
      "how_drag_manifests": "BU Presidents escalate cross-functional issues to CEO: Sales prioritization conflicts, shared services capacity allocation, technology platform roadmap disputes, resource conflicts across BUs. BU Presidents rational behaviors: Escalate rather than negotiate (CEO has authority, BU Presidents don't), Avoid resource conflicts with peer BUs (reduces coordination cost, maintains relationships), Optimize within BU control scope (local decisions, avoid cross-BU dependencies), Wait for CEO decision rather than coordinate directly (reduces wasted negotiation effort when CEO may override).",
      "why_behavior_rational": "BU Presidents accountable for P&L but lack cross-functional authority (Stage 4.1). Direct coordination with peers ineffective—peer BU Presidents lack authority to commit their functions. Sales organization doesn't report to BU President—cannot compel sales prioritization. Shared services (IT, security, finance, legal) don't report to BU President—cannot direct allocation. Technology platform centralized—BU President cannot unilaterally change roadmap. Escalation rational: CEO has authority to resolve conflicts, BU President negotiation without authority wastes effort, escalation preserves relationship with peers (CEO makes unpopular decision not peer). Career progression may reward not rocking boat—avoiding peer conflicts, delivering within constraints, not pushing boundaries.",
      "systemic_cost": "CEO serial bottleneck (Stage 4.2): Organizational throughput limited by CEO coordination capacity. Decision delays accumulate: CEO queue lengthens, execution stalls waiting for CEO adjudication. Three CEOs in three years: Coordination load unsustainable, CEO turnover creates coordination collapse as informal networks break. BU local optimization without enterprise optimization: BUs optimize within control scope, forego cross-BU synergies requiring coordination. Strategic focus impossible: CEO consumed by operational coordination—adjudicating BU conflicts rather than setting strategy. Organizational fragility: Execution dependent on CEO personal intervention not repeatable process.",
      "why_drag_persists": "BU Presidents lack authority so escalation rational—cannot fix behavior without fixing authority gap. Creating BU President authority requires: Delegating sales direction to BU Presidents (sales organization resists—argues cross-BU sales coordination necessary), Allocating shared services to BUs (creates duplication/inefficiency), Giving BU Presidents technology roadmap authority (creates platform fragmentation risk). CEO retains authority because delegation risky: BU conflicts may intensify without resolution mechanism (no operating committee), BU Presidents may lack coordination capability (untested), delegation requires CEO relinquish control (uncomfortable when business struggling). Each new CEO inherits authority architecture—bottleneck recreates regardless of CEO individual capability.",
      "touch_test": "What if BU Presidents granted authority matching accountability? BU behavior would change: Coordinate directly with peer BU Presidents (no CEO escalation), Negotiate resource allocation across BUs, Make autonomous decisions within BU scope, Optimize enterprise outcomes not just local BU. But introduces risks: BU conflicts may intensify without CEO adjudication (requires operating committee), BU Presidents may lack coordination skills (capability uncertain), Suboptimal enterprise decisions from BU local optimization (requires enterprise governance). Three CEOs three years indicates CEO bottleneck unsustainable—structural change necessary even if introduces new risks.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 4.1: BU Presidents lack authority despite P&L accountability",
        "Stage 4.1: CEO sole cross-functional coordinator",
        "Stage 4.2: CEO serial bottleneck limits throughput",
        "Three CEOs three years (Jones, Maletira, Kandiah)",
        "2023 reorganization created BU structure without authority reallocation",
        "Accountability void: BU P&L accountability without coordination authority",
        "Escalation behavior inference from authority gap"
      ]
    },
    {
      "drag_pattern": "Finance allocates budget to measurable activity metrics rather than unmeasurable outcome drivers—rational under finance incentive but starves execution effectiveness",
      "how_drag_manifests": "Finance prioritizes budget allocation to measurable activities: SLA compliance (support headcount), sales force size (400+ reps), ticket processing capacity, headcount targets. Finance rational behaviors: Fund activities with predictable cost and measurable output (minimizes budget variance), Avoid discretionary investments with uncertain ROI (proactive risk controls, governance infrastructure, coordination process), Enforce cost discipline uniformly (across-the-board cuts rather than prioritization), Optimize budget variance (actual vs plan) over execution effectiveness (outcomes delivered).",
      "why_behavior_rational": "Finance measured on budget control: Budget variance, cost discipline, forecast accuracy, cash flow management ($1.3B debt creates genuine constraint). Activity metrics simple to measure: SLA compliance, sales headcount, ticket volume captured in existing systems—budget allocation directly maps to metric achievement. Outcome metrics complex: Customer satisfaction requires surveys, delivered profitability requires margin analysis by customer, resolution quality requires complaint tracking—data infrastructure may not exist. Finance rationally funds measurable over unmeasurable: Measurable budget outcomes predictable (can forecast precisely), unmeasurable creates variance (uncertain whether investment achieves outcome). Career progression rewards budget discipline: CFO evaluated on cost control, hitting financial targets, managing debt covenants—not execution outcome delivery.",
      "systemic_cost": "Resource allocation misaligned with outcomes: Support funded for SLA not resolution—SLA met, satisfaction declining. Sales funded for bookings not profitability—bookings maintained, margins eroding. Operations funded for response not prevention—response capable, incidents recurring. Underinvestment in execution enablers: Governance infrastructure (operating committee, deal review board), coordination process (empowered coordinators), proactive risk controls (prevention budget), operational stability (monitoring, automation). Financial metrics stable (budget variance controlled) while business deteriorates: Revenue -7%, margins -13%/-3% FY2024. Competitive position erodes: Cannot invest in differentiation when capital allocated to activity optimization.",
      "why_drag_persists": "Finance lacks accountability for execution outcomes—measured on budget control not value delivery. Board reviews budget variance not execution outcome alignment. Outcome measurement infrastructure unavailable: Customer satisfaction not tracked systematically, delivered profitability not analyzed by deal, resolution quality not measured. Creating outcome measurement complex: Requires data infrastructure investment (capital constrained), requires cross-functional data integration (coordination overhead), requires behavior change (activity metric optimization entrenched). Capital constraint ($1.3B debt) creates genuine pressure—but pressure applied uniformly rather than prioritized by outcome impact. Activity-based budgeting (Stage 4.3) masks underinvestment severity—activity metrics reported green while outcomes degrade.",
      "touch_test": "What if finance incentivized on execution outcome delivery (not budget variance)? Finance behavior would change: Allocate budget to outcome drivers (resolution quality, delivered profitability, proactive risk) not activity metrics (SLA compliance, bookings volume, incident response), Accept budget variance when outcome-justified, Invest in outcome measurement infrastructure (satisfaction surveys, margin analysis, complaint tracking), Prioritize budget allocation by outcome impact not activity measurability. But requires: Outcome measurement infrastructure (currently unavailable), Executive mandate prioritizing outcomes over activities (CEO walk away policy Q4 2024 shows willingness—but reactive not systematic), CFO willingness to sacrifice budget variance for outcome delivery (career risk—CFO may be replaced for variance even if outcomes improve).",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: Finance on budget control not outcomes",
        "Stage 4.3: Financial planning masking underinvestment through activity metrics",
        "Stage 4.2: Activity metrics stable, outcome metrics degrade",
        "Budget allocation to activities inference from metric patterns",
        "$1.3B debt creates capital constraint",
        "Q4 2024: CEO walk away policy prioritizes outcomes (profitability) over activities (revenue)",
        "FY2024: Revenue -7%, margins -13%/-3%"
      ]
    },
    {
      "drag_pattern": "CEO intervenes personally to resolve execution failures rather than build governance infrastructure—rational in short term but undermines organizational scalability",
      "how_drag_manifests": "CEO personal intervention resolves immediate crises: Adjudicates cross-functional conflicts, processes major deals ($100M+ TCV healthcare), establishes reactive policies (Q4 2024 walk away, Q3 2024 sales refresh), handles customer escalations. CEO rational behaviors: Personal heroics maintain quarterly/annual results (measured performance), Building governance infrastructure (operating committee, deal review board, empowered coordinators) uncertain ROI and delayed benefit, Delegation risky when organizational coordination capability unproven, Personal intervention more reliable than process when authority architecture broken.",
      "why_behavior_rational": "CEO measured on enterprise financial results: Revenue growth, profitability, stock price—short-term targets (quarterly earnings, annual guidance) dominate. Board evaluates CEO on financial outcomes not organizational capability: Revenue/margin/stock price visible to Board, coordination efficiency/throughput per headcount invisible. Building governance infrastructure consumes CEO time/capital/attention with uncertain future benefit: Operating committee creation requires recruiting executives (capital/time), deal review board requires process design and enforcement (coordination overhead), delegation requires CEO relinquish control (psychologically difficult). Personal intervention delivers immediate results: CEO has authority to resolve conflicts immediately, CEO context enables high-quality decisions, CEO heroics maintain results while governance building would create performance dip. CEO career horizon short (three CEOs three years): Multi-year governance building benefits successor not incumbent—rational to optimize personal tenure not organizational long-term.",
      "systemic_cost": "Organizational throughput plateaus at CEO coordination capacity (Stage 4.2: serial bottleneck). CEO consumed by operational coordination: Strategic focus impossible—CEO processing escalations not setting strategy. Organizational fragility increases: Execution dependent on CEO personal intervention not repeatable process. CEO turnover creates coordination crisis: Each transition disrupts informal networks, new CEO must rebuild coordination patterns. Three CEOs in three years: Coordination load unsustainable, role becomes impossible—CEO churn creates instability. Successor CEO inherits broken authority architecture: Governance infrastructure absence persists, bottleneck recreates regardless of individual capability.",
      "why_drag_persists": "CEO trapped in local maximum: Personal intervention suboptimal but delegation perceived riskier. Board reinforces short-term optimization: When financial results deteriorate (FY2024 -7%), Board replaces CEO—incentivizes short-term results over long-term capability building. New CEO faces same trap: Inherits broken authority architecture, rational to repeat personal intervention pattern. Building governance requires multi-year commitment: CEO must accept short-term performance cost (while building infrastructure) for long-term scalability—but Board may not grant multi-year patience. Walk away policy Q4 2024, sales refresh Q3 2024 reactive policies not structural governance: CEO establishes rules requiring ongoing CEO enforcement—doesn't create self-sustaining process.",
      "touch_test": "What if CEO incentivized on organizational scalability (not short-term financial results)? CEO behavior would change: Invest in governance infrastructure (operating committee, deal review board), Delegate authority to BU Presidents and functional leaders, Build repeatable coordination process (not personal intervention), Accept short-term performance cost for long-term capability. But requires: Board patience accepting performance dip during governance building (unlikely given three CEOs three years), Multi-year CEO commitment (conflicts with short CEO tenure pattern), Organizational coordination capability validation (currently unproven—delegation may fail). Three CEOs three years indicates personal heroics insufficient—structural fix necessary. But each CEO individually rational to optimize personal intervention—prisoner's dilemma where collectively suboptimal pattern persists.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Incentive misalignment: CEO on financial results not scalability",
        "Stage 4.1: CEO sole cross-functional coordinator",
        "Stage 4.2: CEO serial bottleneck limits throughput",
        "Three CEOs three years (Jones, Maletira, Kandiah)",
        "Q4 2024: CEO walk away policy (reactive, requires ongoing enforcement)",
        "Q3 2024: Sales refresh (CEO-driven intervention)",
        "Healthcare deal: CEO personal involvement $100M+ TCV",
        "Stage 4.1: No operating committee, no governance layer"
      ]
    }
  ]
}
