{
  "sub_stage": "7.1",
  "document_metadata": {
    "title": "Authoritative Truth Map - Rackspace Technology, Inc.",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-15",
    "scope": "Epistemic control analysis—which systems win when truth is contested"
  },
  "authoritative_truth_map": [
    {
      "data_domain": "Deal profitability by customer—whether signed deals are actually profitable",
      "claimed_system_of_record": "INFERENCE: Finance system likely claims profitability truth—general ledger, cost accounting, margin analysis systems. Sales CRM (Salesforce inference) claims bookings truth. No unified deal profitability system visible.",
      "actual_system_of_truth": "CEO personal judgment becomes system of truth by default when profitability disputed. Walk away policy Q4 2024 indicates CEO must personally assess and reject unprofitable deals/renewals—no systematic profitability validation pre-signature. CEO arbitrates sales (booking) vs delivery (cost) vs finance (margin) conflicts. Truth determined by CEO intervention not system calculation.",
      "conflict_resolution_mechanism": "Reactive CEO arbitration AFTER deals signed and profitability questioned. Walk away policy Q4 2024 reactive—established after margin erosion severe (Private Cloud -13%, Public Cloud -3%). Sales refresh Q3 2024 suggests personnel blamed rather than data system inadequacy addressed. No deal review board or systematic profitability gate (Stage 4.1). Conflict resolution: Sales books optimistically, delivery discovers cost reality post-signature, finance reports margin erosion quarterly, CEO intervenes reactively when deterioration visible.",
      "who_controls_truth": "CEO controls profitability truth reactively. Sales controls bookings truth proactively (autonomous booking authority Stage 4.1). Delivery has cost reality but lacks authority to establish profitability truth pre-signature. Finance reports historical profitability but cannot prevent unprofitable deals prospectively. Power asymmetry: Sales establishes revenue truth immediately upon booking, but profitability truth only established months later when CEO forces reconciliation.",
      "touch_test_what_breaks_if_challenged": "If deal profitability data challenged publicly: Investor/Board confidence collapses—'walk away' policy admits prior deals unprofitable but magnitude unknown. If sales bookings authority challenged internally: Sales argues velocity/competitive necessity, revenue growth stalls (already -7% FY2024). If CEO profitability judgment challenged: No alternative arbitration mechanism exists—authority void. Challenging profitability truth reveals accountability void (Stage 4.4): No unified owner, split between sales/delivery/finance, CEO forced to arbitrate every dispute creating bottleneck.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Q4 2024: CEO walk away policy established—reject unprofitable deals/renewals",
        "Q3 2024: Sales refresh—personnel change suggests performance/data disputes",
        "Margin erosion: Private Cloud -13%, Public Cloud -3% FY2024",
        "Stage 4.1: Sales has booking authority, delivery lacks veto, no deal review board",
        "Stage 4.4: Deal profitability accountability void—split sales/delivery/finance",
        "FY2024: Revenue -7%—walk away policy sacrifices revenue for profitability discipline"
      ]
    },
    {
      "data_domain": "Customer counts and churn rate—who is a 'customer' and when they leave",
      "claimed_system_of_record": "INFERENCE: CRM system (Salesforce likely) claims customer count truth. Finance/billing system claims active revenue-generating customer truth. Customer success/support systems claim engagement/satisfaction truth. No unified customer definition visible across systems.",
      "actual_system_of_truth": "CONTESTED without clear winner. Customer definition varies by audience: Sales counts 'customers' as any signed contract (maximizes customer count metric). Finance counts 'customers' as active revenue generators (excludes non-paying, disputed, or churned-but-contracted). Support counts 'customers' as active ticket generators. Investor communications likely use finance definition (conservative) while sales performance uses CRM definition (optimistic). Churn calculation depends on customer definition—numerator and denominator both contested.",
      "conflict_resolution_mechanism": "Definition changes by reporting context—no single truth enforced. Investor/regulatory reporting uses conservative definition (finance system, revenue-generating only). Internal sales performance uses optimistic definition (CRM, all signed contracts). Customer success uses engagement-based definition (support activity). Conflict unresolved—parallel truths coexist. Reconciliation avoided not addressed—reporting presents whichever definition favors narrative.",
      "who_controls_truth": "Finance controls external truth (investor/regulatory reporting—SEC filings, earnings calls). Sales controls internal truth (performance management, quotas, territories). Customer success lacks authority to establish truth despite operational proximity (Stage 4.1: no VP Customer Success visible). CEO likely arbitrates investor-facing truth but parallel internal truths persist. Power fragmentation: Each function controls truth within domain, no enterprise-wide customer truth enforced.",
      "touch_test_what_breaks_if_challenged": "If customer count/churn challenged by investors: Requires reconciliation between CRM (sales) and billing (finance) definitions—exposes customer definition ambiguity, potential churn understatement if using optimistic denominator. If churn calculation challenged internally: Reveals incentive misalignment—sales prefers optimistic customer count (denominator inflated, churn% appears lower), finance prefers conservative (denominator realistic, churn% accurate). Customer success likely has highest-fidelity engagement data (support activity) but lacks authority to challenge sales or finance definitions. Challenging customer truth reveals measurement theater (Stage 4.4): Activity metrics (customer counts) optimized while outcome metrics (satisfaction, retention) degrade.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 4.2: Activity vs outcome metric divergence pattern",
        "Customer satisfaction declining: Trustpilot 'consistently worse' 2024, BBB complaints",
        "Stage 4.1: No VP Customer Success, support lacks cross-functional authority",
        "FY2024: Revenue -7%—suggests customer/churn dynamics material",
        "CRM system inference from sales organization structure (400+ reps requires CRM)",
        "Finance/billing system separate from CRM standard in enterprise software"
      ]
    },
    {
      "data_domain": "Service delivery performance—SLA compliance vs customer satisfaction reality",
      "claimed_system_of_record": "Support ticketing system claims SLA truth (response times: 15min critical, 1hr urgent, 4hr normal). Customer satisfaction surveys claim satisfaction truth if collected. Support activity metrics (tickets processed, SLA compliance%) reported as performance reality.",
      "actual_system_of_truth": "Support ticketing system wins internally—SLA compliance metrics reported, performance managed, compensation tied to activity metrics (Stage 4.4). Customer satisfaction truth external and lagging—surfaces through complaints (BBB, Trustpilot, Gartner) not systematic measurement. Internal truth (SLA met) contradicts external truth (satisfaction declining). Support activity system of internal truth, customer complaint platforms system of external truth. Contradiction unreconciled—activity metrics continue optimization while satisfaction degrades.",
      "conflict_resolution_mechanism": "Internal vs external truth coexist unreconciled. Support performance management uses activity metrics (SLA compliance)—objective, measurable, directly controllable. Customer satisfaction uses external complaint platforms—subjective, lagging, indirectly influenced. When contradiction surfaces (customer complaints despite SLA compliance), resolution reactive: Individual issue escalation, support heroics ('dozens of engineers' coordination BBB), but no systematic reconciliation of activity vs satisfaction misalignment. CEO intervention for severe escalations (BBB: customers attempting CEO contact) but CEO capacity insufficient (Stage 4.2).",
      "who_controls_truth": "Support management controls activity truth internally—SLA metrics, ticket processing throughput, team performance dashboards. Customers control satisfaction truth externally—complaints, reviews, survey responses if conducted. Finance controls 'Fanatical Support' brand promise externally (investor communications, competitive differentiation claims). Power asymmetry: Support optimizes internal measurable (SLA), customer dissatisfaction external and diffuse (no single authoritative satisfaction metric), finance claims 'Fanatical' truth without systematic validation. Customer truth lacks internal authority—complaints inform individual escalations not systemic measurement.",
      "touch_test_what_breaks_if_challenged": "If SLA compliance challenged as misleading: Exposes activity-outcome divergence—SLA met but satisfaction declining reveals measurement theater. If 'Fanatical Support' brand promise challenged: Customer complaints (BBB, Trustpilot) directly contradict promise—brand erosion, competitive differentiation lost. If customer satisfaction data demanded systematically: Reveals measurement absence or suppression—systematic satisfaction tracking may not exist or data too negative to report. Challenging support truth reveals incentive misalignment (Stage 4.4): Support compensated on activity, satisfaction unmeasured/unrewarded, rational to optimize measurable (SLA) over unmeasurable (satisfaction).",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 4.2: SLA response times met (activity metric stable)",
        "Customer satisfaction declining: Trustpilot 'consistently worse' 2024",
        "BBB complaints: Unresolved issues, 'dozens of engineers' coordination",
        "Stage 4.4: Support incentive on SLA response not resolution quality",
        "Stage 4.1: No VP Support, support lacks resolution authority",
        "'Fanatical Support' brand promise (public/investor communications)"
      ]
    },
    {
      "data_domain": "Incident frequency and security posture—operational stability reality",
      "claimed_system_of_record": "Security/operations monitoring systems claim incident truth (SIEM, monitoring dashboards, incident ticketing). ScienceLogic monitoring system cited (Stage 4.3: zero-day Sept 2024 vendor dependency). Incident response metrics (MTTD, MTTR, severity) claimed as operational stability truth.",
      "actual_system_of_truth": "Incident response metrics system of internal truth—MTTD/MTTR measurable, reportable, performance managed. Incident frequency/recurrence system of external truth—surfaces through customer impact, regulatory disclosure requirements (FedRAMP, HIPAA incident reporting), public incidents (ransomware multi-month, zero-day Sept 2024). Internal truth (response capable) contradicts external reality (incidents recurring). Monitoring system degradation (Sept 2024 dashboards offline during zero-day) indicates internal truth unreliable during crisis—when most needed, least trustworthy.",
      "conflict_resolution_mechanism": "Reactive incident-by-incident resolution—each incident generates response metrics (internal truth: we responded), but incident frequency truth external and accumulative (pattern of recurrence). No systematic incident frequency reduction measurement (Stage 4.4: operations incentive on response not prevention). When monitoring fails (Sept 2024), truth determined by customer complaints and regulatory disclosure requirements not internal systems. Conflict between capability truth (operations can respond) and effectiveness truth (incidents recurring) unresolved—response metrics optimized, prevention metrics absent.",
      "who_controls_truth": "Operations controls incident response truth internally—MTTD/MTTR metrics, crisis management capability demonstrations. Regulators control compliance truth externally—FedRAM, HIPAA require timely incident disclosure, controls maintenance. Customers control impact truth—experience outages, judge stability independently of operations metrics. No CRO to control enterprise risk truth (Stage 4.1)—operations reactive, no proactive prevention authority. Power fragmentation: Operations controls 'we responded' truth, but lacks authority to establish 'we prevented' truth or 'we're secure' truth.",
      "touch_test_what_breaks_if_challenged": "If incident frequency challenged publicly: Ransomware multi-month impact, zero-day Sept 2024 public—recurrence pattern evident, contradicts stability claims if made. If monitoring reliability challenged: Sept 2024 dashboards offline during incident exposes visibility gap—cannot claim incident truth when monitoring fails during crisis. If security posture challenged by regulators: FedRAMP, HIPAA authorization at risk—reactive-only posture (Stage 4.4: no CRO, no proactive investment) creates compliance jeopardy. Challenging incident truth reveals prevention accountability void (Stage 4.4): Operations accountable for response not prevention, no owner of incident frequency reduction, CEO forced to intervene reactively.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Ransomware: Multi-month impact (public incident)",
        "Sept 2024: Zero-day vulnerability, monitoring dashboards offline during incident",
        "Stage 4.1: No CRO, reactive risk posture only",
        "Stage 4.4: Operations incentive on incident response not prevention",
        "ScienceLogic vendor dependency (monitoring system)",
        "FedRAMP, HIPAA/HITRUST compliance requirements (regulatory disclosure)"
      ]
    },
    {
      "data_domain": "Multi-jurisdictional operational metrics—utilization, capacity, performance across FedRAMP/UK/HIPAA/China",
      "claimed_system_of_record": "INFERENCE: Central operations dashboard likely claims consolidated operational truth. ScienceLogic monitoring per jurisdiction. Individual jurisdiction systems (FedRAMP-specific, UK-specific, etc.) claim local operational truth. Central technology/operations team claims enterprise-wide operational visibility.",
      "actual_system_of_truth": "FRAGMENTED without enterprise truth. Each jurisdiction (FedRAMP, UK Sovereign, HIPAA/HITRUST, China) separate operational systems due to regulatory isolation (Stage 4.2: 5-6x operational multiplier, data sovereignty mandates). Utilization truth jurisdiction-specific—cannot aggregate across regulatory boundaries. Capacity truth local not global—each jurisdiction separate capacity pool. Performance truth varies by jurisdiction—different infrastructure, different vendor dependencies (ScienceLogic per jurisdiction), different compliance regimes. No single operational truth—parallel jurisdiction truths coexist, enterprise aggregation impossible or misleading.",
      "conflict_resolution_mechanism": "Jurisdictional isolation prevents conflict—each jurisdiction separate truth, aggregation avoided not reconciled. When enterprise-wide operational view needed (investor communications, Board reporting), aggregation methodology contested: Simple sum misleading (ignores jurisdiction isolation, capacity non-fungibility), weighted average arbitrary (weights determined politically not technically). Conflict resolution through aggregation methodology selection—finance/investor relations controls methodology, operations provides jurisdiction data, methodology debate determines enterprise truth. CEO likely arbitrates methodology disputes but expertise insufficient (operational complexity exceeds CEO bandwidth Stage 4.2).",
      "who_controls_truth": "Operations controls jurisdiction-specific truth locally—each jurisdiction operations team owns local metrics. Finance/investor relations controls enterprise aggregation methodology—determines how jurisdiction truths combine into investor-facing enterprise truth. Regulators control jurisdiction definition and isolation—data sovereignty mandates prevent consolidation (external constraint). No central operations authority to unify truth (Stage 4.1: operations distributed, no COO visible with cross-jurisdiction authority). Power fragmentation across jurisdictions—no enterprise operational truth owner, jurisdiction specialists control local truth (Stage 4.5: jurisdiction specialists non-fungible, scarce expertise).",
      "touch_test_what_breaks_if_challenged": "If utilization metrics challenged: Reveals jurisdiction fragmentation—'enterprise utilization' meaningless when capacity non-fungible across jurisdictions. If capacity planning challenged: Exposes 5-6x operational multiplier—cannot reallocate capacity across FedRAMP/UK/HIPAA/China boundaries, enterprise capacity truth misleading. If operational performance compared across jurisdictions: Different infrastructure, different vendor dependencies (ScienceLogic configurations), different regulatory overhead creates non-comparable metrics—aggregation methodology determines perceived performance ranking. Challenging operational truth reveals multi-jurisdictional accountability void (Stage 4.4): No central operations owner, distributed across jurisdictions, enterprise truth negotiated not measured.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Stage 4.2: Multi-jurisdictional 5-6x operational multiplier",
        "FedRAMP, UK Sovereign, HIPAA/HITRUST, China compliance (separate jurisdictions)",
        "Stage 4.4: No central compliance coordination, distributed accountability",
        "Data sovereignty mandates prevent infrastructure consolidation",
        "ScienceLogic vendor dependency per jurisdiction (Stage 4.3)",
        "Stage 4.5: Jurisdiction specialists non-fungible, expertise isolated"
      ]
    },
    {
      "data_domain": "Sales performance and pipeline health—bookings forecast, pipeline quality, deal velocity",
      "claimed_system_of_record": "CRM system (Salesforce inference) claims sales pipeline truth. Sales forecasts, deal stages, opportunity values, close probabilities managed in CRM. Sales management dashboards claim performance truth. Finance consolidates CRM data for revenue forecasting.",
      "actual_system_of_truth": "Sales CRM wins on pipeline quantity truth (opportunity counts, pipeline value at each stage). Finance establishes revenue forecast truth externally (investor guidance, Board commitments)—may override CRM-based forecast with conservative adjustments. Deal quality truth contested: Sales claims pipeline 'qualified' and 'winnable', delivery discovers post-signature many deals unbuildable or unprofitable (Stage 4.1: sales-delivery authority gap). CEO walk away policy Q4 2024 establishes quality truth reactively—overrides CRM opportunity value with profitability assessment. Sales refresh Q3 2024 suggests CRM truth challenged—if pipeline/performance data reliable, personnel change wouldn't be necessary.",
      "conflict_resolution_mechanism": "Pipeline quantity truth uncontested—CRM system single source. Pipeline quality truth contested between sales (optimistic), delivery (realistic post-signature), finance (conservative for forecasting), CEO (profitability-disciplined post-Q4 2024). Conflict resolution: Sales CRM truth used for internal performance management and territory planning. Finance conservative adjustment used for external commitments (investor guidance). CEO profitability filter applied reactively to prevent unprofitable deals (walk away policy). No proactive quality validation pre-CRM entry—optimistic pipeline truth enters system, gets filtered reactively downstream causing margin erosion (Private Cloud -13%, Public Cloud -3%).",
      "who_controls_truth": "Sales controls pipeline entry truth—determines what opportunities enter CRM, qualification criteria, stage progression. Sales management controls internal performance truth—quota attainment, territory rankings, compensation calculations based on CRM. Finance controls external forecast truth—adjusts CRM data for investor commitments, Board reporting. CEO controls deal approval truth reactively post-Q4 2024—can reject CRM opportunities via walk away policy. Power asymmetry: Sales establishes opportunity truth proactively and optimistically, finance adjusts conservatively for external consumption, CEO filters reactively for profitability, delivery discovers quality truth too late (post-signature).",
      "touch_test_what_breaks_if_challenged": "If pipeline quality challenged internally: Exposes sales-delivery disconnect—CRM 'qualified' opportunities may be unbuildable, sales-delivery coordination gap (Stage 4.1). If forecast accuracy challenged by investors: Reveals conservative adjustment necessity—CRM optimistic, finance must discount for external credibility. If deal profitability challenged at CRM entry: Sales velocity stalls (fewer opportunities pass profitability screen), revenue growth at risk (already -7% FY2024), sales compensation declines (fewer bookings if quality required). Challenging sales truth reveals incentive misalignment (Stage 4.4): Sales compensated on bookings volume encourages optimistic CRM entry, quality filtering downstream reactive and costly.",
      "claim_type": "INFERENCE",
      "evidence_sources": [
        "Q4 2024: CEO walk away policy—rejects unprofitable deals/renewals",
        "Q3 2024: Sales refresh—suggests performance/pipeline data disputed",
        "Stage 4.1: Sales booking authority, delivery lacks veto, no deal review board",
        "Margin erosion: Private Cloud -13%, Public Cloud -3%—sales quality issue",
        "FY2024: Revenue -7%—forecast accuracy challenged",
        "CRM system inference from sales organization scale (400+ reps)"
      ]
    }
  ],
  "synthesis_notes": "Truth ownership fragmented and contested across all material domains. Pattern: Proactive truth established optimistically by operational functions (sales CRM, support SLA), reactive truth established conservatively by finance/CEO after deterioration visible. No unified data authority—each function controls truth within domain, enterprise truth negotiated not measured. CEO forced to arbitrate truth disputes reactively (walk away policy, sales refresh, customer escalations) creating bottleneck (Stage 4.2). Power over truth correlates with decision authority not data proximity: Finance controls external truth (investor-facing), operations controls internal truth (performance management), CEO arbitrates conflicts. Contested domains systematically those where authority-accountability misaligned (Stage 4.1): Deal profitability (sales/delivery split), customer resolution (support/cross-functional split), operational stability (engineering/operations split). Truth contestation symptom of structural coordination failures not data quality issues."
}
