{
  "sub_stage": "4.2",
  "document_metadata": {
    "title": "Information Requests - Execution Throughput Unknowns",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-09"
  },
  "unknowns_requests": [
    {
      "request_id": "4.2-REQ-01",
      "priority": "CRITICAL",
      "unknown_addressed": "Customer support throughput and resolution metrics",
      "specific_request": "(1) Average and median time-to-resolution by support tier and issue complexity, (2) Resolution rate by tier (% of issues resolved without escalation), (3) Escalation frequency and post-escalation resolution time, (4) Ticket aging reports showing queue depth by tier, (5) Customer satisfaction scores (CSAT/NPS) correlated with resolution time and escalation patterns, (6) Percentage of tickets requiring cross-functional coordination and their resolution rates vs single-function tickets",
      "why_material": "Customer complaints indicate systematic resolution failures but lack quantification. Cannot determine throughput degradation severity, identify root causes precisely, or evaluate whether coordination failures are isolated or pervasive without metrics. Critical for assessing post-close operability risk."
    },
    {
      "request_id": "4.2-REQ-02",
      "priority": "CRITICAL",
      "unknown_addressed": "Sales-delivery handoff throughput and profitability",
      "specific_request": "(1) Average time from deal close to customer onboarding completion to revenue recognition, (2) Percentage of deals requiring post-signature rework, re-negotiation, or scope adjustment, (3) Delivery profitability metrics by sales rep, region, vertical, and deal type, (4) Customer onboarding duration distribution by complexity, (5) Deal approval escalation frequency to CEO/CFO and decision duration, (6) Sales compensation vs delivered profitability correlation (if available)",
      "why_material": "Margin erosion (-13%/-3%) and CEO 'walk away' policy indicate handoff failures but cannot quantify precisely. Need metrics to assess whether sales-delivery coordination structurally broken or improving post-Q3 2024 refresh. Critical for revenue/margin forecast reliability."
    },
    {
      "request_id": "4.2-REQ-03",
      "priority": "HIGH",
      "unknown_addressed": "Technology deployment cadence and multi-jurisdictional overhead",
      "specific_request": "(1) Technology deployment cycle time by jurisdiction (US Government, UK Sovereign, China, EU, US Commercial, APAC), (2) Cross-jurisdictional coordination effort and duration for enterprise initiatives, (3) Security patch deployment windows and lag times by jurisdiction, (4) Technology infrastructure investment levels by jurisdiction, (5) Deployment success rates and rollback frequency by jurisdiction",
      "why_material": "Multi-jurisdictional isolation creates deployment multiplier but cannot quantify precisely. Need metrics to assess whether AI strategy (Q3 2024) executable across jurisdictions or will stall in deployment coordination. Critical for technology competitiveness assessment."
    },
    {
      "request_id": "4.2-REQ-04",
      "priority": "HIGH",
      "unknown_addressed": "Executive decision throughput and CEO bottleneck severity",
      "specific_request": "(1) CEO time allocation analysis (strategic vs operational, escalations vs planning), (2) Decision queue metrics (pending decisions by type, wait times, approval duration), (3) Delegation patterns (what decisions CEO must make vs can be delegated), (4) Executive calendar audit showing coordination load, (5) CEO span of control (direct reports and indirect oversight scope)",
      "why_material": "Stage 4.1 identified CEO as sole cross-functional coordinator. Need quantification of bottleneck severity to assess scalability limits and whether governance layer addition would help or hurt. Critical for post-close integration planning."
    },
    {
      "request_id": "4.2-REQ-05",
      "priority": "MEDIUM",
      "unknown_addressed": "Strategic initiative capacity consumption and ROI",
      "specific_request": "(1) Strategic initiative resource allocation tracking (FTE equivalent, budget, timeline by initiative), (2) Initiative success/failure criteria and actual outcomes, (3) Operational performance metrics during vs between major initiatives, (4) Post-implementation reviews showing projected vs actual benefits, (5) Employee engagement or productivity metrics during change periods",
      "why_material": "Strategic review (2022-2023), reorganization (2023), layoffs (2021, 2023) consumed capacity without evident throughput improvement. Need quantification to assess whether change initiatives create value or purely destroy capacity. Critical for determining post-close change absorption capacity."
    },
    {
      "request_id": "4.2-REQ-06",
      "priority": "MEDIUM",
      "unknown_addressed": "Longitudinal throughput trends and inflection points",
      "specific_request": "(1) Revenue per employee trends (3-5 years), (2) Gross margin and operating margin trends by quarter, (3) Customer satisfaction (NPS/CSAT) trends quarterly, (4) Support ticket volume vs resolution rate trends, (5) Sales efficiency (revenue per sales rep) trends, (6) Voluntary employee turnover rates quarterly (talent retention indicator)",
      "why_material": "Cannot determine whether FY2024 (-7% revenue) is temporary dip or accelerating decline without longitudinal trends. Need trend data to identify inflection points, assess whether organization stabilizing or collapsing, forecast future degradation trajectory. Critical for valuation and turnaround viability assessment."
    },
    {
      "request_id": "4.2-REQ-07",
      "priority": "LOW",
      "unknown_addressed": "Coordination cost quantification",
      "specific_request": "(1) Activity-based costing: employee time allocation to coordination activities vs productive work, (2) Cost of rework and failed handoffs, (3) Cost of customer escalation coordination failures, (4) Cost of multi-jurisdictional deployment overhead, (5) Estimated opportunity cost of CEO bottleneck",
      "why_material": "Coordination cost hypothesized as primary constraint but not quantified economically. Cost quantification needed to build business case for coordination reduction initiatives, benchmark against industry, justify governance investments. LOW priority because directionally clear from qualitative evidence even without precise quantification."
    }
  ]
}
