{
  "sub_stage": "4.1",
  "document_metadata": {
    "title": "Information Requests to Resolve Unknowns - Rackspace Technology, Inc.",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-09",
    "note": "Prioritized list of documents and information requests to resolve material decision authority unknowns. Sequenced by materiality to Stage 4.1 conclusions."
  },
  "unknowns_requests": [
    {
      "request_id": "4.1-REQ-01",
      "priority": "CRITICAL",
      "unknown_addressed": "Board composition, committee structure, and governance processes",
      "specific_request": "Most recent proxy statement (DEF 14A) including: (1) Complete board of directors roster with director biographies, independence determinations, and tenure; (2) Committee composition (Audit, Compensation, Nominating & Governance) with chair identifications; (3) Board and committee meeting frequency and attendance records for past 2 fiscal years; (4) Any disclosed director disagreements, dissents, or abstentions; (5) Board governance guidelines and committee charters.",
      "why_material": "Apollo's 57% voting control provides absolute authority, but committee composition determines whether independent directors have any real oversight authority over audit, compensation, or governance. Apollo representation on committees (especially Audit and Compensation) would indicate deeper shadow control than board membership alone suggests."
    },
    {
      "request_id": "4.1-REQ-02",
      "priority": "CRITICAL",
      "unknown_addressed": "Executive compensation structure and incentive alignment",
      "specific_request": "Executive compensation documentation including: (1) Summary Compensation Table for Named Executive Officers (NEOs) covering past 3 fiscal years; (2) Annual and long-term incentive plan performance metrics, weighting, and payout ranges; (3) Equity ownership by executives (stock, options, RSUs); (4) Change-of-control provisions in executive employment agreements; (5) If BU Presidents are NEOs, their compensation structure and P&L-based incentive metrics.",
      "why_material": "Cannot determine whether executives incentivized for Apollo's objectives (cash generation, margin maximization) vs growth/customer satisfaction objectives. Compensation structure reveals what board (Apollo) actually prioritizes and how executives will behave under pressure. BU President compensation reveals whether BU P&L accountability is real or notional."
    },
    {
      "request_id": "4.1-REQ-03",
      "priority": "CRITICAL",
      "unknown_addressed": "Organizational governance structure and decision-making forums",
      "specific_request": "Organizational governance documentation including: (1) Operating Committee or Executive Leadership Team charter, membership, meeting cadence, and decision authorities; (2) Deal Review Board or Investment Committee charter and approval thresholds; (3) Enterprise Risk Management Committee charter and risk escalation authorities; (4) Customer Success or Service Quality Council structure and escalation processes; (5) Cross-functional governance forums (if any) with documented decision-making authority.",
      "why_material": "Determines whether cross-functional conflicts resolved through structured governance (scalable) or CEO ad hoc intervention (bottleneck). Absence of standing governance forums explains escalation failures documented in customer complaints and operational execution gaps. Critical for assessing organizational scalability and post-close integration operability."
    },
    {
      "request_id": "4.1-REQ-04",
      "priority": "HIGH",
      "unknown_addressed": "Delegation of authority and BU President autonomy",
      "specific_request": "Delegation of authority matrix and BU operational structure including: (1) BU President role descriptions, reporting relationships, and performance evaluation criteria; (2) Delegation of authority matrix showing BU President sign-off thresholds (hiring, capital expenditure, contract approval, pricing variance, customer escalation resolution); (3) Internal P&L structure and BU accountability metrics; (4) Evidence of BU-level decisions made without CEO approval (e.g., deal approvals, hiring announcements, operational process changes).",
      "why_material": "Determines whether BU structure provides real decision autonomy (federated, scalable) or just reporting clarity (centralized, CEO bottleneck). Evidence suggests centralized (Lillie departure, CEO backfill), but degree of autonomy unknown. Critical for assessing whether operating model can scale with volume growth or additional complexity."
    },
    {
      "request_id": "4.1-REQ-05",
      "priority": "HIGH",
      "unknown_addressed": "Customer support escalation process and accountability",
      "specific_request": "Customer support operations documentation including: (1) Customer escalation playbook (tier structure, escalation triggers, escalation paths to senior management); (2) VP/SVP Customer Support or Chief Customer Officer role charter, organizational placement, and decision authorities; (3) SLA breach escalation process and executive accountability; (4) Customer success team structure, P&L accountability, and customer health scoring processes; (5) Evidence of executive (CEO, BU Presidents, COO) involvement in escalated customer issues (anonymized case examples).",
      "why_material": "Customer complaints indicate systemic escalation failure ('multiple tickets, no ownership, cannot reach senior management'). Determines whether fixable through process enforcement (process exists but not followed) or requires organizational redesign (no empowered decision-maker exists). Critical for assessing customer churn risk and post-close integration operability."
    },
    {
      "request_id": "4.1-REQ-06",
      "priority": "HIGH",
      "unknown_addressed": "Sales force compensation and deal approval authorities",
      "specific_request": "Sales organization governance documentation including: (1) Sales compensation plan structure (bookings vs profitability vs retention weighting, clawback provisions for early churn); (2) Deal approval matrix (at what TCV, discount level, or margin threshold does deal require VP/CFO/CEO approval); (3) Sales leadership structure and regional/vertical P&L authority; (4) Quota distribution and attainment rates across 400+ quota-bearing reps; (5) Evidence of sales process changes implemented Q3-Q4 2024 during 'refresh' (new approval processes, compensation plan modifications, training programs).",
      "why_material": "CEO announced 'walk away from unprofitable deals' policy Q4 2024, but enforcement mechanism unclear. If sales reps compensated purely on bookings without profitability accountability, policy will be gamed. If deal approval authority delegated without profitability review, CEO policy unenforceable. Determines whether strategic pivot to profitability is executable or aspirational."
    },
    {
      "request_id": "4.1-REQ-07",
      "priority": "MEDIUM",
      "unknown_addressed": "Technology platform architecture and integration status",
      "specific_request": "Technology architecture documentation including: (1) Technology stack inventory (CRM systems, ticketing platforms, monitoring tools, customer portals, billing systems—identify if unified or multiple platforms); (2) Legacy acquisition integration status (Datapipe, Onica, TriCore, RelationEdge—which systems integrated vs remaining separate); (3) Platform consolidation roadmap (if exists) with timeline and investment requirements; (4) Engineering team structure (unified platform teams vs separate teams per legacy acquisition); (5) Customer contract distribution (how many customers on legacy platforms vs migrated to unified platform).",
      "why_material": "Customer complaints suggest platform fragmentation ('conflicting advice from multiple engineers'). Determines whether operational issues due to process gaps (fixable through training/process) or systems fragmentation (requires major consolidation program—capital intensive, high execution risk). Integration status affects operational improvement feasibility and customer churn risk during post-close integration."
    },
    {
      "request_id": "4.1-REQ-08",
      "priority": "MEDIUM",
      "unknown_addressed": "Risk governance structure and incident response",
      "specific_request": "Enterprise risk governance documentation including: (1) Chief Risk Officer or equivalent role charter, organizational placement, and authorities; (2) Enterprise Risk Management Committee charter, membership, meeting frequency, and risk escalation authorities; (3) Top enterprise risks register with ownership and mitigation plans; (4) Incident response plans (security, operational, compliance) and post-incident review processes; (5) Evidence of risk governance in strategic decision-making (risk assessments for major initiatives, risk acceptance authorities, risk-based go/no-go decisions).",
      "why_material": "Security incidents (ransomware Dec 2022, zero-day Sept 2024) handled reactively without evidence of proactive risk governance. Customer complaints cite 'no apology, compensation, or solution' after incidents. Determines whether risk governance adequate for regulated verticals (government, healthcare, financial services) requiring mature risk management. Critical for assessing authorization retention risk (FedRAMP, HIPAA/HITRUST, ISO 27001)."
    },
    {
      "request_id": "4.1-REQ-09",
      "priority": "MEDIUM",
      "unknown_addressed": "Compliance governance and regulatory constraint navigation",
      "specific_request": "Compliance governance documentation including: (1) Chief Compliance Officer or equivalent role charter and authorities; (2) Compliance committee charter, membership, and meeting frequency; (3) Compliance audit results (SOC 2 Type II reports, ISO 27001 certification status, FedRAMP continuous monitoring results—most recent cycle); (4) Evidence of compliance review in operational decisions (compliance sign-off requirements for architecture changes, M&A, customer contracts in regulated verticals); (5) Compliance training programs for executives and decision-makers.",
      "why_material": "Stage 1 identified material compliance obligations (FedRAMP, UK Sovereign, HIPAA/HITRUST, ISO 27001) creating structural constraints on operational decisions. Determines whether compliance governance centralized (can navigate constraints efficiently) or distributed (creates decision delays and authorization risk). Compliance breach risk material—FedRAMP authorization loss forces 12-18 month re-authorization, losing government customers."
    },
    {
      "request_id": "4.1-REQ-10",
      "priority": "LOW",
      "unknown_addressed": "Apollo Global Management investment thesis and exit planning",
      "specific_request": "Apollo relationship documentation including: (1) Apollo fund vintage holding Rackspace investment and expected fund life timeline; (2) Any Apollo public statements or investor letters discussing Rackspace position; (3) Evidence of Apollo Portfolio Performance Solutions team involvement (Vikram Mahidhar role beyond board membership); (4) Apollo cost of capital and return threshold discussions (if disclosed in any board materials or strategic review documentation); (5) Comparable Apollo portfolio company exit timelines and strategies (public information but helpful to understand Apollo's typical hold period and exit preferences).",
      "why_material": "Apollo's stranded capital position (paid $4.3B 2016, current stake worth ~$68M) determines decision-making priorities. If Apollo seeking exit, decisions optimize for sale value. If Apollo in harvest mode, decisions optimize for cash generation. CEO and board decision-making aligns with Apollo's timeline, not public shareholders. Determines sustainability of current operational turnaround strategy vs likelihood of future strategic pivot. However, LOW PRIORITY because Apollo's internal decision-making is largely UNKNOWABLE without insider access—can only infer from observable actions."
    }
  ]
}
