{
  "sub_stage": "4.1",
  "document_metadata": {
    "title": "Disconfirming Evidence Search Log - Rackspace Technology, Inc.",
    "target_entity": "Rackspace Technology, Inc. (NASDAQ: RXT)",
    "analysis_date": "2026-02-09",
    "note": "Per Stage 0.3 requirements: Must actively search for disconfirming evidence to test hypotheses. This file documents evidence sought to DISCONFIRM conclusions."
  },
  "disconfirming_evidence_searched": [
    {
      "hypothesis_tested": "H4.1-A: Apollo exercises shadow control over strategic decisions",
      "disconfirming_evidence_sought": "Board decisions where independent directors prevailed over Apollo representatives on material matters",
      "search_conducted": "Reviewed proxy statements, board composition disclosures, earnings call transcripts for evidence of independent director dissent or contrary decisions. Searched for governance actions initiated by independent directors counter to Apollo interests.",
      "evidence_found": "NONE - No evidence of independent directors overriding Apollo on material decisions. Independent Chairman Jeffrey Benjamin appointed Jan 2025 AFTER strategic review abandoned 2023—suggests independent governance is retrospective, not controlling. Apollo maintained board representation (Mahidhar joined when Sambur departed)—no reduction in Apollo influence when independent chair appointed.",
      "conclusion": "Disconfirming evidence NOT FOUND. Hypothesis remains supported."
    },
    {
      "hypothesis_tested": "H4.1-B: Business Unit Presidents lack real decision authority",
      "disconfirming_evidence_sought": "Evidence of BU Presidents making strategic announcements independently, separate P&L accountability statements, immediate replacement of departed BU Presidents indicating role importance",
      "search_conducted": "Reviewed earnings call transcripts for BU President participation in strategic announcements. Searched press releases for BU President-led initiatives. Examined succession planning after Lillie departure. Searched for evidence of autonomous BU decision-making.",
      "evidence_found": "NONE - Private Cloud President Lillie departed Jan 2025, CEO assumed role directly without replacement. Public Cloud President not named in public disclosures. No earnings call participation by BU Presidents. CEO articulates all BU strategy.",
      "conclusion": "Disconfirming evidence NOT FOUND. Hypothesis remains supported—BU President roles lack real authority."
    },
    {
      "hypothesis_tested": "H4.1-C: Sales authority misaligned with delivery accountability",
      "disconfirming_evidence_sought": "Evidence of deal approval process requiring delivery/finance sign-off before booking. Sales compensation tied to profitability/retention vs bookings only. Stable margins contradicting margin erosion hypothesis.",
      "search_conducted": "Searched proxy statements for sales compensation structure disclosures (not yet filed for 2025). Reviewed margin trends FY2024 vs prior years. Examined CEO statements about pricing discipline and sales process changes. Searched for evidence of pre-sale deal review involving delivery organization.",
      "evidence_found": "PARTIAL - Margin erosion confirmed (Private Cloud -13%, Public Cloud -3% YoY). CEO Q4 2024 'walk away from unprofitable deals' policy indicates correction needed. Sales organization 'refresh' Q3 2024 indicates personnel changes required. However, CANNOT CONFIRM sales compensation structure (requires proxy statement not yet filed). Cannot confirm whether delivery has pre-sale veto authority (internal process documentation unavailable).",
      "conclusion": "Disconfirming evidence NOT FOUND for margin erosion. INCONCLUSIVE on sales compensation structure (data unavailable). Hypothesis supported by available evidence but compensation structure unknown."
    },
    {
      "hypothesis_tested": "H4.1-D: Customer escalations fail due to absence of empowered decision-maker",
      "disconfirming_evidence_sought": "Evidence of VP Customer Support or Chief Customer Officer role. Customer escalation playbook routing to empowered BU-level decision-maker. Declining complaint trends indicating process improvement. High NPS/CSAT scores contradicting complaints.",
      "search_conducted": "Reviewed SEC filings for disclosed executive roles. Searched earnings calls for customer support leadership mentions. Examined customer complaint trends across BBB, Trustpilot, Gartner Peer Insights spanning 2023-2024. Searched for NPS/CSAT score disclosures in earnings materials.",
      "evidence_found": "NONE - No VP Customer Support or CCO disclosed. Customer complaints span multiple platforms (BBB, Trustpilot, Gartner) and time periods with consistent pattern: 'multiple tickets, no ownership, cannot escalate.' Trustpilot complaint states support 'consistently getting worse' (2024)—indicates worsening, not improving, trend. No NPS/CSAT scores disclosed publicly (may exist internally but not shared with investors).",
      "conclusion": "Disconfirming evidence NOT FOUND. Complaint trends worsening, not improving. Hypothesis strongly supported."
    },
    {
      "hypothesis_tested": "H4.1-E: Cross-functional conflicts escalate to CEO without intermediate governance layer",
      "disconfirming_evidence_sought": "Disclosure of standing operating committee, deal review board, or cross-functional council. Evidence of BU Presidents or functional VPs resolving cross-functional conflicts without CEO escalation.",
      "search_conducted": "Reviewed governance disclosures in proxy statements and 10-K filings. Searched earnings call transcripts for mentions of operating committee, executive council, or governance forums. Examined organizational structure disclosures. Searched for evidence of federated decision-making at BU or functional level.",
      "evidence_found": "NONE - No operating committee, deal review board, or cross-functional council disclosed. CEO articulates all strategic decisions in earnings calls. BU Presidents lack authority (Lillie departure with CEO backfill). Q4 2024 CEO making tactical pricing decisions ('walk away from unprofitable deals')—indicates CEO involved in operational details vs delegating to governance forum.",
      "conclusion": "Disconfirming evidence NOT FOUND. Hypothesis remains supported—CEO is decision bottleneck for cross-functional issues."
    },
    {
      "hypothesis_tested": "H4.1-F: Debt covenants and regulatory constraints act as shadow veto authorities",
      "disconfirming_evidence_sought": "Evidence of major capital investments funded despite debt constraints. Operational entity consolidation achieved despite regulatory constraints (FedRAMP, UK Sovereign, China). Strategic initiatives pursued without debt holder or regulator approval.",
      "search_conducted": "Reviewed capital allocation statements in earnings calls and 10-K. Examined AI strategy funding sources. Searched for evidence of infrastructure investment independent of customer funding. Reviewed Stage 1 regulatory analysis for evidence of consolidation attempts or regulatory waivers. Searched for debt covenant waiver or amendment disclosures.",
      "evidence_found": "NONE (disconfirming evidence) - AI strategy articulated Q3 2024 but capital allocation unclear. Q4 2024 mentions customer-funded CapEx model—indicates Rackspace cannot independently invest. Security incidents (ransomware 2022, zero-day 2024) forced reactive spending—confirms capital constrained even for critical security investments. Stage 1 analysis confirms regulatory constraints remain absolute (FedRAMP, UK Sovereign, China isolation requirements unchanged). No debt covenant waivers or amendments disclosed.",
      "conclusion": "Disconfirming evidence NOT FOUND. External constraints (debt, regulatory) continue to veto strategic options. Hypothesis strongly supported."
    },
    {
      "hypothesis_tested": "H4.1-G: CEO role has accountability without authority over strategic constraints",
      "disconfirming_evidence_sought": "CEO tenure stability (multi-year retention). Evidence of CEO autonomous authority over strategic direction without Apollo approval. CEO successful funding of strategic initiatives without external constraint.",
      "search_conducted": "Examined CEO tenure patterns: Jones (to Sept 2022), Maletira (Sept 2022-Sept 2025), Kandiah (Sept 2025-present). Reviewed strategic initiative announcements for evidence of CEO autonomy vs Apollo oversight. Searched for capital investment approvals by CEO without board/Apollo involvement. Examined executive turnover beyond CEO (CFO, BU Presidents).",
      "evidence_found": "NONE (disconfirming CEO constraint) - Three CEOs in three years confirms high turnover. Jones departure coincided with failed strategic review (Apollo-controlled board decision). Maletira moved to Vice Chairman after 3 years—graceful exit but still turnover. Kandiah third CEO in three years. CFO turnover: Molu departed Jan 2024. BU President Lillie departed Jan 2025. Pattern suggests executive roles constrained throughout organization, not just CEO.",
      "conclusion": "Disconfirming evidence NOT FOUND. High CEO turnover persists. Executive turnover extends beyond CEO. Hypothesis supported—CEO role structurally constrained."
    },
    {
      "hypothesis_tested": "Customer complaints are isolated incidents, not systemic",
      "disconfirming_evidence_sought": "Evidence of systematic complaint resolution process. Declining complaint trends. High NPS/CSAT scores contradicting complaints. Management acknowledgment of complaint patterns with governance fixes.",
      "search_conducted": "Reviewed complaint patterns across BBB (2024), Trustpilot (2024), Gartner Peer Insights (2024). Searched earnings call transcripts for management acknowledgment of customer support issues. Examined time trends (2023 vs 2024) for improvement. Searched for disclosed NPS/CSAT metrics or customer satisfaction initiatives.",
      "evidence_found": "CONTRADICTS 'isolated incident' hypothesis - Complaints span multiple platforms (BBB, Trustpilot, Gartner) with consistent patterns: 'multiple tickets, no ownership, cannot escalate, conflicting advice.' Trustpilot complaint states support 'consistently getting worse' (2024)—indicates worsening trend. Customer support pin system reportedly 'broken for years'—indicates long-standing issue. No management acknowledgment of support governance issues in earnings calls. No NPS/CSAT scores disclosed.",
      "conclusion": "Disconfirming evidence NOT FOUND—complaints are NOT isolated. Evidence confirms systemic pattern across platforms and time periods. Complaint trends worsening, not improving."
    },
    {
      "hypothesis_tested": "Executive turnover is normal for turnaround situations and does not indicate authority constraints",
      "disconfirming_evidence_sought": "Industry comparables showing similar turnover rates in turnaround contexts. Evidence that departing executives moved to better opportunities suggesting positive experience. Smooth transitions with continuity plans. Public statements by departing executives endorsing company direction.",
      "search_conducted": "Reviewed departure announcements for Jones (CEO), Molu (CFO), Lillie (BU President). Searched for subsequent career moves indicating positive departures. Examined transition planning (immediate replacements vs CEO backfills). Searched for departing executive statements about Rackspace strategy or experience.",
      "evidence_found": "MIXED - Jones moved to Apollo operating advisor role—suggests Apollo-directed transition, not organic. Molu departed for 'UK opportunity'—could be positive move (ambiguous). Lillie departed for 'personal commitments'—ambiguous, but CEO backfill without replacement suggests role authority insufficient. No public statements by departing executives endorsing Rackspace strategy. Maletira moved to Vice Chairman—graceful succession but still third CEO in three years.",
      "conclusion": "PARTIALLY CONFIRMS turnaround context explains some turnover, but pattern concerning. Jones departure Apollo-directed. Lillie departure without replacement suggests role constraint. Three CEOs in three years high even for turnaround. Hypothesis: Turnover due to authority constraints AND turnaround difficulty—both factors present."
    },
    {
      "hypothesis_tested": "BU structure provides real P&L autonomy, not just reporting clarity",
      "disconfirming_evidence_sought": "Separate P&L disclosures with BU President autonomy statements. Evidence of BU-level capital allocation, hiring, pricing decisions without CEO approval. BU Presidents speaking to strategy in earnings calls.",
      "search_conducted": "Reviewed 10-K for P&L disclosure by BU (Private Cloud, Public Cloud). Searched earnings calls for BU President participation. Examined organizational announcements for evidence of BU-level decision-making. Searched for BU-specific strategic initiatives announced by BU Presidents vs CEO.",
      "evidence_found": "NONE - P&L disclosed by BU (revenue, growth rates) but no evidence of BU President P&L autonomy. CEO articulates all BU strategy in earnings calls. Private Cloud President Lillie departed without replacement—CEO assumed role. Public Cloud President not identified publicly. No evidence of BU-level autonomous decisions (capital allocation, pricing, hiring) without CEO involvement.",
      "conclusion": "Disconfirming evidence NOT FOUND. BU structure provides reporting clarity but not decision autonomy. Authority remains centralized at CEO level."
    }
  ]
}
