{
  "disconfirming_evidence_not_found": [
    "Evidence of Public Cloud margin expansion or pricing power (SOUGHT but NOT FOUND): Public Cloud gross margin 10.4% with no improvement trend. Revenue declining 3% YoY indicates competitive pressure, not pricing power.",
    "Evidence of Private Cloud margin stabilization or expansion (SOUGHT but NOT FOUND): Private Cloud declining 13% YoY with fixed costs creating negative leverage. Margin compression evident from overall gross margin decline 180bps.",
    "Evidence of operating leverage in SG&A (SOUGHT but NOT FOUND): SG&A remained 25.9% of revenue despite 7% decline. Costs declined proportionally (7.8%), not faster than revenue. Zero operating leverage demonstrated.",
    "Evidence of path to operating profitability at current trajectory (SOUGHT but NOT FOUND): Gross margin 19.5% insufficient to cover SG&A 25.9% = -6.4% operating margin. No margin expansion initiatives or major cost restructuring announced.",
    "Evidence of long-term guaranteed hyperscaler partnership terms (SOUGHT but NOT FOUND): AWS/Google partnership terms not disclosed. Azure CSP documented but no long-term guarantees. Partnerships assumed revocable.",
    "Evidence of VMware cost mitigation strategies succeeding (SOUGHT but NOT FOUND): No announcements of platform migrations, customer transitions to alternatives, or VMware cost containment initiatives. Broadcom price shock unmitigated.",
    "Evidence of data center consolidation or facility rationalization completed (SOUGHT but NOT FOUND): $12M UK office exit expense noted, but no comprehensive facility rationalization plan disclosed. Underutilized capacity remains burden.",
    "Evidence of infrastructure cost reductions matching Private Cloud revenue decline (SOUGHT but NOT FOUND): CapEx down 25% but revenue down only 13%, suggesting underinvestment, not efficiency. COGS as % of revenue INCREASED 180bps.",
    "Evidence of acquired entity integration completion or synergy capture (SOUGHT but NOT FOUND): Datapipe/Onica/TriCore integration status not disclosed. No synergy realization metrics provided. Revenue declining suggests acquisitions did not create competitive advantage.",
    "Evidence of email hosting customer retention despite price increase (SOUGHT but NOT FOUND): Partners report 'immediate churn', no management commentary on retention, no separate disclosure suggesting segment results are negative or embarrassing.",
    "Evidence of customer switching costs, lock-in mechanisms, or contractual retention (SOUGHT but NOT FOUND): Month-to-month billing standard. No long-term contracts, termination penalties, or proprietary platform lock-in identified. Email price increase proves zero customer stickiness.",
    "Evidence of competitive cost structure vs hyperscalers or IT services giants (SOUGHT but NOT FOUND): SG&A 25.9% significantly higher than AWS/Azure/Google (operate at 10-15% SG&A on infrastructure), and higher than IT services firms (15-20% typical). Multi-entity structure creates cost penalty.",
    "Evidence of margin improvement from automation, AI, or operational efficiency (SOUGHT but NOT FOUND): No disclosures of automation initiatives, AI-driven efficiency, or operational improvements reducing cost structure. Margins compressing, not expanding.",
    "Evidence of pricing increases across customer base without churn (SOUGHT but NOT FOUND): Email hosting 706% increase drove immediate churn. No evidence of successful price increases in Public/Private Cloud (revenue declining faster than cost reductions).",
    "Evidence of labor cost arbitrage or offshore delivery expansion (SOUGHT but NOT FOUND): No announcements of offshore expansion, labor arbitrage strategies, or geographic cost optimization. Stage 1 constraints (Government requires US citizens, UK Sovereign requires UK staff) limit arbitrage opportunities.",
    "Evidence of major cost restructuring programs beyond incremental headcount cuts (SOUGHT but NOT FOUND): Headcount declined 12% proportional to revenue decline. No announced restructuring programs, facility exits (beyond single UK office), or business line exits (beyond email pricing desperation).",
    "Evidence of CapEx efficiency improvements or infrastructure refresh without cost increases (SOUGHT but NOT FOUND): CapEx declined 25% while revenue declined 13%, indicating UNDERINVESTMENT not efficiency. Aging infrastructure creates future maintenance cost and performance risks.",
    "Evidence of sales/marketing productivity improvements or customer acquisition efficiency (SOUGHT but NOT FOUND): Bookings growth 14% YoY but composition unclear (managed services ARR vs low-margin professional services TCV). No CAC reduction, sales cycle shortening, or productivity metrics disclosed.",
    "Evidence of new high-margin revenue engines or business lines emerging (SOUGHT but NOT FOUND): Email hosting collapsing, professional services likely low-margin, no new material revenue sources announced. Revenue mix deteriorating toward low-margin Public Cloud.",
    "Evidence of breakeven or profitability timeline provided by management (SOUGHT but NOT FOUND): No guidance on path to profitability, no turnaround plan disclosed, no margin expansion targets announced. Loss from operations $(909)M with no clear path to reversal.",
    "Evidence of customer satisfaction, NPS, or retention metrics supporting 'Fanatical Support' premium (SOUGHT but NOT FOUND): Historical articles (2011-2013) describe Fanatical Support loyalty. No recent NPS, CSAT, or retention data disclosed. Email pricing debacle suggests brand damage.",
    "Evidence of competitive wins, market share gains, or positive customer momentum (SOUGHT but NOT FOUND): Revenue declining 7% YoY both segments. Public Cloud declining 3% while hyperscaler market growing 20%+ indicates share loss. Private Cloud declining 13% indicates customer defection to public cloud.",
    "Evidence of successful pass-through of external cost increases to customers (SOUGHT but NOT FOUND): VMware price shock, hyperscaler credit risk, wage inflation cannot be passed through without churn. Month-to-month billing eliminates pricing power.",
    "Evidence of fixed cost reduction programs (data centers, infrastructure, overhead) (SOUGHT but NOT FOUND): Fixed costs creating negative operating leverage as revenue declines. SG&A 25.9% flat as % of revenue indicates no structural cost reduction.",
    "Evidence of SG&A functional efficiency improvements or technology-driven automation (SOUGHT but NOT FOUND): SG&A declined 7.8% proportional to revenue 7% decline. No operating leverage, no efficiency gains, no automation-driven cost reduction.",
    "Evidence of professional services converting to high-margin managed services ARR at high rates (SOUGHT but NOT FOUND): Bookings growth 14% YoY but conversion metrics not disclosed. Professional services revenue variability noted in earnings suggests lumpy project work, not sticky ARR conversion."
  ]
}
