{
  "uncertainty_register": [
    {
      "unknown": "EXACT VMWARE LICENSING COSTS AND BROADCOM PRICE INCREASE IMPACT: Annual VMware licensing spend (baseline and post-Broadcom increase), customer contract pass-through provisions, margin absorption vs customer churn tradeoff.",
      "type": "UNKNOWN",
      "decision_impact": "MARGIN VIABILITY: If VMware represents $100-150M annual cost and Broadcom increases are 200-300%, incremental cost is $200-450M. If Rackspace absorbs 50% ($100-225M), Private Cloud gross margin 38.6% ($407M gross profit) compresses to 17-29% ($182-307M gross profit after VMware shock). Private Cloud transitions from high-margin engine to low-margin business, destroying overall profitability. AFFECTS: Private Cloud viability, customer retention, migration strategy urgency.",
      "what_would_reduce_uncertainty": "ACCESS: Request VMware licensing agreements, annual spend 2022-2024, Broadcom renewal terms effective 2024-2026. ANALYSIS: Customer contract analysis - which customers have fixed pricing vs escalation clauses allowing VMware pass-through. SCENARIO: Model margin impact under scenarios: (A) 100% pass-through to customers (churn risk), (B) 50% absorption (margin compression), (C) platform migration timeline and costs."
    },
    {
      "unknown": "HYPERSCALER PARTNER CREDIT/REBATE EXACT TERMS AND SUSTAINABILITY: AWS and Google Cloud partner credit percentages, agreement term lengths, termination provisions, volume tier thresholds, change-of-control consent requirements.",
      "type": "UNKNOWN",
      "decision_impact": "PUBLIC CLOUD ECONOMIC VIABILITY: Public Cloud gross margin 10.4% ($175M on $1,683M revenue) is ENTIRELY DEPENDENT on hyperscaler credits estimated 5-15%. If actual credits are 5% (low end), margin is already at minimum. If actual credits are 15% (high end) but at risk of reduction, margin could compress to 5% or negative. If any hyperscaler terminates partnership, loses 20-30% of Public Cloud revenue/profit. AFFECTS: Public Cloud valuation, sustainability, strategic options.",
      "what_would_reduce_uncertainty": "ACCESS: Request AWS Consulting Partner Agreement, Google Cloud Partner Agreement, Azure CSP Agreement with full terms including Schedule A (partner credits/rebates). VALIDATION: Confirm volume tiers and current Rackspace performance against thresholds. RISK ASSESSMENT: Identify termination triggers, change-of-control consent requirements, competitive position vs other MSPs for hyperscaler favorability."
    },
    {
      "unknown": "DATA CENTER INFRASTRUCTURE UTILIZATION AND EXCESS CAPACITY COSTS: Current utilization % of data center capacity (servers, racks, power, cooling), geographic distribution, owned vs leased split, lease expiration schedule, carrying costs of underutilized assets.",
      "type": "UNKNOWN",
      "decision_impact": "STRANDED ASSET MAGNITUDE: Private Cloud revenue declining 13% YoY likely creates 10-30% underutilized capacity (infrastructure installed for previous revenue levels). If underutilized capacity represents $100-200M of annual carrying costs (depreciation, leases, facilities), this is PERMANENT DRAG on margins until capacity exited or revenue recovers. Cannot exit quickly - data center leases 3-10 years, asset depreciation 3-5 years fixed. AFFECTS: Private Cloud margin trajectory, facility rationalization urgency, asset impairment risk.",
      "what_would_reduce_uncertainty": "ACCESS: Request data center footprint report: facilities by location, owned vs leased, lease terms and expiration dates, installed capacity (racks, MW), current utilization %, underutilized capacity by location, annual carrying costs (depreciation, rent, power, cooling) by facility. ANALYSIS: Identify which facilities can be exited at lease expiration, which have early termination options, which require long-term commitments. SCENARIO: Model margin improvement from facility consolidation vs cost/risk of customer migrations."
    },
    {
      "unknown": "COST OF REVENUE DETAILED COMPOSITION BY SEGMENT: Public Cloud vs Private Cloud COGS breakdown (hyperscaler infrastructure pass-through %, personnel %, infrastructure depreciation %, facilities %, licenses %, other), semi-variable vs fixed cost split.",
      "type": "UNKNOWN",
      "decision_impact": "MARGIN IMPROVEMENT LEVERS: Without detailed COGS breakdown, cannot identify highest-impact cost reduction opportunities or margin expansion levers. If Public Cloud COGS is 90% variable (hyperscaler pass-through) and 10% fixed/semi-variable (personnel, overhead), then cost reduction opportunities limited. If Private Cloud COGS is 60% fixed (depreciation, facilities, licenses) and 40% variable (personnel, maintenance), then negative operating leverage from revenue decline is severe. AFFECTS: Cost reduction strategy, margin expansion feasibility, breakeven analysis.",
      "what_would_reduce_uncertainty": "ACCESS: Request segment P&L with detailed COGS line items: (1) Public Cloud: Hyperscaler infrastructure costs, delivery personnel (headcount and cost), overhead allocation, other; (2) Private Cloud: Infrastructure depreciation, VMware/vendor licenses, data center facilities (rent, power, cooling), delivery personnel, maintenance, overhead allocation, other. ANALYSIS: Classify each cost as fixed, semi-fixed, or variable. Identify cost reduction opportunities and margin sensitivity to revenue changes."
    },
    {
      "unknown": "HEADCOUNT BY FUNCTION AND SEGMENT ALLOCATION: Total headcount 5,100 (down 12% from 5,800) but allocation across delivery (Public Cloud, Private Cloud, Government, UK), sales/marketing, G&A, and cost per FTE by geography.",
      "type": "UNKNOWN",
      "decision_impact": "PERSONNEL COST STRUCTURE AND REDUCTION POTENTIAL: Personnel costs are largest component of SG&A ($708M) and significant portion of COGS (delivery engineers). Without headcount allocation, cannot assess: (1) Delivery headcount efficiency (engineers per $M revenue), (2) Sales productivity (ACV per sales rep), (3) Geographic cost arbitrage opportunity (onshore vs offshore vs nearshore), (4) Reduction feasibility (which functions overcapacity vs undercapacity). If delivery headcount is already lean (1 engineer per $2M+ ARR), further cuts degrade service. If overstaffed (1 engineer per $500K ARR), cuts possible. AFFECTS: Cost reduction magnitude, service quality risk, labor arbitrage opportunities.",
      "what_would_reduce_uncertainty": "ACCESS: Request headcount report by function: Delivery (Public Cloud, Private Cloud, Government, UK, Professional Services), Sales, Marketing, Product/Engineering, G&A (finance, HR, IT, legal, exec). Within delivery, breakdown by geography (US, UK, India, LATAM, other) and average cost per FTE by location. BENCHMARK: Compare Rackspace headcount ratios to industry (engineers per $M revenue, sales reps per $M new bookings, G&A as % of headcount). IDENTIFY: Overstaffed functions and labor arbitrage opportunities."
    },
    {
      "unknown": "EMAIL HOSTING BASELINE METRICS PRE-PRICE-INCREASE: Revenue, customer count, mailbox count, gross margin, operating margin, churn rate, competitive position before March 2026 price increase.",
      "type": "UNKNOWN",
      "decision_impact": "EMAIL HOSTING MATERIALITY AND EXIT DECISION: Cannot assess email hosting impact without baseline. If email hosting is 2% of revenue ($55M) and generates 5% margin, loss from churn is manageable ($2-3M margin impact). If email hosting is 8% of revenue ($220M) and generates 15% margin ($33M), churn creates material margin hole ($15-25M if churn is 50-70%). EXIT DECISION: If baseline margin is already negative or low single-digits, exit is rational. If baseline margin is 10-15%, price increase destroys profitable business. AFFECTS: 2026 revenue forecast, margin trajectory, exit timing and costs.",
      "what_would_reduce_uncertainty": "ACCESS: Request email hosting segment P&L 2022-2024: Revenue, customer count, mailbox count, COGS (platform costs, support personnel), gross margin, SG&A allocation, operating margin. Post-price-increase: Monthly churn rates March-June 2026, customer feedback, revenue impact. DECISION FRAMEWORK: Model scenarios: (A) Continue at loss to serve remaining customers, (B) Exit immediately (shutdown costs, customer migration costs, revenue loss), (C) Sell to consolidator."
    },
    {
      "unknown": "ACQUIRED ENTITY INTEGRATION COMPLETION AND COST STRUCTURE: Datapipe, Onica, TriCore, RelationEdge whether fully integrated (customers migrated, platforms consolidated, headcount consolidated) or still operating as separate units with duplicative costs.",
      "type": "UNKNOWN",
      "decision_impact": "COST STRUCTURE INEFFICIENCY MAGNITUDE: If acquired entities remain separate with own sales, delivery, G&A overhead, this creates 20-30% cost penalty vs fully integrated. $1.7B acquisition spend (2017-2019) should have generated $50-150M annual synergies if integrated. If NOT integrated, Rackspace is carrying $50-150M of duplicative costs that could be eliminated. If partially integrated (worst outcome per Stage 1), Rackspace paid integration costs but did not realize synergies. AFFECTS: Cost reduction potential, buyer integration workplan, hidden liabilities.",
      "what_would_reduce_uncertainty": "ACCESS: Request acquisition post-mortem: (1) Integration status by acquisition (complete, partial, minimal), (2) Customer platform migration % (Datapipe/Onica/TriCore customers on unified Rackspace platform vs legacy platforms), (3) Headcount consolidation (duplicative functions eliminated?), (4) Synergy realization (projected vs actual). IDENTIFY: Remaining integration work, duplicative systems/costs, potential for further consolidation or divestiture."
    },
    {
      "unknown": "GOVERNMENT AND UK SOVEREIGN REVENUE, MARGIN, AND COST STRUCTURE: Exact revenue contribution from Rackspace Government Solutions (FedRAMP) and UK Sovereign Services, segment-specific gross margins, dedicated infrastructure/personnel costs.",
      "type": "UNKNOWN",
      "decision_impact": "HIGH-MARGIN PREMIUM VS HIGH-COST BURDEN: Government and UK Sovereign likely command premium pricing (higher margins than commercial) due to compliance requirements. But Stage 1 identified ISOLATED infrastructure and personnel (US citizens for Government, UK-only for Sovereign) creating higher cost structure. Unknown if premium pricing exceeds incremental costs. If Government = 10-15% of revenue ($270-410M) with 45-50% gross margin (premium), it is critical margin contributor. If margin is only 25-30% (premium pricing offset by high costs), less valuable. If foreign buyer, Government revenue is ZERO VALUE (cannot acquire without FOCI). AFFECTS: Valuation, buyer universe, portfolio strategy.",
      "what_would_reduce_uncertainty": "ACCESS: Request Government Solutions and UK Sovereign Services separate P&Ls: Revenue 2022-2024, Customer count, Gross margin, COGS breakdown (dedicated infrastructure, isolated personnel, compliance costs), Operating margin. VALIDATION: Compare margins to commercial segments to quantify premium vs incremental costs. STRATEGIC: Assess buyer universe (US-only for Government, potential UK preference for UK Sovereign)."
    }
  ]
}
