{
  "uncertainty_register": [
    {
      "unknown": "Rackspace debt structure, covenants, and financial distress triggers under PE ownership",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL for shock survival assessment. If Rackspace has debt covenants on EBITDA (typical for PE buyouts), 10-15% revenue shock could trigger covenant breach within 1-2 quarters forcing immediate restructuring. If covenants include revenue maintenance or minimum cash requirements, shock impact timeline even shorter. Covenant structure determines whether shocks create: (A) operational challenges (manageable with time), or (B) immediate financial distress (restructuring/bankruptcy within 6-12 months). Typical LBO structures have 3-4x debt/EBITDA leverage, at $43M EBITDA implies $130-170M debt with quarterly covenant tests. Single quarter covenant miss can trigger lender control",
      "what_would_reduce_uncertainty": "MANAGEMENT ACCESS REQUIRED: Request debt agreements, covenant schedules, and quarterly compliance calculations. Alternative: Public debt filings if any bonds outstanding. Credit rating agency reports may discuss covenant structures. Without access: Assume PESSIMISTIC case (tight covenants, limited headroom, 10-15% EBITDA decline triggers breach) for stress scenarios given typical PE capital structures prioritize leverage and cash extraction."
    },
    {
      "unknown": "Historical Rackspace performance during 2008-2009 recession and 2020 COVID shock",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL for calibrating recession shock magnitude estimates. Company private during both periods (pre-2008 private, 2016-present private post-PE buyout), no public financial data available. Historical performance would inform: (1) Customer churn rates during macro stress (is 20-30% Mid-Market estimate conservative or aggressive?), (2) Pricing pressure magnitude (do customers demand 10% discounts or 30%?), (3) Recovery trajectory (does revenue recover in 12 months or 36 months?), (4) Management response patterns (prioritize margin defense or revenue retention?). Affects recession scenario probability-weighting and recovery feasibility assessments.",
      "what_would_reduce_uncertainty": "PARTIALLY REDUCIBLE: Interview former Rackspace executives (2008-2009 or 2020-2021 tenures) about recession response, customer behavior, financial impacts. Industry peer analysis (publicly traded hosting/MSP companies) for 2008-2009 and 2020 periods as proxy. Management discussion of lessons learned from prior shocks (if any). Without access: Use industry benchmarks (hosting sector saw 12-18% revenue decline 2008-2009, cloud MSPs saw mixed 2020 impacts) and assume Rackspace WORSE than average (given structural disadvantages documented in Stage 3.2)."
    },
    {
      "unknown": "Hyperscaler systematic vs opportunistic MSP customer targeting intensity",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL for Mid-Market churn rate forecasting. Stage 3.3 estimates $40-110M Public Cloud revenue at risk from hyperscaler targeting, range reflects uncertainty about INTENSITY. If systematic (dedicated programs, CRM-driven outreach, quota incentives), upper bound $110M over 2-3 years = 15-20% of Mid-Market base. If opportunistic (account teams approach when naturally encountering MSP customers), lower bound $40M over 4-5 years = 5-7% of base. Systematic targeting would ACCELERATE churn timeline (compressed into 2-3 years vs 4-5 years), change urgency of required responses. Also affects AI shock timing - if hyperscalers push AI tools + MSP displacement together, compounds impact.",
      "what_would_reduce_uncertainty": "PARTIALLY REDUCIBLE: Competitive intelligence from sales teams (how often do AWS/Azure account teams appear in renewals? are approaches proactive or reactive?). Customer conversations asking about hyperscaler outreach frequency and intensity. Former hyperscaler sales interviews about MSP displacement programs and incentives. Industry reports on hyperscaler partner strategy. Without access: Model TWO SCENARIOS - OPPORTUNISTIC (40% probability, $40-70M risk, 4-5 year timeline) and SYSTEMATIC (60% probability, $80-110M risk, 2-3 year timeline), weight toward systematic given hyperscaler strategic incentives documented in Stage 3.2."
    },
    {
      "unknown": "Apollo PE exit timeline, investment basis, and required return hurdles",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL for capital allocation and harvest mode assessment. Apollo acquired March 2016 (9 years ago per Stage 1.5), typical PE hold 4-7 years suggests LATE in hold period and seeking exit. Investment basis (purchase price) and target returns (20-25% IRR typical PE) determine: (1) Minimum acceptable exit valuation (below which Apollo won't sell), (2) Willingness to inject additional capital (unlikely if IRR targets unachievable), (3) Harvest intensity (maximize cash extraction vs maintain business health trade-off). If Apollo underwater on investment (purchase price exceeds current value), unlikely to sell creating indefinite hold with maximum harvest. If Apollo above water but below target return, might sell at discount. Affects CapEx trajectory, strategic investment feasibility, and business model sustainability.",
      "what_would_reduce_uncertainty": "MOSTLY UNKNOWABLE without management access: Apollo investment details confidential, valuation models proprietary. Proxy indicators: CapEx trends (declining 25% YoY per Stage 2.2 suggests harvest mode), public Apollo portfolio commentary (sometimes discusses hold period strategies), comparable PE exits in cloud/hosting sector for valuation benchmarks. Without access: Assume Apollo seeking exit but unable to find buyer at acceptable price (explains extended hold, harvest mode, underinvestment pattern), implies Rackspace operates in limbo state prioritizing cash generation over growth/investment."
    },
    {
      "unknown": "Rackspace capacity to respond to AI automation shock through own AI adoption",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL for AI shock survival feasibility. Could Rackspace adopt AI tools internally to: (1) Reduce delivery costs 30-40% (automation reduces FTE requirements), partially offsetting customer AI-driven churn, (2) Improve service quality with AI assistance (AI-augmented engineers more productive), OR does AI adoption ACCELERATE obsolescence (customers realize if Rackspace uses same AI tools, why pay markup vs using tools directly)? Trade-off: AI tools $5-15 per engineer seat (affordable) BUT customers adopt same tools making Rackspace unnecessary (business model paradox). Internal AI adoption might WORSEN positioning by demonstrating to customers that management is commoditizable.",
      "what_would_reduce_uncertainty": "PARTIALLY REDUCIBLE through strategic analysis and customer research. Test hypothesis: Do customers view MSP AI-adoption as value-add (improving service quality) or value-destruction (proving MSP unnecessary)? Survey customers on willingness to pay for AI-enhanced managed services vs adopting AI tools internally. Analyze whether ANY MSPs successfully using AI to defend market position or all experiencing churn acceleration. Without research: Assume AI adoption creates PARADOX - helps margins short-term (1-2 years reduced costs) but accelerates long-term obsolescence (3-5 years customers insource using same tools), net negative outcome."
    }
  ]
}
