{
  "unknowns_requests": [
    "DEBT AND COVENANT STRUCTURE: Request complete debt agreements including covenant schedules, quarterly compliance calculations for past 8 quarters, and covenant headroom analysis under stress scenarios. Critical for determining financial distress triggers and survival timeline under recession shock.",
    "HISTORICAL RECESSION PERFORMANCE: Request internal financial data for 2008-2009 recession period and 2020 COVID period including: quarterly revenue by segment, customer churn rates, pricing/discounting behavior, cost reduction actions taken, and recovery trajectories. Use to calibrate shock magnitude estimates and recovery feasibility.",
    "HYPERSCALER PARTNER AGREEMENTS: Request AWS, Azure, and Google Cloud partner agreements including: credit/discount structure, tier requirements, program change history 2020-2024, and any long-term guarantees. Critical for assessing partner credit erosion trajectory and Public Cloud margin sustainability.",
    "VMWARE CONTRACT TERMS: Request VMware/Broadcom licensing agreements including: price terms, escalation clauses, term commitments, renewal dates, and any price protection provisions. Critical for assessing Private Cloud shock exposure and timeline.",
    "APOLLO INVESTMENT DETAILS: Request Apollo purchase price (March 2016), investment structure (debt/equity split), target return hurdles, current valuation assessment, and exit strategy discussions. Determines harvest mode intensity and strategic investment feasibility.",
    "CUSTOMER WIN/LOSS ANALYSIS: Request competitive win/loss data for past 24 months showing: reasons for loss, alternative selected (hyperscaler-direct, competitive MSP, insourcing), customer segment, and revenue value. Use to validate hyperscaler targeting intensity estimates and churn driver analysis.",
    "SEGMENT PROFITABILITY DETAIL: Request P&L by segment (Private Cloud, Public Cloud, Government, UK Sovereign, Email) showing: revenue, gross margin, direct costs, allocated overhead, and operating income. Critical for validating profit concentration estimates from Stage 2.4 and segment viability under shocks.",
    "COMPLIANCE COST DETAIL: Request itemized compliance costs for: FedRAMP (initial and annual), UK Sovereign, ISO, SOC 2, and other certifications. Critical for assessing sovereignty shock cost impact and compliance burden sustainability.",
    "AI ADOPTION STRATEGY: Request management plans for: internal AI tool adoption (cost reduction potential, timeline, investment required), AI-enhanced service offerings (customer value proposition, competitive differentiation), and view of AI impact on MSP market (threat assessment, mitigation strategies).",
    "RECESSION SCENARIO PLANNING: Request management stress test scenarios including: recession assumptions (revenue decline magnitude, duration), customer churn estimates by segment, cost reduction plans, covenant compliance projections, and contingency plans if covenant breaches occur."
  ]
}
