{
  "unknowns_requests": [
    {
      "unknown": "Apollo Global Management investor rights agreement terms. Typical PE-backed public companies have investor rights agreements specifying: (1) Board nomination rights (number of seats, nomination process), (2) Information rights (access to financials, operations data), (3) Registration rights (demand and piggyback rights for selling shares), (4) Consent rights over major transactions (M&A, financing, dividends above thresholds), (5) Tag-along rights (right to participate in third-party sales), (6) Drag-along rights (ability to force minority shareholders to sell if Apollo sells), (7) Most-favored-nation provisions. No such agreement found in publicly available SEC filings.",
      "type": "UNKNOWN",
      "decision_impact": "CRITICAL: If Apollo has contractual governance rights beyond equity voting, those rights constrain acquirer even if acquirer buys Apollo's shares or completes tender offer. For example: (1) If Apollo has consent rights over M&A, Apollo consent required even if transaction approved by board and shareholders, (2) If Apollo has tag-along rights, Apollo must be included in any sale at same terms, (3) If Apollo has drag-along rights, Apollo can force minority shareholders to sell alongside Apollo in going-private transaction. Without knowing these terms, cannot fully assess what transactions are feasible or what Apollo's approval/participation is required.",
      "what_would_reduce_uncertainty": "Request from Rackspace management or review: (1) Form S-1 filed in connection with August 2020 IPO (Exhibits section), (2) Form 8-K filed August 2020 announcing IPO and listing material agreements, (3) Schedule of material contracts in most recent 10-K, (4) DEF 14A proxy statement disclosures of agreements with significant shareholders. If not publicly filed (some investor rights agreements are not filed if not deemed 'material'), would require management disclosure or data room access."
    },
    {
      "unknown": "Full board composition, size, and independence determinations. Know Apollo has 2 affiliated directors (Sobel, Mahidhar) and Independent Chairman (Benjamin as of Jan 2025), but total board size unknown. Do not know: (1) Number of independent directors, (2) Committee compositions (audit, compensation, nominating), (3) Whether company claims 'controlled company' exemption under NASDAQ rules (allows majority non-independent board if controlled by >50% shareholder), (4) Director election standards (plurality vs majority vote).",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: Board independence affects: (1) Ability of independent directors to check Apollo's influence (if independent majority exists), (2) Committee oversight quality (independent audit committee required by NASDAQ, but compensation and nominating may lack independence if controlled company), (3) Special committee necessity for related-party transactions (if board is majority Apollo-affiliated, all transactions with Apollo require special committee of independent directors), (4) Litigation risk (plaintiffs allege board capture by Apollo if insufficient independence). Cannot fully assess governance quality without board composition.",
      "what_would_reduce_uncertainty": "Review: (1) DEF 14A proxy statement for most recent annual meeting (lists all directors, independence determinations, committee memberships, election standards), (2) Board composition page on Rackspace IR website (ir.rackspace.com/corporate-governance/board-of-directors), (3) Corporate governance guidelines and committee charters (typically posted on IR website)."
    },
    {
      "unknown": "Management equity ownership percentages and vesting schedules. Know executives have employment agreements with equity grants (RSUs, options) but do not know: (1) Total equity ownership percentage for CEO, CFO, and top executives, (2) Vesting schedules and performance conditions, (3) Change-of-control acceleration provisions (single-trigger vs double-trigger), (4) Exercise prices for options and whether in-the-money or underwater at $0.48 stock price, (5) Restrictive covenants (non-compete duration and geography, non-solicit scope).",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: Management equity ownership affects: (1) Alignment with shareholders vs employment-focused incentives, (2) Change-of-control costs (accelerated vesting could trigger immediate expense and dilution), (3) Retention risk (if equity underwater, executives have minimal golden handcuffs), (4) Post-close integration cooperation (management with minimal economic stake may resist change), (5) Severance costs if management terminated (change-of-control severance multiples not publicly disclosed). At $0.48 stock price, likely that options are underwater and RSUs have minimal value, reducing retention incentive.",
      "what_would_reduce_uncertainty": "Review: (1) DEF 14A proxy statement Section on executive compensation (Summary Compensation Table, Outstanding Equity Awards table, employment agreement descriptions), (2) Schedule 13D/13G filings by executives if ownership >5% (unlikely but possible), (3) Form 4 insider trading reports showing grants and exercises (available on SEC EDGAR), (4) Employment agreements filed as Exhibits to 8-K or 10-K for severance and restrictive covenant terms."
    },
    {
      "unknown": "Revolving credit facility size, utilization, and borrowing base availability. Know springing financial covenant (5.0x leverage ratio) applies if revolver utilization exceeds 35% of commitments, but do not know: (1) Total revolver commitment amount, (2) Current drawn balance, (3) Available capacity, (4) Letters of credit outstanding (reduce availability), (5) Borrowing base calculation methodology (if asset-based), (6) Financial covenant testing frequency and most recent compliance calculation.",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: If revolver is highly utilized (approaching or exceeding 35% threshold): (1) Financial covenant becomes active and must be maintained quarterly, (2) Covenant headroom determines operational flexibility and acquisition capacity, (3) Breach triggers event of default and potential acceleration, (4) Liquidity position depends on available revolver capacity (if fully drawn, company has minimal cash runway). If revolver is minimally utilized (<35%), covenant is dormant and less concerning. Cannot assess liquidity or covenant risk without revolver details.",
      "what_would_reduce_uncertainty": "Review: (1) Most recent 10-Q or 10-K financial statement footnote on debt (Note on Long-Term Debt or Credit Facilities), (2) MD&A section discussing liquidity and capital resources, (3) Credit agreement filed as Exhibit 10.1 to Form 8-K March 7, 2024 (full agreement contains revolver terms and borrowing base definitions if applicable), (4) Compliance certificate delivered to lenders (not public, would require management disclosure)."
    },
    {
      "unknown": "Customer concentration and top customer revenue percentages. Do not know: (1) Whether any single customer represents >10% of revenue (requiring disclosure in 10-K), (2) Top 5 or top 10 customer concentration, (3) Whether major customers (government, financial services, healthcare) have change-of-control provisions in service contracts allowing termination upon ownership change, (4) Customer churn rates and retention metrics, (5) Contract assignment/novation requirements.",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: High customer concentration creates: (1) Revenue risk if top customer terminates (especially relevant if change-of-control clauses exist), (2) Effective veto power by customer over M&A if customer termination would impair valuation, (3) Integration risk if customer relationships are personal to current management/sales team, (4) Regulatory concerns (antitrust) if acquirer serves same customers. Customer contracts may require customer consent for assignment to acquirer, creating OPERATIONAL control constraint (though not governance control). Cannot assess customer concentration risk without revenue data.",
      "what_would_reduce_uncertainty": "Review: (1) Most recent 10-K Item 1 (Business) section discussing customer base and concentration, (2) 10-K financial statement footnote on revenue recognition or segment reporting (may disclose customer concentration if material), (3) Management customer list and contract schedule (data room document), (4) Representative customer contracts for standard change-of-control and assignment provisions."
    },
    {
      "unknown": "NASDAQ deficiency notice status and cure plan. Stock trading at $0.48 is below $1.00 minimum bid price requirement. Do not know: (1) Whether NASDAQ has issued formal deficiency notice, (2) Date of deficiency notice (if any) and expiration of cure period, (3) Company's plan to regain compliance (reverse stock split, going-private, other), (4) Whether company intends to maintain NASDAQ listing or voluntarily delist, (5) Whether credit agreement contains listing maintenance covenant (delisting could trigger default).",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: If deficiency notice issued and cure period expiring: (1) Company may be forced into reverse stock split (dilutes shareholders on pro rata basis but changes per-share economics), (2) Company may elect to delist and go dark or go private (removes public disclosure obligations and complicates minority squeeze-out), (3) Delisting triggers forced selling by institutional investors with listing requirements (drives price lower), (4) Delisting may trigger debt covenant violations if credit agreement requires listing. Cannot assess timeline or urgency of transaction without knowing NASDAQ status.",
      "what_would_reduce_uncertainty": "Review: (1) Recent 8-K filings for NASDAQ deficiency notice (must be disclosed within 4 business days), (2) Press releases addressing stock price or listing concerns, (3) 10-Q/10-K risk factors discussing exchange listing and compliance status, (4) Credit agreement to check for listing maintenance covenant, (5) Direct inquiry to Rackspace investor relations or NASDAQ listing qualifications department."
    },
    {
      "unknown": "Apollo's fund vintage, lifecycle stage, and exit timing pressures. Apollo acquired Rackspace in 2016 (Fund VIII or later), took public in 2020, retains majority stake in 2026. Do not know: (1) Which Apollo fund(s) hold the stake (Fund VIII, Fund IX, other), (2) Fund vintage and target return timeline (typical PE funds have 10-year life with 2-year extensions), (3) Whether Apollo's fund is approaching end-of-life requiring exit/distribution, (4) Apollo's cost basis and IRR expectations, (5) Whether Apollo is under LP pressure to exit or distribute.",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: Apollo's exit timing affects: (1) Willingness to sell at current valuation vs hold for recovery, (2) Receptiveness to acquisition offers or going-private transaction, (3) Pressure to extract value via dividends or recaps (subject to debt covenants), (4) Likelihood of secondary sale of Apollo's stake to another PE fund or strategic. If Apollo's fund is early in lifecycle, may hold for turnaround. If fund is late-stage, may seek exit at any reasonable price. Cannot assess Apollo's decision-making without understanding fund dynamics.",
      "what_would_reduce_uncertainty": "Research: (1) Apollo Global Management SEC filings or investor presentations identifying funds holding Rackspace stake, (2) Apollo fund vintages and lifecycle (public information on Apollo's website or industry databases), (3) Apollo's historical holding periods for similar portfolio companies (industry knowledge), (4) Press coverage of Apollo's investment in Rackspace (Wall Street Journal, Bloomberg) discussing Apollo's strategy or comments on exit plans."
    },
    {
      "unknown": "Litigation exposure quantum for Alpha Modus patent case and remaining ransomware class action. Know litigation exists but do not know: (1) Damages sought in Alpha Modus patent complaint (some patent cases seek $10-100M+ in reasonable royalties or lost profits), (2) Likelihood of Alpha Modus prevailing (patent validity, infringement evidence, Rackspace defenses), (3) Settlement value range for Alpha Modus case, (4) Remaining ransomware class action plaintiff count and damages theory (data breach cases often settle for $5-50M depending on scale), (5) Insurance coverage for litigation (D&O insurance, cyber insurance for ransomware).",
      "type": "UNKNOWN",
      "decision_impact": "MATERIAL: If patent or class action exposure is $50M+, creates: (1) Contingent liability affecting valuation, (2) Potential covenant violation if judgment impairs financial ratios, (3) Need for escrow or indemnity in acquisition agreement, (4) Acquirer reluctance if 'bet-the-company' litigation. If exposure is <$10M, likely immaterial to transaction. Cannot assess litigation risk without damages estimates and probability assessments.",
      "what_would_reduce_uncertainty": "Review: (1) Most recent 10-K or 10-Q Item 3 (Legal Proceedings) and Item 8 financial statement footnote on contingencies (may disclose range of loss if estimable), (2) Alpha Modus complaint filed in W.D. Texas (PACER docket or Bloomberg Law) for damages allegations, (3) Ransomware class action complaint for plaintiff count and damages claims, (4) Insurance policies (cyber insurance for ransomware, D&O for securities/class action) to assess coverage, (5) Engage outside litigation counsel for probabilistic damages assessment."
    }
  ]
}
