{
  "sub_stage": "3.1",
  "unknowns_requests": [
    {
      "priority": "CRITICAL",
      "unknown": "Hyperscaler partner credit agreement terms, rates, duration, and modification rights",
      "why_decision_critical": "Determines probability and timeline of Public Cloud margin compression threat ($84M profit at risk from 50% credit reduction). Difference between 'credit compression certain within 12 months' vs 'credit compression possible over 3-5 years' is material to business viability assessment and valuation. Public Cloud represents 61% of revenue - any threat to segment economics is existential.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Partner agreements with AWS, Azure, and Google including credit/rebate rates, contract duration, modification/termination provisions, volume commitments, (2) History of partner program changes over past 5 years (credit adjustments, requirement changes, tier modifications), (3) Management's assessment of partner program stability and expected changes. ALTERNATIVE: If full agreements not sharable, request summary of key commercial terms and management's view of margin sustainability.",
      "fallback_if_unavailable": "If management access unavailable, pursue: (1) Industry channel checks with other MSPs about their credit agreement terms and recent changes, (2) Hyperscaler partner manager outreach for program expectations, (3) Industry analyst reports on partner program trends. Accept elevated uncertainty but assume BASE CASE of gradual credit compression (2-5% reduction over 3-5 years) vs catastrophic compression (50% reduction in 12 months). Uncertainty increases valuation discount for partner dependency risk."
    },
    {
      "priority": "CRITICAL",
      "unknown": "Customer concentration - top 10, top 20 customers as percentage of revenue overall and by segment",
      "why_decision_critical": "Determines magnitude of single-customer and top-customer-cohort risk. Stage 2.4 estimates top 10-15 customers represent 15-25% of revenue, but uncertainty range is wide (could be 10% or 30%). If actual concentration at high end (top 10 customers = 25%+ of revenue), business has extreme tail risk from customer losses. If concentration at low end (top 10 customers = 10-15% of revenue), customer risk is more distributed and manageable. Material difference to downside scenario assessment and risk-adjusted valuation.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Customer concentration analysis showing top 10, top 20, top 50 customers as % of revenue, (2) Segment-level concentration (Government, Private Cloud, Public Cloud concentration separately), (3) Customer tenure and contract status for top accounts, (4) Historical customer concentration trends (increasing or decreasing over time), (5) Any >5% customers (even if below 10% disclosure threshold). This data is standard customer analytics, should be readily available.",
      "fallback_if_unavailable": "If management access unavailable, rely on Stage 2.4 estimates (top 10-15 customers 15-25% of revenue) but acknowledge wide uncertainty range. Use PUBLIC COMPANY DISCLOSURE THRESHOLD as floor: No customer >10% of revenue (else would require public disclosure per accounting rules), therefore top customer <10% and likely top 10 customers <20-25% aggregate. Build scenarios around concentration range 10-25% for top 10 customers."
    },
    {
      "priority": "HIGH",
      "unknown": "Broadcom VMware multi-year pricing trajectory and expected annual escalation rates",
      "why_decision_critical": "Determines Private Cloud segment viability timeline and magnitude of profit destruction. If VMware implements 10-20% annual escalations compounding on initial 200-300% increase, Private Cloud operating income falls from $315-420M currently to sub-$100M within 3-5 years, threatening business viability. If initial increase is final state, Private Cloud remains marginally viable though compressed. Difference is $200-300M operating income preservation vs destruction - CRITICAL to go-forward valuation and viability.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Latest VMware licensing agreement terms and pricing schedule, (2) Broadcom communications about future pricing expectations, (3) Rackspace's internal VMware cost forecasts for next 3-5 years, (4) Alternative platform migration analysis (OpenStack, Hyper-V feasibility, cost, and risk assessment), (5) Customer conversations about VMware cost pass-through acceptance or resistance. This directly impacts Private Cloud business case and strategic options.",
      "fallback_if_unavailable": "If management access unavailable, research Broadcom earnings calls and investor materials for VMware strategy signals. Interview VMware customers and industry analysts about observed pricing behavior post-acquisition. Assume BASE CASE of 5-10% annual escalations compounding (consistent with Broadcom historical pattern at CA Technologies and Symantec) creating continued margin compression. Model Private Cloud operating income declining from $315-420M currently to $150-250M over 5 years from VMware cost inflation, making segment marginally viable but not growth-capable."
    },
    {
      "priority": "HIGH",
      "unknown": "Public Cloud revenue distribution across hyperscalers (AWS vs Azure vs Google %)",
      "why_decision_critical": "Determines single-hyperscaler dependency risk and multi-cloud value proposition validity. If Public Cloud revenue is 70%+ concentrated on single hyperscaler (e.g., AWS), dependency risk is maximum - single partner credit reduction or program change is existential threat. If revenue is balanced (e.g., 40% AWS, 40% Azure, 20% Google), Rackspace has partial hedge through diversification and genuine multi-cloud management value. Also determines negotiating leverage with each hyperscaler. Material to assessing partner dependency risk magnitude.",
      "information_request": "REQUEST: Rackspace management provision of: (1) Public Cloud revenue breakdown by hyperscaler (AWS, Azure, Google, others), (2) Customer distribution across single-cloud vs multi-cloud deployments (what % of customers genuinely use 2+ clouds?), (3) Growth trends by hyperscaler over past 3 years (is concentration increasing or diversifying?), (4) Revenue at risk from each hyperscaler (if AWS partnership terminated, what % of Public Cloud revenue is lost?). This is fundamental operational data for Public Cloud business.",
      "fallback_if_unavailable": "If management access unavailable, use INDUSTRY BENCHMARK estimates: Typical MSP distribution approximately 50-60% AWS, 30-40% Azure, 10% Google based on hyperscaler market shares and MSP partnership patterns. Apply this distribution to Rackspace Public Cloud $1,683M revenue: ~$900M AWS, ~$600M Azure, ~$180M Google. Acknowledge that Rackspace-specific distribution could differ materially (e.g., could be 70% AWS if early partnership favored AWS). Use benchmark for base case but test sensitivity to 70% single-hyperscaler concentration scenario."
    },
    {
      "priority": "MODERATE",
      "unknown": "Competitive MSP margin structures and pricing benchmarks",
      "why_decision_critical": "Determines whether Rackspace's 10.4% Public Cloud gross margins are competitive, below-market, or above-market, affecting assessment of Rackspace's relative positioning and margin compression trajectory. If competitors achieve 12-15% margins, Rackspace is underperforming (operational issue, potentially fixable). If competitors at 8-10% margins, industry-wide compression is confirmed (structural, unfixable). However, Stage 3.1 analysis already established structural forces driving compression, so this is confirmatory rather than decisional.",
      "information_request": "REQUEST: Rackspace competitive intelligence provision of: (1) Competitor MSP pricing from lost RFP responses, (2) Industry surveys or consulting reports on MSP economics and margins, (3) Public MSP peer financial analysis (2U/Presidio if disclosed, international MSPs with public financials), (4) Customer feedback on relative MSP pricing and perceived value. This helps confirm Rackspace positioning vs market.",
      "fallback_if_unavailable": "If unavailable, proceed with assumption that Rackspace 10.4% Public Cloud margin is AT OR SLIGHTLY ABOVE industry commodity floor based on: (1) Stage 2.5 documents 89.6% hyperscaler value capture leaving 10.4% for MSP layer, (2) Commoditization analysis suggests margins compressing toward single digits over time, (3) 10.4% is consistent with commodity reseller economics in mature technology markets. Use 8-12% as likely industry range for Public Cloud MSP margins, with Rackspace at middle-to-upper end currently but compressing toward lower end over 3-5 years."
    },
    {
      "priority": "MODERATE",
      "unknown": "Enterprise customer cloud expertise maturation rate and MSP dependency trajectory",
      "why_decision_critical": "Determines MSP value proposition erosion speed and therefore Rackspace revenue trajectory timeline. If enterprises rapidly building internal cloud capabilities (50%+ with cloud COEs within 3 years), MSP demand collapses quickly. If customer expertise growth is slower (cloud skills shortage persists), MSP value proposition has longer lifespan. Affects investment horizon and exit timing urgency - fast expertise growth requires exit within 3-5 years, slow growth provides 7-10 year runway.",
      "information_request": "REQUEST: Customer research through: (1) Enterprise IT hiring trends and cloud engineer job posting growth rates, (2) Cloud certification volumes from AWS/Azure/Google training partners, (3) Enterprise customer surveys about cloud operating model evolution (insource vs outsource roadmaps), (4) Rackspace customer interviews about future managed services needs, (5) Analysis of customer service ticket volumes/types over time (declining complexity = increasing customer capability). This research quantifies customer capability growth rate.",
      "fallback_if_unavailable": "If research not feasible, use BASE CASE assumption: Enterprise cloud expertise maturing at 20-30% improvement annually (measured by reduction in MSP service dependency per customer over time). At this rate, mid-market customers reduce MSP spend by 50% over 3-4 years as they build internal capabilities, aligning with Stage 2.4 estimated 15-25% annual mid-market churn. This implies MSP value proposition half-life of 3-4 years in mid-market, longer in enterprise (5-7 years due to complexity), shorter in SMB (already minimal MSP dependency). Use this timeline for modeling MSP demand trajectory."
    },
    {
      "priority": "MODERATE",
      "unknown": "Hyperscaler strategic intent toward MSP channel - permanent vs transitional partner strategy",
      "why_decision_critical": "Determines MSP channel structural viability horizon. If hyperscalers view channel as strategic permanent go-to-market, MSP model has 10+ year viability despite margin pressure. If channel is transitional (disintermediation strategy), MSP model has 3-5 year finite lifespan. Current evidence (hyperscaler direct managed services expansion per Stage 2.5) suggests 'transitional' but not conclusive. Material to assessing whether Rackspace has time for transformation vs requires immediate exit.",
      "information_request": "REQUEST: Hyperscaler channel strategy research through: (1) Analysis of hyperscaler earnings calls and partner event keynotes for channel messaging, (2) Hyperscaler partner program investment trends (expanding or contracting resources?), (3) Hyperscaler direct vs channel sales mix trends over 5 years, (4) Interviews with hyperscaler channel leaders, (5) Observation of hyperscaler customer solicitation behavior (are they maintaining channel discipline or actively poaching MSP customers?). Combination of public statements, investment patterns, and competitive behavior reveals true strategic intent.",
      "fallback_if_unavailable": "If research unavailable, use EVIDENCE-BASED INFERENCE from Stage 2.5: Hyperscalers launching direct managed services (AWS MS, Azure MS) competing with MSP model is REVEALED PREFERENCE indicating disintermediation strategy. If hyperscalers were strategically committed to channel, would not compete directly. Assume BASE CASE: Hyperscalers pursuing GRADUAL DISINTERMEDIATION - tolerating channel while building direct capabilities, will phase out channel over 5-10 years as direct managed services mature. This implies MSP model has finite lifespan, declining from current 61% of revenue toward 30-40% over 5 years then further toward elimination over 10 years. Plan accordingly for managed decline."
    }
  ]
}
