{
  "document_metadata": {
    "title": "Stage 2 Orientation - Business Model & Revenue Engine Reality",
    "version": "1.0",
    "created_date": "2026-02-05",
    "status": "APPROVED",
    "target_entity": "Rackspace Technology",
    "stage_type": "ORIENTATION_COMPLETE_EXECUTION_IN_PROGRESS",
    "governed_by": "STAGE_0_DILIGENCE_CONSTITUTION.json"
  },
  "stage_2_intent": {
    "primary_purpose": "Determine how the enterprise actually creates, captures, transfers, and erodes business value — in practice, not in narrative. This stage answers: Where value is created, How value flows through the enterprise, Where value is constrained, leaked, or fragile, Which parts of the business matter disproportionately to outcomes.",
    "discovery_domains": [
      "True revenue engines (mechanisms, not labels or reported segments)",
      "Value exchange with customers (what customers actually pay for)",
      "Revenue mechanics and pricing logic across lines of business",
      "Revenue concentration and dependency risks",
      "Margin generation vs margin destruction by business line",
      "Dependencies and brittleness in revenue generation",
      "Structural constraints on revenue engines from Stage 1 findings",
      "Value leakage points (cost, churn, inefficiency, constraints)"
    ],
    "why_business_reality_not_narrative": [
      "Reported segments may not reflect actual value creation mechanisms",
      "Revenue recognition may obscure where value is truly generated",
      "Customer contracts may reveal different economics than segment reporting",
      "Hidden dependencies (vendor partnerships, key customers) create fragilities",
      "Stage 1 structural constraints may render certain revenue streams non-portable or at-risk"
    ],
    "stage_2_focus": "WHAT IS, not WHAT SHOULD BE. Business model decomposition into value-creating mechanisms. Mapping of revenue, cost, margin, and dependency flows. Identification of where value is processed, engineered, delivered, or lost. Grounding of 'the business' in operational and economic facts."
  },
  "stage_2_explicit_non_goals": {
    "prohibited_activities": [
      "Propose strategic options or growth initiatives",
      "Recommend investments, divestitures, or transformations",
      "Evaluate management quality or execution effectiveness",
      "Design target operating models or future-state architectures",
      "Assess 'fit' for a specific buyer or investment strategy",
      "Develop product roadmaps or innovation agendas",
      "Create data or AI strategies",
      "Generate recommendations of any kind"
    ],
    "prohibited_analysis_types": [
      "Strategy assessment (business model discovery ≠ strategy evaluation)",
      "Turnaround planning or operational improvement recommendations",
      "Competitive positioning evaluation (beyond describing current reality)",
      "Investment thesis validation or buyer suitability analysis",
      "Performance benchmarking implying 'good' or 'bad' execution"
    ],
    "boundary_violations": [
      "Using prescriptive phrases: 'should optimize', 'could improve', 'needs to pivot'",
      "Characterizing revenue engines as 'attractive' or 'problematic' relative to investment thesis",
      "Proposing pricing changes, market expansions, or product strategies",
      "Extrapolating from current business model to future potential without evidence",
      "Treating discovery findings as implicit recommendations"
    ],
    "stage_2_is_about": "BUSINESS REALITY, not aspiration. Decomposition, not judgment. Discovery, not prescription.",
    "stage_2_is_not_about": "Strategy, growth plans, turnarounds, roadmaps, recommendations, future-state models."
  },
  "stage_2_failure_conditions": {
    "invalidation_triggers": [
      {
        "condition": "Revenue Engines Mirror Reported Segments Without Challenge",
        "description": "Analysis accepts management's segment definitions as true revenue engines without validating value creation mechanisms. Treating 'Product Line A' or 'Geographic Region X' as sufficient explanation of how money is made."
      },
      {
        "condition": "Value Exchange Lacks Economic Grounding",
        "description": "Cannot explain 'where the dollar comes from and why it exists.' Describing what customers buy without explaining pricing logic, revenue triggers, or margin mechanics."
      },
      {
        "condition": "Structural Constraints from Stage 1 Ignored",
        "description": "Business model analysis proceeds without incorporating entity constraints, jurisdictional lock-ins, contractual limitations, or regulatory restrictions identified in Stage 1. Assumes mobility or flexibility that Stage 1 disproved."
      },
      {
        "condition": "'What Breaks If Touched' Not Explicit",
        "description": "Revenue engines described without identifying dependencies, fragilities, or failure modes. No touch test applied to determine what happens if revenue source is disrupted, moved, or changed."
      },
      {
        "condition": "Hypotheses Implicit or Untested",
        "description": "Business model assertions made without explicit hypothesis development, supporting evidence, disconfirming evidence searches, or falsification attempts."
      },
      {
        "condition": "Uncertainty Smoothed or Resolved Prematurely",
        "description": "Unknowns treated as knowns. Ranges collapsed to point estimates. Ambiguity resolved by assumption rather than preserved and documented."
      },
      {
        "condition": "Claims Lack Traceable Evidence Lineage",
        "description": "Revenue figures, customer data, pricing mechanics cited without source attribution. Mixing FACT (from documents) with INFERENCE (derived) with UNKNOWN (not found) without clear tagging."
      },
      {
        "condition": "Analysis Drifts Into Strategy or Prescription",
        "description": "Discovery findings presented with implicit or explicit 'shoulds.' Business model analysis becomes business model assessment with judgment about quality or improvement opportunities."
      }
    ],
    "false_completeness_indicators": [
      "Revenue engines described but value capture mechanisms unexplained",
      "Customer segments listed but value exchange logic missing",
      "Pricing models stated but margin economics not decomposed",
      "Dependencies mentioned but fragility drivers unspecified",
      "Concentration risks noted but impact of loss scenarios not quantified",
      "Stage 1 constraints acknowledged but not integrated into revenue portability analysis"
    ],
    "outputs_that_signal_failure": [
      "Conclusions that certain revenue is 'good' or 'bad' without defining criteria",
      "Recommendations disguised as observations (e.g., 'the business would benefit from...')",
      "Treating reported segment profitability as actual economic value creation without validation",
      "Ignoring that revenue may be structurally locked to entities that cannot be moved (per Stage 1)",
      "Presenting business model as unified when Stage 1 proved jurisdictional fragmentation prevents consolidation"
    ]
  },
  "dependencies_from_stage_1": {
    "binding_constraints": [
      "Entity structure and jurisdictional separation must be respected in revenue attribution",
      "Government/sovereign revenue tied to specific entities with non-transferable authorizations",
      "Multi-jurisdictional operations preventing consolidation must inform business model fragmentation analysis",
      "Debt covenants and change-of-control provisions affect revenue portability and buyer constraints",
      "Contractual obligations (customer, vendor, partner agreements) constrain business model flexibility"
    ],
    "what_breaks_if_stage_1_ignored": [
      "Revenue attributed to 'the company' when actually locked in separate jurisdictional entities",
      "Business model appears unified when Stage 1 proved it's portfolio of separate businesses",
      "Value transfer assumes flexibility when Stage 1 identified permanent structural lock-ins",
      "Integration synergies assumed when Stage 1 proved consolidation is legally/operationally prohibited"
    ],
    "stage_1_outputs_required_for_stage_2": [
      "Entity structure map (which revenue flows through which legal entities)",
      "Jurisdictional constraints (FedRAMP government entity, UK Sovereign isolation, China local entity)",
      "Contractual restrictions (debt covenants, customer change-of-control provisions, vendor agreements)",
      "Ownership and control reality (Apollo 53-57% ownership, public shareholders, board control)",
      "Historical path dependencies (acquisitions, LBO legacy, IPO structure)"
    ]
  },
  "core_questions_stage_2_addresses": {
    "note": "These are orientation questions only. They define scope but are NOT answered in this orientation document.",
    "questions": [
      "What are the enterprise's true revenue engines (not just reported segments)?",
      "Where is value actually created versus merely accounted for?",
      "Which activities are margin-generative, margin-neutral, or margin-destructive?",
      "Where are dependencies brittle, concentrated, or opaque?",
      "Which parts of the business disproportionately affect outcomes?",
      "Where does value leakage occur (cost, churn, inefficiency, constraints)?",
      "Which value flows are structurally constrained by Stage 1 findings?",
      "How does revenue trigger and what is the pricing logic for each engine?",
      "What customers are actually paying for (economic value proposition)?",
      "What breaks if revenue engine is disrupted, moved, or changed?"
    ]
  },
  "anticipated_stage_2_sub_stages": {
    "note": "These are directional placeholders only. No execution is authorized in this orientation document.",
    "sub_stages": [
      {
        "sub_stage": "2.1",
        "theme": "Business Model & Revenue Engine Reality",
        "scope": "Identify true revenue engines, value exchange mechanisms, pricing logic, dependencies, and structural constraints from Stage 1"
      },
      {
        "sub_stage": "2.2",
        "theme": "Cost Structure & Margin Physics",
        "scope": "Decompose cost structure, identify margin generation vs destruction by business line, understand fixed vs variable cost dynamics, assess operational leverage"
      },
      {
        "sub_stage": "2.3",
        "theme": "Customer & Value Realization Dynamics",
        "scope": "Understand who customers are, why they pay, how value is delivered, retention/churn dynamics, customer acquisition economics, concentration risks"
      },
      {
        "sub_stage": "2.4",
        "theme": "Value Chain & Operational Flow",
        "scope": "Map how value flows from inputs through operations to customers, identify bottlenecks, dependencies on suppliers/partners, operational constraints"
      },
      {
        "sub_stage": "2.5",
        "theme": "Dependency Concentration & Fragility",
        "scope": "Identify concentrated dependencies (key vendors, partners, platforms, personnel), assess brittleness, understand what breaks if dependencies fail"
      },
      {
        "sub_stage": "2.6",
        "theme": "Geographic & Organizational Distribution of Value Creation",
        "scope": "Understand where value is created geographically and organizationally, assess portability, identify localized value that cannot be moved"
      }
    ]
  },
  "stage_2_hypothesis_register": {
    "governance_note": "Per Stage 0.3 requirements: hypotheses must be falsifiable, evidence-based (not narrative-based), focused on business model mechanics (not performance quality)",
    "hypothesis_development_approach": [
      "Develop hypotheses about HOW the business makes money, not WHETHER it makes money well",
      "Test value creation mechanisms against evidence (contracts, pricing data, customer interviews)",
      "Seek disconfirming evidence that challenges assumptions about revenue engines",
      "Preserve uncertainty when evidence is insufficient to support or refute hypothesis"
    ],
    "example_hypotheses_for_orientation_only": [
      {
        "example": "Revenue Engine 1 generates value through X mechanism, priced via Y logic, dependent on Z partnerships",
        "falsifiable_via": "Customer contracts showing actual pricing terms, partner agreements showing revenue share or dependencies, financial disclosures showing margin by segment"
      },
      {
        "example": "High-margin revenue is concentrated in business line A which is structurally locked to Entity X per Stage 1 constraints",
        "falsifiable_via": "Segment profitability data, entity-level revenue attribution, regulatory authorizations tied to specific entity, portability restrictions"
      },
      {
        "example": "Revenue trigger is consumption-based (not subscription), creating volatility and low customer switching costs",
        "falsifiable_via": "Customer contracts showing billing terms, revenue recognition policies, churn rates, contract duration analysis"
      }
    ],
    "note": "Actual hypotheses will be developed during sub-stage execution, not in orientation."
  },
  "output_protocol": {
    "multi_file_json_structure": "Each sub-stage will produce separate JSON files (not monolithic objects) to prevent content duplication and ensure atomic validation",
    "required_file_types_per_sub_stage": [
      "revenue_engines.json or equivalent primary analysis file",
      "concentration_and_fragility.json or risk decomposition file",
      "hypotheses.json with supporting/disconfirming evidence tracking",
      "uncertainty_register.json documenting unknowns with decision impact",
      "disconfirming_evidence_not_found.json listing evidence sought but not discovered",
      "unknowns_requests.json specifying information needed from management or further diligence"
    ],
    "claim_tagging_mandatory": "All claims must be tagged FACT (from documents) or INFERENCE (derived) or UNKNOWN (not found) with evidence sources cited",
    "touch_test_requirement": "Every revenue engine, cost driver, and value flow must specify 'what breaks if touched' explicitly",
    "stage_1_constraint_integration": "All Stage 2 outputs must reference and respect Stage 1 structural constraints where applicable"
  },
  "stage_2_entry_criteria": {
    "prerequisites": [
      "Stage 1 has formally PASSED validation",
      "All Stage 1 redo items (if any) are resolved",
      "Stage 0 controls remain intact and enforceable",
      "Stage 2 Orientation approved"
    ],
    "readiness_confirmation": "Stage 1 validation confirms: Entity structure mapped, ownership/control reality established, contractual/regulatory constraints documented, structural lock-ins identified, false flexibility assumptions invalidated.",
    "stage_1_outputs_available": [
      "1.1.entities.json",
      "1.2.control_reality.json",
      "1.3.structural_debt_map.json",
      "1.4.contractual_constraints.json",
      "1.5.structural_lock_ins.json",
      "1.V.truth_map.* (validation outputs)"
    ]
  },
  "stage_2_execution_readiness": {
    "orientation_status": "COMPLETE",
    "approval_status": "APPROVED",
    "next_action": "PROCEED_TO_STAGE_2.1_EXECUTION (or subsequent sub-stages as directed)",
    "constitutional_compliance": "CONFIRMED",
    "evidence_standards_binding": true,
    "hypothesis_falsification_mandatory": true,
    "stage_1_constraints_binding": true,
    "discovery_not_prescription_enforcement": "ACTIVE"
  }
}
