{
  "sub_stage": "6.3",
  "document_metadata": {
    "title": "Untouchable Systems - Platforms Where Change Is Prohibited or Irrational",
    "target_entity": "Rackspace Technology, Inc.",
    "analysis_date": "2026-02-10",
    "scope": "Documentation of specific platforms that cannot be changed, replaced, or significantly modified without catastrophic business impact"
  },
  "untouchable_systems": [
    {
      "platform": "FedRAMP Authorization & Continuous Monitoring Platform",
      "why_untouchable": "Platform is COMPLIANCE GATE for all U.S. federal government revenue. FedRAMP Joint Authorization Board (JAB) authorization is ENTITY-SPECIFIC and tied to specific security controls, monitoring processes, and evidence generation capabilities documented in System Security Plan (SSP) and assessed annually. ANY material change to security controls, monitoring tools, or compliance processes requires: (1) Security impact analysis and JAB notification, (2) POA&M (Plan of Action & Milestones) if change creates gap vs current authorization, (3) Potential supplemental assessment if change is significant ($50K-$200K cost, 2-4 months timeline), (4) Risk of ATO (Authority to Operate) suspension if change degrades security posture. Change approval timeline: 3-12 months depending on significance. During this period, federal customers cannot expand services and may suspend new projects pending approval. Platform contains: (1) Vulnerability scanning tools required to meet FedRAMP timelines (critical findings must be remediated within 30 days, high findings within 90 days), (2) Continuous monitoring data feeds to JAB and agency SOCs, (3) Evidence generation for 800+ NIST 800-53 security controls, (4) Audit trail systems for access, changes, and incidents. TRIBAL KNOWLEDGE: Senior compliance staff (15+ years federal experience) understand nuances of: which findings JAB will accept vs. reject, how to phrase remediation plans to satisfy assessors, which compensating controls are acceptable, how to navigate agency-specific requirements beyond JAB baseline. This knowledge CANNOT be documented fully - it's experiential judgment developed through dozens of assessments and audits.",
      "what_breaks_if_changed": "SCENARIO 1 - Monitoring Tool Replacement: Replace current vulnerability scanner with different vendor. BREAKS: (1) FedRAMP evidence format incompatible (assessors expect specific report format, new tool produces different format), (2) False positive/negative rates differ (new tool flags issues old tool didn't, or misses issues old tool caught - either creates assessment confusion), (3) Continuous monitoring dashboard integration fails (JAB portal expects data in specific schema), (4) Annual assessment failure risk (assessors see unexplained changes in scan results, question data reliability). SCENARIO 2 - Process Automation: Automate manual compliance tasks to improve efficiency. BREAKS: (1) Audit trail gaps (automation may not log actions with same detail as manual processes), (2) Assessor objections ('how do we verify automated control is working as claimed?'), (3) Exception handling failures (manual processes handle edge cases, automation may miss them), (4) Compliance team job elimination fear (resistance to automation from team whose expertise is process execution). SCENARIO 3 - Multi-Entity Consolidation: Merge Rackspace Government Solutions compliance platform with commercial Rackspace. BREAKS: (1) FedRAMP authorization IMMEDIATELY INVALID (authorization is entity-specific, cannot transfer to merged entity), (2) All federal customers lose authorized service provider (must migrate to alternative FedRAMP vendor or wait for Rackspace re-authorization), (3) 12-18 month re-authorization timeline during which ZERO new federal revenue possible, (4) Government revenue likely LOST PERMANENTLY (customers won't wait 12-18 months, will switch to competitor FedRAMP providers).",
      "severity": "HIGH",
      "evidence_sources": [
        "Stage 1.5 structural lock-ins: FedRAMP JAB authorization entity-specific, serves >50% cabinet agencies, 12-18 month re-authorization upon entity change",
        "FedRAMP requirements: 800+ NIST 800-53 controls, annual assessments, continuous monitoring, vulnerability remediation timelines",
        "Stage 6.3 platform fragility map: FedRAMP platform categorized as CATASTROPHIC blast radius",
        "Industry practice: Federal compliance platforms are untouchable - change risk too high relative to benefit, agencies prioritize stability over modernization"
      ]
    },
    {
      "platform": "UK Sovereign Infrastructure Stack (Compute, Network, Storage, Management Plane)",
      "why_untouchable": "Infrastructure is ARCHITECTURALLY ISOLATED per UK data sovereignty requirements - 'platforms and support teams are isolated from the Rackspace Technology global network to ensure no access is possible to sovereign platforms.' Isolation is CUSTOMER REQUIREMENT (UK government, NHS, police, FCA/PRA regulated financial services, pharma) and COMPLIANCE MANDATE (UK data must stay in UK, accessed only by UK personnel, stored on UK infrastructure). VMware Sovereign Cloud certification (January 2026) is ARCHITECTURE-SPECIFIC - validates that infrastructure meets sovereignty requirements through technical controls not just policy. ANY consolidation with global infrastructure VIOLATES sovereignty: (1) If UK data touches non-UK infrastructure = data residency breach, (2) If non-UK personnel can access UK systems = sovereignty breach, (3) If management plane shared with global = potential access path violates isolation. Cannot achieve cost savings through consolidation - sovereignty REQUIRES separation. Cannot leverage global operations scale - UK team must be dedicated. Cannot use offshore support - 100% UK-based personnel required. Platform exists in PARALLEL to global infrastructure - duplicate everything (monitoring, ticketing, IAM, provisioning) for UK segment. ECONOMICS: UK Sovereign Services launched March 2024 likely operates at LOWER MARGIN than global services due to: (1) Smaller scale (UK only vs. global), (2) Duplicate infrastructure investment (cannot amortize across larger base), (3) Isolated operations team (cannot share resources with global NOC), (4) Compliance overhead (VMware Sovereign Cloud certification, ongoing UK regulatory engagement).",
      "what_breaks_if_changed": "SCENARIO 1 - Infrastructure Consolidation: Merge UK Sovereign PODs onto global multi-tenant platform to reduce costs. BREAKS: (1) UK data sovereignty IMMEDIATE VIOLATION (UK customer data now on global platform accessible from non-UK), (2) VMware Sovereign Cloud certification INVALID (certification tied to isolated architecture), (3) NHS customers IMMEDIATE CONTRACT BREACH (Class V risk data requirements specify UK-only infrastructure), (4) UK government agencies IMMEDIATE CONTRACT TERMINATION (data sovereignty is non-negotiable requirement), (5) FCA/PRA regulated financial services customers REGULATORY BREACH (must exit immediately to comply with regulator requirements), (6) Customer lawsuits LIKELY (customers contracted for sovereign infrastructure, Rackspace delivered non-compliant infrastructure = material breach, damages claimable). SCENARIO 2 - Operations Team Consolidation: Use global NOC to support UK Sovereign customers (eliminate dedicated UK team). BREAKS: (1) Non-UK personnel accessing UK sovereign systems = sovereignty breach, (2) 24/7 coverage requires offshore teams (India, LATAM) common in global NOC = data leaving UK via support access, (3) Customer audit failure (customers audit Rackspace annually, find non-UK personnel have access = audit failure, contract review). SCENARIO 3 - Management Plane Integration: Connect UK Sovereign management systems to global monitoring/ticketing/billing for operational efficiency. BREAKS: (1) Access path created from global to UK Sovereign = sovereignty isolation violated, (2) Security concern (global systems potentially accessible from outside UK, creates indirect path to UK data), (3) Compliance assessors reject (architecture no longer demonstrates 'no access possible' from global network). REALITY: UK Sovereign infrastructure is PERMANENTLY SEPARATE - cannot touch without destroying business rationale for UK customers choosing Rackspace over competitors.",
      "severity": "HIGH",
      "evidence_sources": [
        "Stage 1.5 structural lock-ins: UK Sovereign Services architecturally isolated, launched March 2024, VMware Sovereign Cloud certified January 2026",
        "Rackspace announcement March 27, 2024: 'Platforms and support teams are isolated from the Rackspace Technology global network'",
        "Target customers: UK government, NHS (Class V risk data), police, FCA/PRA financial services, pharma - all require data sovereignty",
        "Stage 6.3 platform fragility map: UK Sovereign categorized as CATASTROPHIC blast radius"
      ]
    },
    {
      "platform": "Billing, Revenue Recognition, and Hyperscaler Consumption Reconciliation System",
      "why_untouchable": "System is REVENUE REALIZATION ENGINE for $2,738M total revenue. Billing system failure or inaccuracy has IMMEDIATE financial impact: (1) Cannot generate customer invoices = revenue recognition delayed (SEC reporting timeline at risk, investors see revenue decline), (2) Incorrect invoices = customer disputes, payment refusals, trust damage, potential churn, (3) Under-billing = Rackspace loses margin (hyperscaler costs must be paid regardless of customer billing errors), (4) Over-billing = customer refunds, credits, relationship damage. System complexity is HIGH due to: (1) Three hyperscaler partner portals (AWS, Azure, Google Cloud) with different APIs, data schemas, update frequencies - must reconcile all three, (2) Multi-currency billing (USD, GBP, EUR, SGD, etc.) with currency conversion and localization, (3) Multi-entity revenue attribution (100+ legal entities across jurisdictions), (4) Customer-specific pricing (enterprise customers have negotiated rates, discounts, committed use discounts, custom terms - thousands of unique pricing agreements), (5) Partner credit application (5-15% estimated credits from hyperscalers must be applied correctly to Rackspace cost but not customer charge). System likely CUSTOM-BUILT or heavily customized (commercial billing platforms like Zuora, Stripe Billing don't natively support hyperscaler consumption pass-through model with multi-entity complexity). TRIBAL KNOWLEDGE: Billing team (finance operations) understands: Edge cases in hyperscaler billing (AWS Reserved Instance billing differs from On-Demand, Azure EA vs. CSP billing differ, Google Committed Use Discounts have specific recognition rules), Customer contract interpretation (when customer says 'infrastructure cost' do they mean list price or discounted price?), Revenue recognition rules per jurisdiction (US GAAP vs. IFRS, timing of recognition for upfront payments vs. consumption), Dispute resolution patterns (which customers negotiate aggressively, which accept invoices). CHANGE TIMING: Billing system is UNTOUCHABLE during month-end close (days 25-5 of following month) - any change risks revenue realization for entire company. Can only change in mid-month windows with extensive testing.",
      "what_breaks_if_changed": "SCENARIO 1 - Hyperscaler API Update: AWS changes Partner Portal API (deprecates old endpoint, requires migration to new endpoint). BREAKS: (1) Consumption data ingestion fails (cannot pull AWS usage for customers), (2) Partial invoices sent (Azure and Google Cloud data available, AWS data missing), (3) Customer confusion ('where is my AWS charge?'), (4) Revenue recognition incomplete (AWS portion of revenue not recognized until consumption data restored), (5) Manual workaround required (export AWS data manually, upload to billing system - error-prone, slow). SCENARIO 2 - Billing System Replacement: Replace legacy billing system with modern SaaS platform (Zuora, Stripe, etc.). BREAKS: (1) Customer pricing migration (must migrate 1000s of custom pricing agreements from old to new system - manual, error-prone), (2) Historical consumption data migration (new system needs history for trend analysis, dispute resolution - TBs of data, complex schema mapping), (3) Hyperscaler integration rebuild (new system has different API integration patterns), (4) Multi-currency and multi-entity complexity (SaaS platforms may not support 100+ entity structure), (5) Parallel run required (must run old and new systems simultaneously for 1-3 months to validate accuracy - doubles operational burden), (6) Customer invoice format changes (customers have automated invoice parsing - format change breaks their systems), (7) Revenue recognition audit trail (must maintain complete audit trail from old system through migration to new system for external audits - gaps = qualified audit opinion). TIMELINE: 18-36 months for billing system replacement (industry benchmark for complex B2B billing migrations). RISK: 5-10% of migrations fail or must be rolled back (too many errors, customer complaints, finance team cannot close books). SCENARIO 3 - Consumption Data Reconciliation Failure: Billing system incorrectly reconciles hyperscaler costs (systematic error undercounts consumption by 3%). BREAKS: (1) Rackspace under-bills customers 3% = $82M annual revenue loss, (2) Hyperscalers bill Rackspace full amount = $82M cost not recovered from customers = complete margin elimination + loss, (3) Discovery may take 1-3 months (error hidden in data volume), (4) Customer retroactive billing (must re-invoice customers for 1-3 months of underbilling - customers resist, relationship damage), (5) Write-off likely (cannot collect all underbilling, must absorb 30-50% as cost of error = $25-40M loss).",
      "severity": "HIGH",
      "evidence_sources": [
        "Stage 2.1 revenue engines: Total revenue $2,738M depends on accurate billing (Public Cloud $1,683M + Private Cloud $1,055M)",
        "Stage 2.3 value flows: 'BILLING/FINANCE: Generate invoices pulling hyperscaler consumption data + management fees. Reconcile hyperscaler bills.'",
        "Stage 6.3 platform fragility map: Billing system categorized as CATASTROPHIC blast radius ($2.7B revenue realization at risk)",
        "Industry benchmarks: Complex B2B billing system migrations take 18-36 months with 5-10% failure rate"
      ]
    },
    {
      "platform": "VMware vSphere/vCenter Private Cloud Virtualization Platform",
      "why_untouchable": "Customer workloads RUN ON VMware - not just managed by Rackspace. Customers built applications expecting VMware infrastructure, optimized for VMware performance characteristics, depend on VMware features (vMotion, HA, DRS, snapshots). Cannot unilaterally migrate customers to alternative hypervisor without: (1) Customer consent (workloads are customer property, Rackspace is service provider not owner), (2) Application compatibility validation (customers must test applications on new hypervisor - weeks to months per application), (3) Customer maintenance windows (must schedule downtime or complex cutover - customers have business constraints on when changes allowed), (4) Rollback capability (if migration fails, must restore to VMware quickly). Customer RESISTANCE 40-60%: (1) 'We chose Rackspace FOR VMware compatibility with our on-premises environment' = customer selected Rackspace specifically because VMware, don't want different platform, (2) 'Migration risk too high for production workloads' = customers operate business-critical applications, cannot accept migration risk, (3) 'We'll reassess relationship after migration' = customers use migration as trigger to evaluate alternatives (AWS, Azure, competitor MSPs). VENDOR HOSTAGE: Broadcom VMware price increase 200-300% ($100-210M annual cost shock per Stage 6.2) makes VMware economically painful BUT exit would cost MORE ($200-500M migration cost + 30-50% customer churn = $316-528M revenue loss). Broadcom KNOWS customers are locked in and exploits this through pricing. Rackspace is stuck between: (1) Accepting vendor exploitation (absorb cost increase = margin elimination, OR pass to customers = churn acceleration), (2) Exiting VMware (lose 30-50% Private Cloud customers immediately, remaining customers churn over 24-48 month migration = Private Cloud business destruction). NO GOOD OPTIONS = platform untouchable despite massive cost increase. LONG-TERM: Private Cloud declining 13% YoY (customers migrating to public cloud alternatives over time) - VMware platform is MELTING ICE CUBE. Cannot force acceleration of decline by attempting rapid VMware exit (would cause immediate 30-50% churn vs. slow 13%/year erosion).",
      "what_breaks_if_changed": "SCENARIO: Migrate Private Cloud customers from VMware vSphere to Nutanix AHV (alternative hypervisor) to escape Broadcom pricing. BREAKS: (1) Customer workloads require RE-BUILD (VMware VMs must be exported, converted, imported to Nutanix - cannot lift-and-shift), (2) VMware-specific features break (customers using vMotion, HA, DRS, snapshots must re-architect for Nutanix equivalents), (3) Application testing required per customer (100s of applications across Private Cloud customer base, must test each for Nutanix compatibility), (4) Customer downtime or complex cutover (production workloads cannot have extended outages - must coordinate maintenance windows, prepare rollback plans), (5) Customer REFUSAL 40-60% ('we don't want Nutanix, we want VMware' - customers chose Rackspace FOR VMware, will exit rather than accept forced migration), (6) Operations team retraining (VMware expertise doesn't transfer to Nutanix - 12-24 months to build equivalent troubleshooting knowledge), (7) Compliance RE-CERTIFICATION (FedRAMP, UK Sovereign, SOC 2, ISO 27001 certified for VMware infrastructure - Nutanix requires re-assessment: 6-18 months per certification), (8) Backup/DR system replacement (VMware-specific backup tools incompatible with Nutanix), (9) Monitoring integration rebuild (VMware vCenter APIs differ from Nutanix Prism APIs). INCREMENTAL MIGRATION COMPLEXITY: Running VMware + Nutanix in parallel = (1) Dual infrastructure CapEx (must build Nutanix capacity before migrating customers off VMware), (2) Dual operational expertise (teams must master both platforms = training cost, efficiency loss), (3) Dual compliance maintenance (certify and audit BOTH platforms). BIG-BANG IMPOSSIBILITY: Cannot migrate all customers simultaneously (operational capacity limits, risk concentration - if migration fails, affects all customers at once). TIMELINE: 24-48 months for complete Private Cloud migration from VMware to Nutanix. CUSTOMER CHURN: 30-50% expected = $316-528M revenue loss. NET ECONOMICS: Migration destroys MORE value ($316-528M revenue loss) than it saves ($100-210M Broadcom cost reduction) = economically IRRATIONAL. Platform is UNTOUCHABLE - must accept vendor exploitation because exit is worse.",
      "severity": "HIGH",
      "evidence_sources": [
        "Stage 2.1 revenue engines: Private Cloud $1,055M (39% of total), declining 13% YoY",
        "Stage 6.2 cloud dependency map: VMware dependency $1,055M at risk, Broadcom price shock $100-210M annually ACTIVE, exit cost $200-500M, VERY LOW feasibility",
        "Stage 6.3 platform fragility map: VMware categorized as SEVERE blast radius, customer workload coupling prevents unilateral change",
        "Industry context: Broadcom VMware 200-300% price increases, customers experiencing 20-30% churn but REMAINING customers locked in by application dependencies"
      ]
    },
    {
      "platform": "Identity, Access Management (IAM), and Entitlement Platform",
      "why_untouchable": "IAM is SECURITY PERIMETER for entire business - single point of failure for: (1) Operations (employees cannot access customer environments without IAM), (2) Compliance (access controls and audit trails required for SOC 2, ISO 27001, FedRAMP, HIPAA, PCI DSS), (3) Customer trust (customers audit Rackspace access controls to validate their data is protected). IAM failure scenarios: (1) OUTAGE = nobody can work (employees locked out, operations halt, incidents cannot be responded to), (2) MISCONFIGURATION = security breach (wrong permissions granted, unauthorized access occurs, customer data exposed), (3) AUDIT TRAIL LOSS = compliance failure (cannot prove who accessed what, auditors issue findings, certifications at risk). Platform exhibits HIGHEST CHANGE RISK: (1) Complex permission models (customers have unique requirements, employees have role-specific access, compliance adds restrictions), (2) Limited testing ability (cannot fully test all permission combinations in pre-production - too many edge cases), (3) 24/7 availability requirement (cannot schedule maintenance windows - IAM must be always-on), (4) Security-critical (mistakes create breach risk, not just operational inconvenience). TRIBAL KNOWLEDGE: IAM administrators understand: (1) Which employees need access to which customer environments (relationship history, expertise matching), (2) Customer-specific access restrictions (some customers require IAM-level controls beyond standard RBAC), (3) Compliance-driven permission patterns (FedRAMP requires certain role separations, HIPAA requires different controls), (4) Emergency access procedures (when IAM breaks, how to restore access without creating security gaps). IAM CHANGES require: (1) Security review (every change assessed for breach risk), (2) Compliance review (access control changes may require assessor notification), (3) Phased rollout (change small subset of users first, monitor for issues), (4) 24/7 on-call staffing during change (if IAM breaks, must fix immediately regardless of time), (5) Instant rollback capability (cannot troubleshoot IAM issues for hours - must revert or fix in minutes).",
      "what_breaks_if_changed": "SCENARIO 1 - IAM Platform Migration: Migrate from legacy IAM to modern identity platform (Okta, Auth0, Azure AD). BREAKS: (1) User migration complexity (1000s of employee accounts + customer user accounts must migrate with correct permissions), (2) Integration rebuild (every system authenticating via IAM must update - portal, provisioning, monitoring, ticketing, billing, internal tools), (3) Permission model mapping (legacy IAM may use different permission concepts than modern platform - cannot directly map), (4) Federated identity customers break (customers using SSO integration with legacy IAM must reconfigure for new platform), (5) Compliance audit trail continuity (must maintain complete access history from legacy through migration to new - gaps = audit findings), (6) Rollback complexity (if migration fails, reverting to legacy IAM after partial migration creates permission inconsistencies). SCENARIO 2 - Permission Model Simplification: Consolidate complex customer-specific permissions into standardized roles to reduce operational burden. BREAKS: (1) Customer objections ('we require specific access controls per our security policy, cannot accept standard roles'), (2) Compliance violations (some customers have regulatory requirements for role separation - standard roles may not meet), (3) Over-permissioning risk (standard roles may grant more access than needed - security concern), (4) Under-permissioning reality (standard roles may grant less access than some users need - operational breakage). SCENARIO 3 - Multi-Factor Authentication (MFA) Enforcement: Require MFA for all users to improve security posture. BREAKS: (1) User resistance ('MFA is inconvenient, slows down incident response'), (2) Automation breakage (service accounts and API keys don't support MFA - must implement different solution for non-human access), (3) Emergency access procedures (if MFA system fails, how do engineers respond to urgent customer incidents?), (4) Compliance approval required (change to access controls documented in security policies - must notify assessors, update SSP, potentially trigger supplemental assessment).",
      "severity": "HIGH",
      "evidence_sources": [
        "Stage 6.3 platform fragility map: IAM categorized as SEVERE blast radius, controls all operations + compliance",
        "Compliance requirements: SOC 2, ISO 27001, FedRAMP, HIPAA all mandate access controls and audit trails",
        "Stage 2.3 value flows: Operations teams require access to customer infrastructure, IAM controls this access",
        "Industry practice: IAM migrations are highest-risk IT projects (security-critical, limited testing, complex permissions, 24/7 availability requirement)"
      ]
    }
  ],
  "untouchable_systems_summary": {
    "total_untouchable": 5,
    "catastrophic_severity": 3,
    "high_severity": 5,
    "why_systems_untouchable": "FIVE PLATFORMS identified where change is PROHIBITED (compliance/regulatory), IRRATIONAL (cost exceeds benefit), or REQUIRES CUSTOMER CONSENT (workload dependencies). Common patterns: (1) COMPLIANCE LOCK-IN - FedRAMP and UK Sovereign platforms cannot change without re-certification (6-18 months) or regulatory breach (immediate), (2) REVENUE DEPENDENCY - Billing system failure delays/prevents $2.7B revenue realization making it highest-risk change, (3) CUSTOMER WORKLOAD COUPLING - VMware hosts customer applications requiring customer consent and migration coordination to change, (4) SECURITY CRITICALITY - IAM is security perimeter with limited testing and 24/7 availability requirement preventing confident changes, (5) VENDOR HOSTAGE - VMware demonstrates extreme case where vendor exploitation ($100-210M cost increase) must be accepted because exit costs more ($316-528M revenue loss).",
    "implications_for_strategy": "Platforms identified as 'untouchable' create STRATEGIC CONSTRAINTS: (1) CANNOT pursue global infrastructure consolidation (would violate FedRAMP and UK Sovereign isolation requirements), (2) CANNOT exit VMware to escape Broadcom pricing (customer churn exceeds cost savings), (3) CANNOT modernize billing system without 18-36 month program and 5-10% failure risk, (4) CANNOT change IAM without accepting security and compliance risk, (5) CANNOT reduce compliance platform costs without losing federal government revenue. Any strategy assuming 'rationalize technology estate', 'consolidate platforms', 'exit unfavorable vendors', or 'modernize legacy systems' must FIRST identify which platforms are untouchable and exclude them from rationalization scope. Realistic assessment: 50-70% of platform estate is likely untouchable due to revenue dependencies, compliance constraints, customer coupling, or economic irrationality of change. Only 30-50% of platforms are changeable without unacceptable risk.",
    "economic_reality": "Untouchable platforms create PERMANENT COST STRUCTURES: (1) UK Sovereign requires duplicate infrastructure (cannot leverage global scale), (2) FedRAMP requires dedicated compliance team and isolated operations (cannot consolidate with commercial), (3) VMware requires accepting vendor price increases (locked in by customer workloads), (4) Billing system complexity requires large finance operations team (cannot simplify without multi-year migration), (5) IAM requires security-expert administrators (cannot reduce to commodity IT operations). These cost structures are NOT inefficiencies to eliminate - they are BUSINESS REQUIREMENTS for serving regulated industries, government customers, and Private Cloud workload hosting. Cost reduction initiatives that target 'platform rationalization' or 'technical debt elimination' will fail if they attempt to touch untouchable systems - will encounter customer objections, compliance violations, or operational failures forcing rollback. Better approach: Accept that 50-70% of platform costs are structural/permanent, focus cost reduction on remaining 30-50% of changeable platforms."
  }
}
