{
  "uncertainty_register": [
    {
      "unknown": "GOVERNMENT REVENUE MAGNITUDE: Exact dollar amount of revenue from Rackspace Government Solutions (FedRAMP-authorized federal business) as % of total revenue. Serves >50% of federal cabinet agencies but revenue not separately disclosed.",
      "type": "UNKNOWN",
      "decision_impact": "VALUATION MATERIALITY: If government = 5% of revenue ($135M), impact is minor. If government = 15% of revenue ($410M), foreign buyer must haircut 15% of enterprise value OR US buyer must discount for re-authorization risk. AFFECTS: Buyer universe (foreign vs US only), valuation haircut magnitude, deal structure (carve-out possibility).",
      "what_would_reduce_uncertainty": "ACCESS: Request breakdown of revenue by customer segment (federal government vs state/local vs commercial) from management. VALIDATION: Review FedRAMP-specific contracts, federal customer list, ATO (Authority to Operate) documentation showing active agencies. BENCHMARK: Compare to competitors with disclosed government revenue (e.g., Carahsoft, other FedRAMP MSPs)."
    },
    {
      "unknown": "UK SOVEREIGN SERVICES REVENUE: Exact dollar amount and customer count for UK Sovereign Services launched March 2024. Serves UK government, NHS, police, financial services but revenue not disclosed (too new?).",
      "type": "UNKNOWN",
      "decision_impact": "GROWTH vs DISTRACTION: If UK Sovereign = <$10M revenue (immaterial), it is strategic bet with unclear ROI. If UK Sovereign = $50-100M revenue 10 months post-launch (material), it demonstrates demand for sovereign cloud and potential growth vector. AFFECTS: Valuation of UK entity, strategic importance, whether to maintain/expand/divest UK Sovereign post-acquisition.",
      "what_would_reduce_uncertainty": "ACCESS: Request UK Sovereign Services P&L from management: revenue, customer count, bookings pipeline, gross margin, infrastructure CapEx. VALIDATION: Review UK customer contracts, VMware Sovereign Cloud certification documentation, BT partnership terms. DILIGENCE: Assess UK sovereign cloud market size, competitive landscape (e.g., OVHcloud, Atos), and Rackspace market position."
    },
    {
      "unknown": "HYPERSCALER PARTNER ECONOMICS: Exact terms of AWS/Azure/Google Cloud reseller agreements: partner credits/rebates percentage, term length, termination provisions, volume commitments. Microsoft Azure PEC documented at ~15% but AWS/Google not disclosed.",
      "type": "UNKNOWN",
      "decision_impact": "ECONOMIC VIABILITY: If hyperscaler credits are 10-15% of infrastructure spend and represent majority of Rackspace's infrastructure margin, then: (1) Public Cloud gross margin 10.4% is fragile (5-7% credit reduction = unprofitable), (2) Hyperscaler partnership termination or unfavorable renegotiation destroys $1.7B revenue engine, (3) Buyer cannot assume current economics are sustainable. AFFECTS: Public Cloud valuation multiple, synergy assumptions, strategic rationale for acquisition.",
      "what_would_reduce_uncertainty": "ACCESS: Request hyperscaler reseller agreements under NDA (AWS Consulting Partner Agreement, Azure CSP Agreement, Google Cloud Partner Agreement). FOCUS: Partner credit/rebate schedules, volume tier thresholds, agreement term and auto-renewal provisions, termination clauses, change-of-control consent requirements. BENCHMARK: Interview other hyperscaler MSPs (off-record) to validate typical partner economics."
    },
    {
      "unknown": "CUSTOMER CONCENTRATION: Revenue from top 10 customers as % of total. Company serves 81,000+ customers but concentration not disclosed. Do large enterprise customers (e.g., healthcare contract 'hundreds of millions TCV') represent 10%, 20%, 30%+ of revenue?",
      "type": "UNKNOWN",
      "decision_impact": "REVENUE RISK: If top 10 customers = 30%+ of revenue, loss of 1-2 customers could impact quarterly results by 5-10%. Creates: (1) Earnings volatility, (2) Customer-specific execution risk, (3) Negotiating leverage imbalance (large customers can demand pricing concessions). If top 10 customers = <10% of revenue (highly diversified), customer loss risk is manageable. AFFECTS: Revenue quality, risk adjustment in valuation, need for customer-specific diligence.",
      "what_would_reduce_uncertainty": "ACCESS: Request top 25 customers by revenue (customer name, annual revenue, contract term, renewal date, gross margin, NPS/satisfaction score, churn risk assessment). VALIDATION: Assess concentration by: (1) Single customer as % of revenue, (2) Top 10 cumulative %, (3) Industry concentration (e.g., % from healthcare, financial services, government), (4) Geographic concentration. PROACTIVE: Identify customers with upcoming renewals or at-risk (satisfaction issues, competitive threats)."
    },
    {
      "unknown": "EMAIL HOSTING REVENUE BASELINE & CHURN IMPACT: Pre-price-increase email hosting revenue, customer count, and mailbox count. Post-price-increase (March 2026) churn rate, revenue impact, and customer retention. Partners predict 'wave of churn' but actual impact unknown.",
      "type": "UNKNOWN",
      "decision_impact": "REVENUE CLIFF OR CONTAINED LOSS: If email hosting = 2% of revenue ($55M) and churn = 50%, revenue impact is $27M (1% of total, manageable). If email hosting = 8% of revenue ($220M) and churn = 70%, revenue impact is $154M (5.6% of total, material). TIMING: Impact occurs in Q2-Q4 2026, affecting near-term financial projections. REPUTATIONAL: Churn severity indicates brand damage that may affect retention in other segments. AFFECTS: 2026 revenue forecast, EBITDA projections, need for churn mitigation plan.",
      "what_would_reduce_uncertainty": "ACCESS: Request email hosting segment data: revenue (pre/post price increase), customer count, mailbox count, churn rate by month (March-June 2026), retention by customer segment (SMB vs enterprise), partner/reseller feedback. BENCHMARK: Compare Rackspace email churn to industry norms for price-increase-driven churn (SaaS typical: 20-40% for doubling price, 50-70% for 3x+ increase). PROACTIVE: Assess management plan to mitigate churn or replace lost revenue."
    },
    {
      "unknown": "ACQUIRED ENTITY INTEGRATION STATUS & VALUE REALIZATION: Integration completion for Datapipe ($684M, 2017), Onica ($250M, 2019), TriCore ($21M, 2019), RelationEdge (undisclosed, 2019). Customer retention post-acquisition, technology platform consolidation, realized synergies vs projections.",
      "type": "UNKNOWN",
      "decision_impact": "HIDDEN LIABILITIES OR UNREALIZED VALUE: If acquisitions fully integrated and synergies captured, then $1.7B spend was justified (but revenue declining 7% YoY suggests otherwise). If acquisitions remain partially integrated, buyer inherits: (1) Incomplete integration projects requiring capital/effort, (2) Duplicative systems and cost structure, (3) Customer fragmentation, (4) Technology debt. If integration failed and customers churned, $1.7B spend was value destruction. AFFECTS: Quality of revenue, cost structure efficiency, buyer's integration workplan, potential for divestitures or write-downs.",
      "what_would_reduce_uncertainty": "ACCESS: Request acquisition post-mortem reports: (1) Customer retention by acquisition (% of acquired customers still active, revenue retention), (2) Platform consolidation status (are Datapipe/Onica/TriCore customers on unified Rackspace platform or separate legacy platforms?), (3) Synergy realization (projected vs actual cost savings, revenue synergies), (4) Staff retention (% of key employees still with company). DILIGENCE: Interview acquired entity leaders (if still employed) or customers to assess integration success."
    },
    {
      "unknown": "CHINA OPERATIONS REVENUE, ENTITY STRUCTURE, AND STRATEGIC IMPORTANCE: Revenue from China operations, exact legal entity name/structure, JV partner (if applicable), customer base, regulatory compliance status, and strategic rationale for maintaining China presence.",
      "type": "UNKNOWN",
      "decision_impact": "DIVEST OR MAINTAIN: If China = <1% of revenue ($27M), it may be non-core and divest-able to simplify structure. If China = 5% of revenue ($135M), it is material and divestiture creates revenue hole. RISK: China Cybersecurity Law requires local entity and government oversight - potential for: (1) Forced technology transfer, (2) Government access to data/systems, (3) Operational restrictions, (4) Geopolitical risk (US-China tensions, export controls, sanctions). BUYER CONCERN: US buyer may face regulatory scrutiny maintaining China operations (CFIUS review of China tech exposure). AFFECTS: Buyer universe, valuation, divestiture requirements, geopolitical risk assessment.",
      "what_would_reduce_uncertainty": "ACCESS: Request China operations P&L, legal entity structure, JV partnership agreements (if applicable), customer list, regulatory compliance documentation (Cybersecurity Law, data localization). VALIDATION: Understand government oversight mechanisms, data access requirements, restrictions on foreign ownership/control. STRATEGIC: Assess whether China operations are growth opportunity, strategic presence, or legacy liability. PROACTIVE: Evaluate divestiture optionality and buyer interest in China cloud/hosting businesses."
    },
    {
      "unknown": "APOLLO EXIT INTENT & TIMELINE: Apollo Global Management owns 53-57% stake worth $64-68M at current $0.48 stock price (vs likely $500M+ paid in 2016 LBO + 2020 IPO). Is Apollo seeking exit (secondary sale, sponsor-to-sponsor, take-private), or trapped due to illiquidity/valuation?",
      "type": "UNKNOWN",
      "decision_impact": "MOTIVATED SELLER OR HOLD: If Apollo is motivated seller (seeking exit to realize losses and redeploy capital), this creates: (1) Deal urgency, (2) Negotiating leverage for buyer (Apollo may accept lower valuation to exit), (3) Cleaner transaction (majority owner selling to single buyer vs take-private requiring minority squeeze-out). If Apollo is holding (waiting for valuation recovery or operational turnaround), this creates: (1) No deal urgency, (2) Higher price expectations, (3) Potential for Apollo to block or interfere with transaction. AFFECTS: Deal timeline, valuation expectations, transaction structure, likelihood of deal completion.",
      "what_would_reduce_uncertainty": "BACKCHANNEL: Reach out to Apollo principals (Aaron Sobel, Vikram Mahidhar per Stage 1) or Apollo's tech/telecom investment team to gauge exit interest. INDICATION: Submit non-binding LOI to test Apollo's price expectations and responsiveness. MARKET CHECK: Assess whether Apollo has run process previously (banker discussions, CIM circulation, prior buyer interest). PUBLIC SIGNALS: Monitor for: (1) Board changes, (2) Executive turnover, (3) Strategic review announcements, (4) Activist investor involvement, (5) Debt refinancing (extending maturities = planning to hold, near-term maturity = exit pressure)."
    },
    {
      "unknown": "DEBT COVENANTS & FINANCIAL FLEXIBILITY: Exact terms of $1.3B First Lien Term Loan: EBITDA covenants, springing covenant threshold (revolver utilization >35% triggers 5.0x leverage covenant per Stage 1), amortization schedule, maturity date, prepayment penalties, change-of-control provisions requiring lender consent or repayment.",
      "type": "UNKNOWN",
      "decision_impact": "TRANSACTION MECHANICS & REFINANCING NEED: If debt has change-of-control repayment requirement, buyer must: (1) Refinance $1.3B debt (requires new debt raise or equity contribution), (2) Obtain lender consent (lenders may demand pricing increase, tighter covenants, or equity contribution), (3) Factor refinancing cost/risk into transaction economics. If EBITDA declining and approaching covenant violations, this creates: (1) Default risk if covenants breached, (2) Lender leverage to demand amendments/fees, (3) Constrained operational flexibility (negative covenants restrict M&A, CapEx, dividends). AFFECTS: Buyer financing structure, transaction complexity, enterprise value, covenant compliance risk.",
      "what_would_reduce_uncertainty": "ACCESS: Request First Lien Credit Agreement (full document, not summary), recent compliance certificates, lender amendment history. FOCUS: Change-of-control definition (does asset sale, equity sale, or parent change trigger?), mandatory prepayment provisions, covenant calculations (EBITDA definition, addbacks allowed), negative covenants (restrictions on asset sales, additional debt, dividends, investments). LENDER OUTREACH: Backchannel discussion with lead lenders to assess refinancing or consent likelihood and pricing."
    },
    {
      "unknown": "RACKSPACE COMPETITIVE POSITIONING & MARKET SHARE: Rackspace's market share in managed cloud services, competitive position vs peers (Accenture Cloud, DXC Technology, IBM Services, Wipro, HCL, etc.), and differentiation sustainability. Is Rackspace leader, niche player, or losing relevance?",
      "type": "UNKNOWN",
      "decision_impact": "STRATEGIC VALUE OR MELTING ICE CUBE: If Rackspace is market leader or strong #2/#3 with defensible competitive position, then: (1) Revenue decline is cyclical and fixable with better execution/investment, (2) Asset has strategic value to acquirer seeking cloud managed services platform, (3) Turnaround is plausible. If Rackspace is losing market share to hyperscalers (AWS/Azure/Google native services) and IT services giants (Accenture, IBM), then: (1) Revenue decline is secular and irreversible, (2) Asset is melting ice cube with limited strategic value, (3) Turnaround is unlikely without major pivot. AFFECTS: Strategic rationale, valuation methodology (DCF assumes turnaround vs liquidation value), buyer universe (strategic vs financial).",
      "what_would_reduce_uncertainty": "MARKET RESEARCH: Commission Gartner, Forrester, or IDC report on managed cloud services market: market size, growth rate, market share by provider, competitive dynamics, customer buying criteria, pricing trends. CUSTOMER INTERVIEWS: Conduct primary research with current/former Rackspace customers and competitive alternatives to assess: (1) Why customers choose Rackspace vs alternatives, (2) Why customers churn, (3) Perception of Rackspace value proposition vs hyperscaler-direct or IT services giants. WIN/LOSS ANALYSIS: Request Rackspace sales team win/loss data to identify competitive positioning trends."
    }
  ]
}
