{
  "disconfirming_evidence_not_found": [
    "Evidence of Public Cloud revenue growth or stabilization (SOUGHT but NOT FOUND): Public Cloud revenue declining 3% YoY despite hyperscaler market growing 20%+. No evidence of Rackspace capturing share or reversing decline.",
    "Evidence of Public Cloud margin expansion (SOUGHT but NOT FOUND): Gross margin 10.4% and declining (overall margin 19.5% down from 21.3% YoY). No evidence of pricing power or cost efficiency improvements.",
    "Evidence of Private Cloud revenue stabilization (SOUGHT but NOT FOUND): Private Cloud declining 13% YoY, accelerating from prior periods. No evidence of customer retention initiatives or demand recovery.",
    "Evidence of customer switching costs or contractual lock-in (SOUGHT but NOT FOUND): Month-to-month billing standard per Rackspace billing FAQ. No evidence of long-term contracts, termination penalties, or high switching costs preventing customer migration to hyperscaler-direct.",
    "Evidence of long-term guaranteed hyperscaler partnership terms (SOUGHT but NOT FOUND): Reseller agreements not publicly disclosed. No evidence of multi-year commitments or guaranteed partner credits/rebates from AWS/Azure/Google.",
    "Evidence of Rackspace proprietary IP, unique certifications, or exclusive partnerships creating competitive moat (SOUGHT but NOT FOUND): Fanatical Support is service delivery methodology (replicable). Certifications (FedRAMP, SOC, ISO) are common. Hyperscaler partnerships non-exclusive (hundreds of MSPs are AWS/Azure/Google partners). No proprietary technology identified.",
    "Evidence of FedRAMP authorization transferability or streamlined change-of-control process (SOUGHT but NOT FOUND): FedRAMP authorization is entity-specific by regulation. No evidence of exceptions or expedited transfer mechanisms.",
    "Evidence of UK Sovereign Services integration flexibility or infrastructure sharing (SOUGHT but NOT FOUND): UK Sovereign is architecturally isolated by compliance design. No evidence of shared infrastructure or cross-border staffing allowed.",
    "Evidence of acquired entity integration success or synergy realization (SOUGHT but NOT FOUND): Datapipe/Onica/TriCore/RelationEdge integration status not disclosed. No management KPIs, customer retention metrics, or synergy capture reported. Revenue declining 7% YoY suggests acquisitions did not create competitive advantage.",
    "Evidence of email hosting customer retention despite 706% price increase (SOUGHT but NOT FOUND): Partners report 'immediate churn', 'devastating impact'. No evidence of customer acceptance or justification for price increase beyond margin defense.",
    "Evidence of revenue growth drivers or strategic initiatives reversing decline (SOUGHT but NOT FOUND): Both segments declining (Private -13%, Public -3%). Bookings grew 14% YoY (pipeline indicator) but conversion to revenue uncertain. No material new product launches, market expansions, or partnerships announced.",
    "Evidence of margin expansion initiatives or cost restructuring improving profitability (SOUGHT but NOT FOUND): Gross margin declining 19.5% from 21.3%. No evidence of cost reduction programs, operational efficiency improvements, or margin recovery plan disclosed.",
    "Evidence of market re-rating or institutional investor interest in Rackspace (SOUGHT but NOT FOUND): Stock price $0.48, market cap $120M (0.04x revenue multiple vs SaaS typical 3-10x). Delisting risk (below NASDAQ $1.00 minimum). No evidence of activist investors, strategic buyer leaks, or positive analyst coverage.",
    "Evidence of Apollo exit strategy or motivated seller (SOUGHT but NOT FOUND): Apollo owns 53-57% worth $64-68M (likely down from $500M+ investment). No public announcements of strategic review, banker engagement, or exit process. Unknown if Apollo is motivated seller or trapped holder.",
    "Evidence of customer concentration metrics (SOUGHT but NOT FOUND): 10-K typically discloses customers >10% of revenue. Search results did not surface concentration data. Unknown if top 10 customers are 10%, 20%, or 30%+ of revenue.",
    "Evidence of government revenue magnitude (SOUGHT but NOT FOUND): Serves >50% of federal cabinet agencies but revenue not separately disclosed. Unknown if government is 5%, 10%, or 15%+ of total revenue.",
    "Evidence of UK Sovereign Services revenue or customer metrics (SOUGHT but NOT FOUND): Launched March 2024 but revenue, customer count, and bookings pipeline not disclosed. Unknown if material contributor or immaterial experiment.",
    "Evidence of China operations revenue, entity structure, or JV partners (SOUGHT but NOT FOUND): Stage 1 identified China entity exists with Shanghai data center, but revenue, structure, and strategic importance unknown.",
    "Evidence of competitive market share data or positioning (SOUGHT but NOT FOUND): Rackspace's market share in managed cloud services not disclosed. Unknown if market leader, strong #2/#3, or losing relevance to hyperscalers and IT services giants.",
    "Evidence of hyperscaler AWS/Google partnership terms and economics (SOUGHT but NOT FOUND): Azure PEC documented at ~15%, but AWS/Google partner credits, agreement terms, and volume thresholds not disclosed. Unknown if sustainable or at risk.",
    "Evidence of debt covenant details and refinancing flexibility (SOUGHT but NOT FOUND): $1.3B First Lien Term Loan with change-of-control provisions and springing covenant (5.0x leverage if revolver >35% drawn) per Stage 1, but full credit agreement terms, EBITDA calculations, and covenant headroom not disclosed.",
    "Evidence of customer NPS, retention rates, or satisfaction metrics (SOUGHT but NOT FOUND): Historical articles (2011-2013) describe Fanatical Support customer loyalty. No recent customer satisfaction data, NPS scores, or retention rates disclosed. Email pricing debacle suggests brand damage but magnitude unknown.",
    "Evidence of professional services revenue magnitude or margin (SOUGHT but NOT FOUND): Professional services mentioned as variable contributor to quarterly revenue, but not separately disclosed. Unknown if 5%, 10%, or 15% of revenue and whether profitable or margin-dilutive.",
    "Evidence of Rackspace-specific differentiators vs hyperscaler native managed services (SOUGHT but NOT FOUND): Rackspace value proposition is '24x7 certified engineers' and 'Fanatical Support', but no quantifiable ROI, customer testimonials, or competitive analysis demonstrating superiority over AWS Managed Services, Azure Managed Services. Differentiation appears commoditized.",
    "Evidence of data center capacity utilization or efficiency metrics (SOUGHT but NOT FOUND): Private Cloud requires owned/leased data center capacity. Unknown if Rackspace is operating at 50%, 70%, or 90% utilization. Underutilized capacity = cost burden; insufficient capacity = lost revenue. Revenue declining 13% YoY suggests likely underutilization.",
    "Evidence of VMware licensing cost impact or migration to alternatives (SOUGHT but NOT FOUND): Broadcom VMware price increases 200-300% post-acquisition (Nov 2023). Unknown if Rackspace absorbing cost (margin compression), passing through to customers (customer churn), or migrating to alternatives (OpenStack, Microsoft). Private Cloud margin 38.6% but unknown if sustainable with VMware cost pressure."
  ]
}
